{
    "4 7 2025": {
        "importantArticles": [
            {
                "headline": "Investors piled into technology stocks over the past couple of years on optimism that artificial intelligence (AI) could become the next great revolution.  Unsurprisingly, tech stocks led gains in the Nasdaq Composite (NASDAQINDEX: ^IXIC), but they also drove the Dow Jones Industrial Average (DJINDICES: ^DJI) and the S&P 500 (SNPINDEX: ^GSPC) higher.  Nvidia (NASDAQ: NVDA) and Palantir Technologies posted the top performances in those two indexes, respectively, last year.",
                "publication_date": "2025-04-07T08:12:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8968",
                "source": "Motley Fool",
                "ticker": "AAPL",
                "title": "Dan Ives Calls Import Tariffs \"Armageddon.\" Should You Really Buy Tech Stocks Now?",
                "url": "https://finance.yahoo.com/news/dan-ives-calls-import-tariffs-081200205.html"
            },
            {
                "headline": "(Bloomberg) -- Among the world’s richest people, Warren Buffett is among the rare few whose personal fortunes have grown this year after President Donald Trump’s tariffs triggered a selloff that erased trillions of dollars of value from global equities. Most Read from BloombergHousing Agency Aims to Relocate Its DC HeadquartersThe Irish Hot Press Is the Low-Tech Laundry Trick the World NeedsThis Skinny Mexico City Tower Is Just 14 Feet Wide on One SideBoston Mayor Wu Embraces Trump Resistance as",
                "publication_date": "2025-04-07T22:14:40.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.6808",
                "source": "Bloomberg",
                "ticker": "AAPL",
                "title": "Buffett’s 2025 Wealth Gains Stand Out Amid Billionaire Wipeout",
                "url": "https://finance.yahoo.com/news/buffett-2025-wealth-gains-stand-221440531.html"
            },
            {
                "headline": "The \"Magnificent Seven\" tech stocks saw a volatile trading session Monday as the Trump administration’s global tariff plan rocked markets for a third day.",
                "publication_date": "2025-04-07T13:39:20.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.5994",
                "source": "Yahoo Finance",
                "ticker": "AAPL",
                "title": "'Magnificent 7' stocks wobble as Trump tariffs spur market chaos",
                "url": "https://finance.yahoo.com/news/magnificent-7-stocks-wobble-as-trump-tariffs-spur-market-chaos-133920801.html"
            },
            {
                "headline": "Apple was falling after a Wall Street bull cut his price target on the iPhone maker amid tariff fears.",
                "publication_date": "2025-04-07T15:26:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.6705",
                "source": "Barrons.com",
                "ticker": "AAPL",
                "title": "Apple Stock Falls Again. How the Rest of the Mag 7 Are Trading.",
                "url": "https://finance.yahoo.com/m/5fb36dcb-2c4e-306e-a6bd-9e8754121c57/apple-stock-falls-again-how.html"
            },
            {
                "headline": "Apple’s (AAPL) initial plan to take the edge off of President Donald Trump’s trade war includes sourcing more of its phones for the U.S. market from factories in India, according to the Wall Street Journal.",
                "publication_date": "2025-04-07T21:51:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5994",
                "source": "Quartz",
                "ticker": "AAPL",
                "title": "Apple's plan for trade war damage control could run through India",
                "url": "https://finance.yahoo.com/news/apples-plan-trade-war-damage-215100655.html"
            },
            {
                "headline": "The \"Magnificent Seven\" stocks sank on Monday, extending a market rout that has wiped off around $2 trillion from their combined value as investors worry about the financial fallout of U.S. President Donald Trump's global tariff war.  The latest slide followed cuts in price target for Apple and Tesla shares from one of Wall Street's most bullish tech analysts, Dan Ives, who warned of a \"tariff economic armageddon\".  The cuts came as Trump doubled down on tariffs on Sunday, telling investors to endure the consequences and ruling out trade talks with China for now.",
                "publication_date": "2025-04-07T14:17:22.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5859",
                "source": "Reuters",
                "ticker": "AAPL",
                "title": "Tariff storm ravages Magnificent Seven as Apple nears one-year low",
                "url": "https://finance.yahoo.com/news/tariff-storm-ravages-magnificent-seven-141722059.html"
            }
        ],
        "avgScore": 0.0787941176470588
    },
    "4 4 2025": {
        "importantArticles": [
            {
                "headline": "Believe it or not, there are other things going on in the world of business and tech than tariffs and sell-offs in the \"Magnificent 7.\" Take blockchain, crypto and Web3 – three areas that continue to see their fair share of startups seeking to make their names. Yahoo Finance Executive Editor Brian Sozzi sits down with Mysten Labs co-founder and CEO Evan Cheng. Cheng has spent good chunks of time in tech leadership roles at Apple (AAPL) and Meta (META). Since 2021, he has been building the Web3 platform Mylen Labs. The timing looks to have been spot on, as the crypto space has notched several wins under the Trump administration. With President Trump leaning into making the US the bitcoin (BTC-USD) capital of the world, what does it mean for Web3 early entrants such as Mylen Labs? Cheng weighs in,and shares how leadership lessons learned at Apple and Meta are paying dividends at his startup. For full episodes of Opening Bid, listen on your favorite podcast platform or watch on our website. Yahoo Finance's Opening Bid is produced by Langston Sessoms",
                "publication_date": "2025-04-04T10:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9595",
                "source": "Yahoo Finance Video",
                "ticker": "AAPL",
                "title": "OpenAI, Apple, & Meta race to dominate the future of this tech",
                "url": "https://finance.yahoo.com/video/openai-apple-meta-race-dominate-100000403.html"
            },
            {
                "headline": "Flexera has introduced Cloud License Management, a solution designed to enhance the management of cloud software expenditures, which have become a significant concern for organizations with cloud spend challenges surpassing even security issues. This new tool allows organizations to gain a comprehensive understanding of their cloud software investments across platforms like Amazon Web Services and Microsoft Azure. By providing a unified view of cloud software spend, along with actionable...",
                "publication_date": "2025-04-04T12:07:44.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9432",
                "source": "Simply Wall St.",
                "ticker": "AAPL",
                "title": "Latest News In Cloud AI - Optimizing Cloud Costs Flexera's Latest Management Tool",
                "url": "https://finance.yahoo.com/news/latest-news-cloud-ai-optimizing-120744376.html"
            },
            {
                "headline": "The CEO did not name any specific customers but said the company is in discussions with Google, Apple, Facebook ,  Amazon  and Microsoft .  In the field of advanced artificial intelligence chip manufacturing, TSMC  holds the lion's share of the market as it supplies wafers to several leading tech firms and chipmakers in the world.",
                "publication_date": "2025-04-04T15:55:04.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8885",
                "source": "Reuters",
                "ticker": "AAPL",
                "title": "Japan's Rapidus in talks with Apple, Google to mass-produce chips, Nikkei reports",
                "url": "https://finance.yahoo.com/news/japans-rapidus-talks-apple-google-155504765.html"
            },
            {
                "headline": "All of Big Tech is feeling the heat from President Donald Trump’s latest tariffs and the escalating global trade war.  Every company has its own unique set of risks stemming from the radical shift in U.S. policy, but Apple faces battles on several fronts.  Indeed, the company has been flagging potential problems since early in Trump’s first term.",
                "publication_date": "2025-04-04T19:39:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.8658",
                "source": "Barrons.com",
                "ticker": "AAPL",
                "title": "Apple Has No Place to Hide. Tariffs on China Are Just One Problem.",
                "url": "https://finance.yahoo.com/m/6b0847b8-d260-3f97-ba07-f396013cc21e/apple-has-no-place-to-hide-.html"
            },
            {
                "headline": "(Bloomberg) -- There’s virtually nowhere to hide for many US technology companies under President Donald Trump’s new tariff regime, the harshest in a century.Most Read from BloombergHousing Agency Aims to Relocate Its DC HeadquartersMetro-North Is Faster Than Acela on NYC-New Haven Route After Signal UpdatesLocal Governments Vie for Fired Federal WorkersLondon Clears Final Hurdle for More High-Speed Trains to EuropeWhat Would ‘Transportation Abundance’ Look Like?After Thursday’s slump wiped $1.4",
                "publication_date": "2025-04-04T13:34:17.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.7705",
                "source": "Bloomberg",
                "ticker": "AAPL",
                "title": "‘Worst-Case Scenario’ for Tech Wipes $1.4 Trillion from Nasdaq",
                "url": "https://finance.yahoo.com/news/worst-case-scenario-tech-wipes-081406416.html"
            },
            {
                "headline": "Nvidia and Tesla led megacaps lower on Friday as stocks continued to sell off amid a global trade war.",
                "publication_date": "2025-04-04T20:28:05.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.7269",
                "source": "Yahoo Finance",
                "ticker": "AAPL",
                "title": "Nvidia, Apple, Tesla stocks plunge, leading another 'Magnificent 7' sell-off as a trade war intensifies",
                "url": "https://finance.yahoo.com/news/nvidia-apple-tesla-stocks-plunge-leading-another-magnificent-7-sell-off-as-a-trade-war-intensifies-202805499.html"
            }
        ],
        "avgScore": -0.08621000000000001
    },
    "4 3 2025": {
        "importantArticles": [
            {
                "headline": "Investing.com -- In February, Apple (NASDAQ:AAPL) CEO Tim Cook was at the White House announcing a plan to invest a massive $500 billion in the U.S. over the next four years. Trump lauded the deal and refers to it frequently to highlight his administration's economic success. However, the agreement hasn’t saved the company from Trump’s newly announced tariffs.",
                "publication_date": "2025-04-03T17:04:05.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9022",
                "source": "Investing.com",
                "ticker": "AAPL",
                "title": "Apple's Cook kissed the ring, but Trump's tariffs wipe out $311 billion in value",
                "url": "https://finance.yahoo.com/news/apples-cook-kissed-trumps-ring-170405110.html"
            },
            {
                "headline": "How can you handle stock market corrections? Use 4 proven guidelines to stay protected and get ready to profit in the next uptrend.",
                "publication_date": "2025-04-03T16:32:33.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8074",
                "source": "Investor's Business Daily",
                "ticker": "AAPL",
                "title": "Here Are 4 Timely Guidelines For How To Handle Market Corrections",
                "url": "https://finance.yahoo.com/m/61f852f3-8f74-3974-9f76-cdfc79cad308/here-are-4-timely-guidelines.html"
            },
            {
                "headline": "(Reuters) -Your favorite iPhone could soon become much pricier, thanks to tariffs.  U.S. President Donald Trump imposed a series of sweeping tariffs on countries around the world that could drastically alter the landscape of global trade, and consumer goods like iPhones could be among the hardest hit, analysts said on Thursday, with increases of 30% to 40% if the company were to pass on the cost to consumers.  Most iPhones are still made in China, which was hit with a 54% tariff.",
                "publication_date": "2025-04-03T16:27:39.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7964",
                "source": "Reuters",
                "ticker": "AAPL",
                "title": "A $2,300 Apple iPhone? Trump tariffs could make that happen",
                "url": "https://finance.yahoo.com/news/trump-tariffs-apple-iphones-more-162739462.html"
            },
            {
                "headline": "At his \"Liberation Day\" spectacle at the White House Wednesday afternoon, Trump revealed a baseline tariff rate of 10% on countries that will go into effect on April 5.Additional tariffs will be added for some countries that the administration considers to be the worst offenders. Some of those alleged worst offenders are important sourcing and business regions for many large US companies such as Apple (AAPL), Nike (NKE), and Walmart (WMT). China, for example, will see an estimated reciprocal tariff of 34%. Vietnam at 32%. Japan is at 24%. The news has hit stocks, with Dow Jones Industrial Average futures down about 1,200 points, or nearly 3% (YM=F). S&P 500 futures are down 3.5% (ES=F), and Nasdaq futures are off by 3.8% (NQ=F). Japan’s Nikkei (^N225) and Hong Kong’s Hang Seng Index (^HSI) have also registered significant losses. Here’s the hot analysis investors need to know right now:First, retail stocks are getting battered. Walmart, Nike, and Under Armour (UAA, UA) are getting slammed as steep tariffs on China could hammer profits. Nike, for example, relies on China and Vietnam for 55% of its sourcing. Stifel analyst Jim Duffy estimates Nike could see $1.69 a share in earnings wiped out this year because of tariffs. Next up, Apple is going to have a rough day: Morgan Stanley estimates that the tariffs on iPhones and other devices from China will increase Apple’s annual costs by a whopping $8.5 billion. That could hit Apple’s profits by 52 cents next year. Brutal. And lastly, the technical takedown: Market technicians are locked in on the S&P 500’s March 13 closing low of 5,527.50. At this moment, the S&P 500 (^GSPC) is poised to test that low. A break through below the March lows intraday coupled with a new closing low could really damage sentiment further pros warn. RBC strategist Lori Calvasina says the S&P 500 has a clear shot to 4,900 if that low is breached. For more expert insight and the latest market action, click here.",
                "publication_date": "2025-04-03T12:22:17.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.9485",
                "source": "Yahoo Finance Video",
                "ticker": "AAPL",
                "title": "Trump tariffs send stocks spiraling! 3 things investors need to know",
                "url": "https://finance.yahoo.com/video/trump-tariffs-send-stocks-spiraling-122217686.html"
            },
            {
                "headline": "(Bloomberg) -- The retail traders who have stormed the markets in recent years were among the only investors buying on Thursday as US stocks had their worst day since June 2020.Most Read from BloombergHousing Agency Aims to Relocate Its DC HeadquartersMetro-North Is Faster Than Acela on NYC-New Haven Route After Signal UpdatesLocal Governments Vie for Fired Federal WorkersLondon Clears Final Hurdle for More High-Speed Trains to EuropeWhat Would ‘Transportation Abundance’ Look Like?Small investor",
                "publication_date": "2025-04-03T20:38:38.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.8126",
                "source": "Bloomberg",
                "ticker": "AAPL",
                "title": "Retail Traders Step In to Buy as Others Flee in Tariff Rout",
                "url": "https://finance.yahoo.com/news/retail-traders-step-buy-others-203838411.html"
            },
            {
                "headline": "(Bloomberg) -- Apple Inc. is finding itself squarely in the crosshairs of President Donald Trump’s new tariffs, even after a yearslong effort to insulate the iPhone maker from trade wars and supply chain disruptions.Most Read from BloombergMetro-North Is Faster Than Acela on NYC-New Haven Route After Signal UpdatesHousing Agency Aims to Relocate Its DC HeadquartersLocal Governments Vie for Fired Federal WorkersLondon Clears Final Hurdle for More High-Speed Trains to EuropeWhat Would ‘Transportat",
                "publication_date": "2025-04-03T20:22:03.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.7845",
                "source": "Bloomberg",
                "ticker": "AAPL",
                "title": "Apple Production Hubs Hit by Tariffs, Sending Stock Plunging",
                "url": "https://finance.yahoo.com/news/apple-shares-slide-tariffs-threaten-210739852.html"
            }
        ],
        "avgScore": 0.026840425531914854
    },
    "4 2 2025": {
        "importantArticles": [
            {
                "headline": "With perfect or tone-deaf timing—take your pick—China’s Communist Party mouthpiece, People’s Daily, is rolling out a miniseries this week titled “Fully Understanding the Mutually Beneficial Nature of China-U.S. Relations.”  Part 1 cited a Tesla factory in Shanghai making energy-storage batteries and Apple partners making electronics in China as examples of the benefits for the U.S. in doing business in China.  Part 2, published Wednesday, features an Iowa farmer whose soybeans are exported to China.",
                "publication_date": "2025-04-02T09:12:31.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8979",
                "source": "The Wall Street Journal",
                "ticker": "AAPL",
                "title": "China Cites Apple, Tesla and Soybeans in Argument Against Trade War",
                "url": "https://finance.yahoo.com/m/eef9850b-067f-30f9-9b77-2ab92b47f194/china-cites-apple-tesla-and.html"
            },
            {
                "headline": "Madison Mills, joined by Tematica Research chief investment officer Chris Versace, examines some of the top trending tickers on Yahoo Finance's platform. NewsMax (NMAX) stock pulled back from its post–initial public offering (IPO) skyrocket. Trump Media & Technology Group (DJT) is in focus after Truth Social filed papers with the SEC that could allow US President Donald Trump to sell his stake worth $2.3 billion at Tuesday's close. Visa (V) reportedly offers Apple (AAPL) $100 million to switch its credit card to the Visa network, according to reports from the Wall Street Journal. To watch more expert insights and analysis on the latest market action, check out more Catalysts here.",
                "publication_date": "2025-04-02T14:49:32.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8176",
                "source": "Yahoo Finance Video",
                "ticker": "AAPL",
                "title": "NewsMax, Trump & DJT, Visa's offer to Apple: Trending Tickers",
                "url": "https://finance.yahoo.com/video/newsmax-trump-djt-visas-offer-144932677.html"
            },
            {
                "headline": "Half a century after its founding in Albuquerque, New Mexico on April 4, 1975, Microsoft (MSFT) consistently ranks as one of the world’s most valuable companies. Currently sitting on a $2.7 trillion market cap, the software company, now based in Redmond, Washington, has turned into an artificial intelligence leader.",
                "publication_date": "2025-04-02T09:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7574",
                "source": "Quartz",
                "ticker": "AAPL",
                "title": "Microsoft is turning 50. Here are 4 of its peers that are also still around",
                "url": "https://finance.yahoo.com/news/microsoft-turning-50-4-peers-090000669.html"
            },
            {
                "headline": "Stocks sold off late Wednesday as President Trump's reciprocal tariffs proved to be harsher than many on Wall Street had expected.",
                "publication_date": "2025-04-02T22:23:45.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.4939",
                "source": "Yahoo Finance",
                "ticker": "AAPL",
                "title": "'Worse than expected': Wall Street reacts to Trump's 'Liberation Day' tariff surprise, stocks sink",
                "url": "https://finance.yahoo.com/news/worse-than-expected-wall-street-reacts-to-trumps-liberation-day-tariff-surprise-stocks-sink-222345902.html"
            },
            {
                "headline": "Epic Games CEO Tim Sweeney, whose company makes Fortnite and tools for other developers, including Unreal Engine, called out Apple and Google as \"gangster-style businesses\" engaged in illegal practices while speaking at a Y Combinator event on Wednesday. The executive also emphasized how the big tech companies' practices directly affected his own business by scaring away users from installing Epic's Games Store software and preventing Epic from attracting developers to its offerings. Notably, Ep",
                "publication_date": "2025-04-02T20:11:57.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.34",
                "source": "TechCrunch",
                "ticker": "AAPL",
                "title": "Epic Games CEO calls Apple and Google 'gangster-style' businesses in need of competition",
                "url": "https://finance.yahoo.com/news/epic-games-ceo-calls-apple-201157197.html"
            },
            {
                "headline": "Investing.com -- Losing market share to Apple (NASDAQ:AAPL) Pay remains the largest overhang for PayPal (NASDAQ:PYPL), but Mizuho analyst believes these concerns may be overstated.",
                "publication_date": "2025-04-02T10:02:16.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.1027",
                "source": "Investing.com",
                "ticker": "AAPL",
                "title": "Is Apple Pay really a problem for PayPal? Wall Street analyst weighs in",
                "url": "https://finance.yahoo.com/news/apple-pay-really-problem-paypal-100216984.html"
            }
        ],
        "avgScore": 0.22155384615384618
    },
    "4 1 2025": {
        "importantArticles": [
            {
                "headline": "Recent developments in Cloud AI highlight the evolving role of Kubernetes in enhancing cloud, edge, and bare metal deployments, with a focus on security and operational efficiency. Sidero Labs has been recognized as a Fast Mover and Challenger in the 2025 GigaOm Radar Reports for its capabilities in managed Kubernetes and edge computing solutions. The company's Omni platform simplifies enterprise Kubernetes management through centralized control, security features, and support for...",
                "publication_date": "2025-04-01T12:07:50.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9118",
                "source": "Simply Wall St.",
                "ticker": "AAPL",
                "title": "This Week In Cloud AI - Enhancing Cloud Tech: The Rise Of Kubernetes Solutions",
                "url": "https://finance.yahoo.com/news/week-cloud-ai-enhancing-cloud-120750558.html"
            },
            {
                "headline": "In fact, each of the 10 largest stock holdings in Berkshire's portfolio pays a reliable dividend.  Keith Noonan (Apple): Paying a dividend is typically a good sign that a company is generating reliable profits, and Apple has frequently ranked as the world's most profitable business over the last decade.",
                "publication_date": "2025-04-01T09:12:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8399",
                "source": "Motley Fool",
                "ticker": "AAPL",
                "title": "37% of Warren Buffett's $290 Billion Berkshire Hathaway Portfolio Is Invested in These 2 S&P 500 Dividend Stocks",
                "url": "https://finance.yahoo.com/news/37-warren-buffetts-290-billion-091200335.html"
            },
            {
                "headline": "Shares of Apple, Nvidia, and Microsoft have exploded in recent years, as investors poured money into stocks that were best positioned to take advantage of the rise in artificial intelligence (AI).  The U.S. government is also running a fiscal deficit, where spending during a fiscal year exceeds revenue.",
                "publication_date": "2025-04-01T12:05:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8316",
                "source": "Motley Fool",
                "ticker": "AAPL",
                "title": "Meet the Hard Asset That's Bigger Than Apple, Nvidia, and Microsoft Combined. One Wall Street Strategist Thinks It Could Hit a $40 Trillion Market Cap.",
                "url": "https://finance.yahoo.com/news/meet-hard-asset-thats-bigger-120500719.html"
            },
            {
                "headline": "European tech regulations are barriers to trade that disproportionately affect American companies, according to a U.S. trade report published one day before President Trump’s planned reciprocal tariffs.  The European Union applies some of its toughest digital rules to the world’s biggest companies and online platforms, including Google, Apple and Meta Platforms.  The U.S. trade report said the rules put a disproportionate burden on American companies and have resulted in what it called “excessive fines” for violating a law that aims to make it easier for smaller companies to compete against tech giants.",
                "publication_date": "2025-04-01T23:44:58.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5994",
                "source": "The Wall Street Journal",
                "ticker": "AAPL",
                "title": "U.S. Says Europe’s Tech Rules Are a Trade Barrier",
                "url": "https://finance.yahoo.com/m/dd155e6d-a988-38eb-aa92-6b15a5375838/u-s-says-europe%E2%80%99s-tech-rules.html"
            },
            {
                "headline": "The major averages were mostly lower near noon, with the Dow up fractionally but the Nasdaq down nearly 250 points amid mounting concerns about President Donald Trump’s upcoming announcement of promised new tariffs. Meanwhile, the S&P 500’s early losses brought the index to its lowest level since September. Looking to commodities, gold prices are sharply higher, continuing their rally to over $3,150, while oil prices are also up over 2.5%. Get caught up quickly on the top news and calls moving s",
                "publication_date": "2025-04-01T16:16:11.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.4767",
                "source": "TipRanks",
                "ticker": "AAPL",
                "title": "Rocket acquires Mr. Cooper, Musk’s xAI acquires X: Morning Buzz",
                "url": "https://finance.yahoo.com/news/rocket-acquires-mr-cooper-musk-161611941.html"
            },
            {
                "headline": "Apple hit a stumbling block when its AI-enabled Siri update was delayed, but it can bounce back, say Citi analysts.",
                "publication_date": "2025-04-01T13:59:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.34",
                "source": "Barrons.com",
                "ticker": "AAPL",
                "title": "Apple Stock Nears Citi’s Worst-Case. It Remains a Buy Even After Siri Delay.",
                "url": "https://finance.yahoo.com/m/8bd6da98-02c8-3b07-bf7e-94c379930f3a/apple-stock-nears-citi%E2%80%99s.html"
            }
        ],
        "avgScore": 0.23530476190476193
    },
    "coef": 0.49338601951844024,
    "avgCoef": 0.12633011888451362
}