{
    "4 22 2025": {
        "importantArticles": [
            {
                "headline": "The \"Magnificent Seven\" is a name given to Apple, Microsoft (NASDAQ: MSFT), Nvidia, Amazon, Alphabet, Meta Platforms, and Tesla because of their impact on the market over the past few years.  Unfortunately, the \"Magnificent Seven\" hasn't been so magnificent in recent weeks, with all seven down year to date.  Having the Magnificent Seven stocks slump isn't ideal because they account for a lot of many major indexes (especially the S&P 500), but it does present investors with a good opportunity to buy great companies at a \"discounted\" price.",
                "publication_date": "2025-04-22T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9695",
                "source": "Motley Fool",
                "ticker": "AAPL",
                "title": "1 \"Magnificent Seven\" Stock You'll Regret Not Buying During the Dip",
                "url": "https://finance.yahoo.com/news/1-magnificent-seven-stock-youll-100000028.html"
            },
            {
                "headline": "The Roundhill Magnificent Seven ETF, an exchange-traded fund that tracks \"Magnificent Seven\" stocks, is down close to 18% this year.  While uncertainty is at an all-time high, investors are also circling the wagons and looking at stocks that are as cheap as they have been in six months or more.  Many investors remain bullish on artificial intelligence (AI) and believe few stocks will benefit more than those in the Magnificent Seven.",
                "publication_date": "2025-04-22T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9468",
                "source": "Motley Fool",
                "ticker": "AAPL",
                "title": "Apple vs. Meta Platforms: Which \"Magnificent Seven\" Stock Has More Upside After the Recent Sell-Off?",
                "url": "https://finance.yahoo.com/news/apple-vs-meta-platforms-magnificent-190000502.html"
            },
            {
                "headline": "ChatGPT, OpenAI’s text-generating AI chatbot, has taken the world by storm since its launch in November 2022. What started as a tool to supercharge productivity through writing essays and code with short text prompts has evolved into a behemoth with 300 million weekly active users. 2024 was a big year for OpenAI, from its partnership with Apple for its generative AI offering, Apple Intelligence, the release of GPT-4o with voice capabilities, and the highly-anticipated launch of its text-to-video",
                "publication_date": "2025-04-22T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7003",
                "source": "TechCrunch",
                "ticker": "AAPL",
                "title": "ChatGPT: Everything you need to know about the AI-powered chatbot",
                "url": "https://finance.yahoo.com/news/chatgpt-everything-know-ai-powered-210339686.html"
            },
            {
                "headline": "A weak dollar hasn't typically been a friend to stocks in the past.",
                "publication_date": "2025-04-22T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.6734",
                "source": "Yahoo Finance",
                "ticker": "AAPL",
                "title": "What the falling US dollar has historically meant for stocks: By the numbers",
                "url": "https://finance.yahoo.com/news/what-the-falling-us-dollar-has-historically-meant-for-stocks-by-the-numbers-142613097.html"
            },
            {
                "headline": "We recently published a list of 9 Stocks That Could 10X Over the Next 2 Years. In this article, we are going to take a look at where Apple Inc. (NASDAQ:AAPL) stands against other stocks that could 10X over the next 2 years. US Tariffs and the Stock Market Turmoil While tariffs from the US […]",
                "publication_date": "2025-04-22T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.3612",
                "source": "Insider Monkey",
                "ticker": "AAPL",
                "title": "Apple Inc. (AAPL): Among Stocks That Could 10X Over the Next 2 Years",
                "url": "https://finance.yahoo.com/news/apple-inc-aapl-among-stocks-021614536.html"
            },
            {
                "headline": "BRUSSELS (Reuters) -The European Union is determined to enforce its full digital rule book no matter who is in charge of companies such as X, Meta, Apple and Tiktok or where they are based, Commission President Ursula von der Leyen told Politico.  The EU's Digital Markets Act has been strongly criticised by the administration of U.S. President Donald Trump.",
                "publication_date": "2025-04-22T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.1027",
                "source": "Reuters",
                "ticker": "AAPL",
                "title": "EU says it will enforce digital rules irrespective of CEO and location",
                "url": "https://finance.yahoo.com/news/eu-says-enforce-digital-rules-121614185.html"
            }
        ],
        "avgScore": 0.23270434782608695,
        "pctChange": 0.018458140251398126
    },
    "4 21 2025": {
        "importantArticles": [
            {
                "headline": "(Bloomberg) -- Taiwan Semiconductor Manufacturing Co. listed the challenges of ensuring export control compliance by its customers, months after the company’s artificial intelligence silicon was found to have flowed to US-sanctioned Huawei Technologies Co. via intermediaries. Most Read from BloombergDOGE Visits National Gallery of Art to Discuss Museum’s Legal StatusTrump Administration Takes Over New York Penn Station RevampDOGE Places Entire Staff of Federal Homelessness Agency on LeaveNashvil",
                "publication_date": "2025-04-21T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7184",
                "source": "Bloomberg",
                "ticker": "AAPL",
                "title": "TSMC Warns of Limits of Ability to Keep Its AI Chips From China",
                "url": "https://finance.yahoo.com/news/tsmc-warns-limits-ability-keep-053115583.html"
            },
            {
                "headline": "Trade tensions have pushed some promising chip stocks to bargain prices. These two chipmakers could deliver impressive returns for patient investors.",
                "publication_date": "2025-04-21T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.6249",
                "source": "Motley Fool",
                "ticker": "AAPL",
                "title": "2 Semiconductor Stocks That Could Help Make You a Fortune",
                "url": "https://finance.yahoo.com/news/2-semiconductor-stocks-could-help-103700423.html"
            },
            {
                "headline": "Tesla and Google parent Alphabet are due to report earnings this week, setting the tone for what could be a rough quarter for Big Tech as the first members of the Magnificent 7 to report this earnings season.",
                "publication_date": "2025-04-21T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.5994",
                "source": "Investopedia",
                "ticker": "AAPL",
                "title": "Tesla and Alphabet Report This Week. They'll Set the Tone for Big Tech Earnings",
                "url": "https://finance.yahoo.com/news/tesla-alphabet-report-week-theyll-090000391.html"
            },
            {
                "headline": "(Bloomberg) -- Hyundai Motor America, Nvidia Corp. and Target Corp. made seven-figure donations to fund President Donald Trump’s record-breaking haul for his second inauguration, according to filings with the Federal Election Commission.Most Read from BloombergDOGE Visits National Gallery of Art to Discuss Museum’s Legal StatusTrump Administration Takes Over New York Penn Station RevampDOGE Places Entire Staff of Federal Homelessness Agency on LeaveNashville’s $3 Billion Transit Plan Brings a Ca",
                "publication_date": "2025-04-21T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.128",
                "source": "Bloomberg",
                "ticker": "AAPL",
                "title": "Trump Raised Record $239 Million for Inaugural Festivities",
                "url": "https://finance.yahoo.com/news/trump-raised-record-239-million-031032600.html"
            },
            {
                "headline": "Investing.com -- Here is your Pro Recap of the top takeaways from Wall Street analysts for the past week.",
                "publication_date": "2025-04-21T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.2023",
                "source": "Investing.com",
                "ticker": "AAPL",
                "title": "Street Calls of the Week",
                "url": "https://finance.yahoo.com/news/street-calls-week-104320266.html"
            },
            {
                "headline": "As Big Tech kicks off its quarterly earnings season this week, the industry's bellwether companies have been thrust into a cauldron of uncertainty and turmoil that they didn't anticipate when Donald Trump re-entered the White House nearly 100 days ago.  Since President Trump's Jan. 20 inauguration, Big Tech stocks have been on a see-sawing ride that has eviscerated trillions of dollars in shareholder wealth amid an onslaught of tariffs and other potentially detrimental actions.  It's the polar opposite of what Apple CEO Tim Cook, Tesla CEO Elon Musk, Google CEO Sundar Pichai, Facebook founder Mark Zuckerberg and Amazon founder Jeff Bezos hoped for when they assembled behind Trump as he was sworn in.",
                "publication_date": "2025-04-21T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.3818",
                "source": "Associated Press Finance",
                "ticker": "AAPL",
                "title": "Big Tech's 'Magnificent Seven' heads into earnings season reeling from Trump turbulence",
                "url": "https://finance.yahoo.com/news/big-techs-magnificent-seven-heads-003039234.html"
            }
        ],
        "avgScore": 0.4424666666666668,
        "pctChange": 0.034065032648088696
    },
    "4 17 2025": {
        "importantArticles": [
            {
                "headline": "One of its many funds is the Vanguard Dividend Appreciation ETF (NYSEMKT: VIG).  It's one of the smartest funds to buy because it tracks the performance of companies that grow their dividends.  Historically, dividend growth stocks have delivered the highest total returns with the lowest risk.",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7351",
                "source": "Motley Fool",
                "ticker": "AAPL",
                "title": "Got $2,000 to Invest? This Is 1 of the Smartest Vanguard ETFs to Buy and Hold for 20 Years.",
                "url": "https://finance.yahoo.com/news/got-2-000-invest-1-083500393.html"
            },
            {
                "headline": "Gold bumped the 'Magnificent Seven' tech stocks to take the top spot as a crowded trade, according to a BofA survey.",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.6908",
                "source": "Yahoo Finance",
                "ticker": "AAPL",
                "title": "After surge to record highs, gold overtakes 'Magnificent 7' as the most crowded trade on Wall Street",
                "url": "https://finance.yahoo.com/news/after-surge-to-record-highs-gold-overtakes-magnificent-7-as-the-most-crowded-trade-on-wall-street-143338618.html"
            },
            {
                "headline": "We recently published a list of 15 Best Blue Chip Stocks to Buy According to Billionaires. In this article, we are going to take a look at where Apple Inc. (NASDAQ:AAPL) stands against other best blue chip stocks to buy according to billionaires. Is A Potential Trade War on the Horizon? The US stock market […]",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.6705",
                "source": "Insider Monkey",
                "ticker": "AAPL",
                "title": "Why Apple Inc. (AAPL) Is One of the Best Blue Chip Stocks to Buy According to Billionaires",
                "url": "https://finance.yahoo.com/news/why-apple-inc-aapl-one-210846590.html"
            },
            {
                "headline": "We recently published a list of Jim Cramer Sounds the Alarm on China Rhetoric and Dollar Panic Then Analyzes 11 Key Stocks. In this article, we are going to take a look at where Apple Inc. (NASDAQ:AAPL) stands against other key stocks that Jim Cramer analyzes. In his latest appearance on CNBC’s Squawk on the Street, […]",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.6908",
                "source": "Insider Monkey",
                "ticker": "AAPL",
                "title": "Jim Cramer: Apple Inc. (AAPL) Faces an “Existential” China Risk and Is “A Loser to Samsung”",
                "url": "https://finance.yahoo.com/news/jim-cramer-apple-inc-aapl-133149191.html"
            },
            {
                "headline": "Those shopping for a new smartphone or computer may be spared from tariff-induced sticker shock. At least, for now.",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.3818",
                "source": "CNN Business",
                "ticker": "AAPL",
                "title": "‘It’s going to be the small stuff’: Trump’s tariffs could make cheap tech gadgets not so cheap",
                "url": "https://finance.yahoo.com/news/going-small-stuff-trump-tariffs-153035967.html"
            },
            {
                "headline": "World stocks fell into a downward spiral on Wednesday led by tech losses after Washington said it is putting new curbs on AI chip exports to China, marking an escalation in the global trade war.  The Trump administration's latest broadside sparked huge demand for safe-haven assets like gold, the Swiss franc and U.S. Treasuries, even though Fed Chair Jerome Powell signalled he is in no rush to cut interest rates.  If U.S. Big Tech had acquired a safe-haven status in the eyes of some investors in recent years, it is disappearing fast.",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.25",
                "source": "Reuters",
                "ticker": "AAPL",
                "title": "Trading Day: When the chips are down",
                "url": "https://finance.yahoo.com/news/trading-day-chips-down-210332516.html"
            }
        ],
        "avgScore": 0.21632142857142855,
        "pctChange": -0.01939279189909957
    },
    "4 16 2025": {
        "importantArticles": [
            {
                "headline": "Apple (AAPL) will effectively develop Apple Intelligence, while “new form factors” will boost the tech giant’s 2026 revenue, Angelo Zino, a senior equity analyst at CFRA Research predicted recently on the Schwab Network. Zino has a $235 price target and a Buy rating on the shares. Apple’s Positive Catalysts The development of Apple Intelligence, which […]",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9485",
                "source": "Insider Monkey",
                "ticker": "AAPL",
                "title": "Apple Intelligence, New Form Factors Will Boost AAPL Stock, Analyst Says",
                "url": "https://finance.yahoo.com/news/apple-intelligence-form-factors-boost-145221145.html"
            },
            {
                "headline": "Apple (NASDAQ: AAPL) stock returned 30% in 2024, peaking around $259 per share in late December.  Factors contributing to that upside included strong sales growth in the services business and excitement about new artificial intelligence (AI) features.  President Trump on April 2 outlined an aggressive slate of reciprocal tariffs that would take the average tax on U.S. imports to its highest level in a century.",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9153",
                "source": "Motley Fool",
                "ticker": "AAPL",
                "title": "Apple Stock Dropped 30% From Its High. History Says This Will Happen Next.",
                "url": "https://finance.yahoo.com/news/apple-stock-dropped-30-high-075500980.html"
            },
            {
                "headline": "Apple's main India suppliers Foxconn and Tata shipped nearly $2 billion worth of iPhones to the United States in March, an all-time high, as the U.S. company airlifted devices to bypass President Donald Trump's impending tariffs, customs data shows.  The smartphone maker stepped up production in India and chartered cargo flights to ferry 600 tons of iPhones to the United States to ensure sufficient inventory in one of its biggest markets on concern Trump's tariffs would push up costs.",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8442",
                "source": "Reuters",
                "ticker": "AAPL",
                "title": "Apple airlifted iPhones worth a record $2 billion from India in March as Trump tariffs loomed",
                "url": "https://finance.yahoo.com/news/apple-airlifted-iphones-worth-record-144418337.html"
            },
            {
                "headline": "(Bloomberg) -- Japan’s Fair Trade Commission ordered Alphabet Inc.’s Google to stop alleged abuse of its market power over local smartphone manufacturers, just ahead of high-stakes trade negotiations with the US this week.Most Read from BloombergHow Did This Suburb Figure Out Mass Transit?Even Oslo Has an Air Quality ProblemNYC Tourist Helicopter Crashes in Hudson River, Killing Six$15 Million Fund Bets Leadership Training Can Improve Chicago PolicingLA County Floats Leaner Budget Burdened by Fi",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.8519",
                "source": "Bloomberg",
                "ticker": "AAPL",
                "title": "Japan Orders Google to Stop Forcing Phone Makers to Use Apps",
                "url": "https://finance.yahoo.com/news/japan-orders-google-stop-forcing-103019112.html"
            },
            {
                "headline": "Apple Inc. (NASDAQ:AAPL) CEO Tim Cook previously explained the company’s decision to continue manufacturing its products in China, refuting the widespread belief that it’s due to low labor costs. What Happened: A 2024 video of Tim Cook has resurfaced, providing insights into Apple’s manufacturing choices amid the ongoing U.S.-China tariff war. In the video, posted on X by CNBC TV18 reporter Nigel D’Souza, Cook dismissed the idea that Apple’s manufacturing in China is due to low labor costs, stat",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.7964",
                "source": "Benzinga",
                "ticker": "AAPL",
                "title": "When Apple's Tim Cook Revealed The Real Reason iPhones Are Made In China—And It's Not 'Low Labor Costs': 'China Stopped Being A Low-Wage Country Years Ago'",
                "url": "https://finance.yahoo.com/news/apples-tim-cook-revealed-real-213129145.html"
            },
            {
                "headline": "The S&P 500 (SNPINDEX: ^GSPC) is made up of 500 companies from 11 different economic sectors.  The information technology sector is the largest by a wide margin, representing 29.9% of the entire value of the index.  The S&P 500 recently suffered a peak-to-trough decline of 19%, falling just shy of the bear-market threshold of 20%.",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5267",
                "source": "Motley Fool",
                "ticker": "AAPL",
                "title": "1 Spectacular Vanguard ETF to Buy With $550 During the Tech Bear Market",
                "url": "https://finance.yahoo.com/news/1-spectacular-vanguard-etf-buy-093400403.html"
            }
        ],
        "avgScore": 0.1629375,
        "pctChange": 0.013949613401343217
    },
    "4 15 2025": {
        "importantArticles": [
            {
                "headline": "An unidentified options trader's multi-million dollar bet on a short-term rebound in Apple Inc.'s shares was set to reap a sizable profit as the iPhone-maker's shares soared on Monday following the Trump administration's weekend move to grant tariff exclusions for smartphones.  On Monday, Apple shares rose as much as 7% to a high of $212.94 before paring gains to trade up 4.5% at $206.05, after the Trump administration, late on Friday, granted exclusions from the steep reciprocal tariffs on smartphones and a set of other electronics products, a move seen as a big break for technology firms such as Apple that rely on imports from China.  The jump in Apple's share price means a bullish options trade opened Friday for about $5 million was, on paper, valued at about $14 million early on Monday, a gain of 180%, according to a Reuters calculation.",
                "publication_date": "2025-04-15T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9678",
                "source": "Reuters",
                "ticker": "AAPL",
                "title": "Bullish trade in Apple options reaps gains as shares jump on tariff exemption",
                "url": "https://finance.yahoo.com/news/bullish-trade-apple-options-reaps-151022816.html"
            },
            {
                "headline": "Chip maker  Nvidia  unveiled plans Monday to produce new made-in-America supercomputers that power artificial intelligence, just one day after the Trump administration said tariffs were coming for semiconductor-reliant imports.  The chip maker said it would make AI supercomputers with contract manufacturers in Texas, its first public disclosure of a plan that would amplify ongoing U.S. efforts to bring semiconductor production back to domestic markets.  A darling of the global AI boom, Nvidia promised an eye-popping $500 billion in spending in the coming years, an announcement that echoed a similar goal disclosed by  Apple  in February.",
                "publication_date": "2025-04-15T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8555",
                "source": "The Wall Street Journal",
                "ticker": "AAPL",
                "title": "Nvidia’s Made-in-the-U.S.A. Move Follows a Familiar Trump Pattern",
                "url": "https://finance.yahoo.com/m/bcd86848-f5cd-3aa1-8ff3-dbe5e6f1d84e/nvidia%E2%80%99s-made-in-the-u-s-a-.html"
            },
            {
                "headline": "We recently published a list of 10 Best Kid-Friendly Stocks to Buy According to Billionaires. In this article, we are going to take a look at where Apple Inc. (NASDAQ:AAPL) stands against other best kid-friendly stocks to buy according to billionaires. The market has been undergoing a volatile spell these past few days. Economic data […]",
                "publication_date": "2025-04-15T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8555",
                "source": "Insider Monkey",
                "ticker": "AAPL",
                "title": "Is Apple Inc. (AAPL) the Best Kid-Friendly Stock to Buy According to Billionaires?",
                "url": "https://finance.yahoo.com/news/apple-inc-aapl-best-kid-131623934.html"
            },
            {
                "headline": "U.S. stocks edged up Monday as investors digested mixed messages on the trade war, following some of the most chaotic and turbulent weeks in recent market memory.",
                "publication_date": "2025-04-15T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.8122",
                "source": "Quartz",
                "ticker": "AAPL",
                "title": "The Dow and S&P 500 rise slightly, but tariff and recession fears linger",
                "url": "https://finance.yahoo.com/news/stocks-rise-apple-jumps-goldman-121600681.html"
            },
            {
                "headline": "Apple Inc. (NASDAQ:AAPL) has managed to dodge a potential disaster as its key consumer electronics have been exempted from the 125% tariffs on goods manufactured in China by President Donald Trump. What Happened: The tariff exemption announced by President Trump on Friday night encompasses iPhones, iPads, Macs, Apple Watches, and AirTags. Furthermore, the 10% tariff on goods imported from other countries has been waived off for these products. Despite the possibility of a new, lower sectoral tar",
                "publication_date": "2025-04-15T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.743",
                "source": "Benzinga",
                "ticker": "AAPL",
                "title": "Apple Escapes Supply Chain Crisis As Trump Excludes Popular Electronics From Tariffs",
                "url": "https://finance.yahoo.com/news/apple-escapes-supply-chain-crisis-183111921.html"
            },
            {
                "headline": "Tariff uncertainty will cause chaos in the supply chain, says Wedbush’s Dan Ives.",
                "publication_date": "2025-04-15T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.7269",
                "source": "Fortune",
                "ticker": "AAPL",
                "title": "Apple fans won’t stay loyal if tariffs mean $2,000 iPhones, top analyst warns",
                "url": "https://finance.yahoo.com/news/apple-fans-won-t-stay-202605693.html"
            }
        ],
        "avgScore": 0.11555000000000012,
        "pctChange": -0.03893338844835537
    },
    "4 14 2025": {
        "importantArticles": [
            {
                "headline": "TAIPEI/SHANGHAI (Reuters) -Shares in Asian tech companies that are major suppliers to companies like Apple rose on Monday after the U.S. government granted temporary exclusions from steep tariffs on smartphones, computers and some other electronics imported largely from China.  Shares in Foxconn, Apple's largest iPhone assembler, rose as much as 7.8% before trimming gains to close 3% higher.  China's Goertek and Lens Tech both rose by more than 7% before also trimming gains.",
                "publication_date": "2025-04-14T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8934",
                "source": "Reuters",
                "ticker": "AAPL",
                "title": "Asian tech stocks bounce back after Trump tariff exemptions",
                "url": "https://finance.yahoo.com/news/taiwan-tech-supply-chain-stocks-023141171.html"
            },
            {
                "headline": "(Bloomberg) -- China’s credit expanded more than expected in March as the government accelerated bond offerings to help the economy offset the impact of surging US tariffs.Most Read from BloombergThe Secret Formula for Faster TrainsNYC Tourist Helicopter Crashes in Hudson River, Killing SixEven Oslo Has an Air Quality ProblemInside the Quiet, Extravagant Expansion of the Frick CollectionLisbon Mayor Wants Companies to Help Fix City’s Housing ShortageAggregate financing, a broad measure of credit",
                "publication_date": "2025-04-14T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.6369",
                "source": "Bloomberg",
                "ticker": "AAPL",
                "title": "China’s Credit Expansion Beats Forecasts on Bond Sale Deluge",
                "url": "https://finance.yahoo.com/news/china-credit-expansion-beats-forecast-114344802.html"
            },
            {
                "headline": "President Trump's move Friday to give big tech companies a tariff break may give markets a boost on Monday.",
                "publication_date": "2025-04-14T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.4019",
                "source": "TheStreet",
                "ticker": "AAPL",
                "title": "For now, the rally is on — maybe . . .",
                "url": "https://finance.yahoo.com/news/now-rally-maybe-233233250.html"
            },
            {
                "headline": "We recently published a list of 14 AI Stocks Catching Wall Street’s Attention. In this article, we are going to take a look at where Apple Inc. (NASDAQ:AAPL) stands against other AI stocks catching Wall Street’s attention. In the latest development in the feud between OpenAI and Elon Musk, the ChatGPT maker has countersued billionaire […]",
                "publication_date": "2025-04-14T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.34",
                "source": "Insider Monkey",
                "ticker": "AAPL",
                "title": "Apple Inc. (AAPL): Analysts See AI-Powered iPhone Supercycle on Horizon Despite Tariff Pressures",
                "url": "https://finance.yahoo.com/news/apple-inc-aapl-analysts-see-005916833.html"
            },
            {
                "headline": "Investing.com -- Apple Inc (NASDAQ:AAPL) is maintaining its iPhone production strategy, despite fresh signals of volatility in U.",
                "publication_date": "2025-04-14T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.2411",
                "source": "Investing.com",
                "ticker": "AAPL",
                "title": "Apple holds steady on India iPhone production as tariff risks mount - Kuo",
                "url": "https://finance.yahoo.com/news/apple-holds-steady-india-iphone-022119832.html"
            },
            {
                "headline": "President Donald Trump has announced exemptions from tariffs for a range of technology products, including smartphones, laptops, chips, and other electronics.",
                "publication_date": "2025-04-14T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "CoinMarketCap",
                "ticker": "AAPL",
                "title": "Trump Grants Tariff Exemptions on 20 Tech Products, Including Phones, Chips and Laptops",
                "url": "https://finance.yahoo.com/news/trump-grants-tariff-exemptions-20-005741208.html"
            }
        ],
        "avgScore": 0.19669999999999996,
        "pctChange": -0.0018763819612666965
    },
    "3 26 2025": {
        "importantArticles": [
            {
                "headline": "Many of tech’s biggest companies—from Alphabet and Meta Platforms to Amazon and Apple—will report their quarterly results in the coming days.",
                "publication_date": "2025-03-26T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.1779",
                "source": "Barrons.com",
                "ticker": "AAPL",
                "title": "Tech Earnings Arrive With Lots of Uncertainty. Here Are the 3 Most Important Things to Watch.",
                "url": "https://finance.yahoo.com/m/0f9840e5-497c-3ef9-b530-333766c3554e/tech-earnings-arrive-with.html"
            },
            {
                "headline": "Many of tech’s biggest companies—from Alphabet and Meta Platforms to Amazon and Apple—will report their quarterly results in the coming days.",
                "publication_date": "2025-03-26T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.1779",
                "source": "Barrons.com",
                "ticker": "AAPL",
                "title": "Tech Earnings Arrive With Lots of Uncertainty. Here Are the 3 Most Important Things to Watch.",
                "url": "https://finance.yahoo.com/m/0f9840e5-497c-3ef9-b530-333766c3554e/tech-earnings-arrive-with.html"
            }
        ],
        "avgScore": 0.1779,
        "pctChange": 0.010472655337889917
    },
    "coef": 0.642857142857143,
    "avgCoef": 0.03547159060400047,
    "similar": {
        "NIO": 0.8928571428571429,
        "INTC": 0.8214285714285715,
        "PFE": 0.8214285714285715,
        "SOUN": 0.8214285714285715
    }
}