{
    "Important Articles": [
        {
            "headline": "The CEO did not name any specific customers but said the company is in discussions with Google, Apple, Facebook ,  Amazon  and Microsoft .  In the field of advanced artificial intelligence chip manufacturing, TSMC  holds the lion's share of the market as it supplies wafers to several leading tech firms and chipmakers in the world.",
            "publication_date": "2025-04-04T15:55:04.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.8885",
            "source": "Reuters",
            "ticker": "AAPL",
            "title": "Japan's Rapidus in talks with Apple, Google to mass-produce chips, Nikkei reports",
            "url": "https://finance.yahoo.com/news/japans-rapidus-talks-apple-google-155504765.html"
        },
        {
            "headline": "Trump's surprise tariffs hit Apple like a freight train. Is this the start of a global tech supply chain reset?",
            "publication_date": "2025-04-04T16:00:25.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.5574",
            "source": "GuruFocus.com",
            "ticker": "AAPL",
            "title": "Apple Just Lost $250 Billion -- And That Might Be Just the Beginning",
            "url": "https://finance.yahoo.com/news/apple-just-lost-250-billion-160025901.html"
        },
        {
            "headline": "We recently published a list of Mag7 and Beyond: Top 10 AI News Updates and Ratings. In this article, we are going to take a look at where Apple Inc. (NASDAQ:AAPL) stands against other top AI news updates and ratings. According to a study presented at a European Central Bank conference, companies that manage to […]",
            "publication_date": "2025-04-04T23:12:35.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.3818",
            "source": "Insider Monkey",
            "ticker": "AAPL",
            "title": "Apple (AAPL) Labeled ‘Underweight’ Over Undefined AI Strategy and China Market Declines",
            "url": "https://finance.yahoo.com/news/apple-aapl-labeled-underweight-over-231235883.html"
        },
        {
            "headline": "Shares of iPhone and iPad maker Apple (NASDAQ:AAPL) fell 5.9% in the afternoon session after China imposed a 34% tariff on all U.S. imports amid escalating trade war tensions. This was partly in response to the \"reciprocal tariffs\" announced by the Trump administration the previous day, with levies on Chinese goods estimated to be as high as 50%.",
            "publication_date": "2025-04-04T19:08:57.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.6908",
            "source": "StockStory",
            "ticker": "AAPL",
            "title": "Apple (AAPL) Stock Trades Down, Here Is Why",
            "url": "https://finance.yahoo.com/news/apple-aapl-stock-trades-down-190857457.html"
        },
        {
            "headline": "Stocks (^GSPC,&nbsp;^IXIC,&nbsp;^DJI)&nbsp; are plummeting as concerns about trade wars grow. The Nasdaq Composite, led by drops in major tech companies like Tesla (TSLA), Nvidia (NVDA), and Apple (AAPL), is nearing bear market territory. Retailers Nike (NKE) and Lululemon (LULU) are seeing their stocks rise after President Trump held discussions with Vietnam about lowering tariffs. Meanwhile, DuPont (DD) is under pressure as China launches an antitrust investigation into the company. Stay up to date on the latest market action, minute-by-minute, with Yahoo Finance's Market Minute.",
            "publication_date": "2025-04-04T17:16:45.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.6486",
            "source": "Yahoo Finance Video",
            "ticker": "AAPL",
            "title": "Tech tumbles, retail rises, China's DuPont probe: Market Minute",
            "url": "https://finance.yahoo.com/video/tech-tumbles-retail-rises-chinas-171645876.html"
        },
        {
            "headline": "(Bloomberg) -- Shares in companies that have large manufacturing operations in Vietnam, including Nike Inc. and Lululemon Athletica Inc., soared Friday after President Donald Trump said Vietnam was willing to eliminate tariffs to avoid new US levies. Most Read from BloombergHousing Agency Aims to Relocate Its DC HeadquartersMetro-North Is Faster Than Acela on NYC-New Haven Route After Signal UpdatesLocal Governments Vie for Fired Federal WorkersWhat Would ‘Transportation Abundance’ Look Like?Lon",
            "publication_date": "2025-04-04T20:11:41.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.5574",
            "source": "Bloomberg",
            "ticker": "AAPL",
            "title": "Nike, Lululemon Rebound as Trump Touts Call With Vietnam Leader",
            "url": "https://finance.yahoo.com/news/nike-lululemon-soar-trump-touts-154715216.html"
        }
    ],
    "Avg Score": -0.05130714285714284
}