{
    "4 17 2025": {
        "importantArticles": [
            {
                "headline": "Warren Buffett has made no secret about how much he likes Apple (NASDAQ: AAPL), once referring to it as the best business he knows of.  In November 2024, investors noticed that he reduced his stake in the tech company for a fourth consecutive quarter.",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7003",
                "source": "Motley Fool",
                "ticker": "AAPL",
                "title": "Prediction: Warren Buffett Will Start Buying More Apple Stock This Quarter",
                "url": "https://finance.yahoo.com/news/prediction-warren-buffett-start-buying-090300638.html"
            },
            {
                "headline": "There's one tech titan that has long been a leader when it comes to share buybacks, repurchasing a jaw-dropping $695 billion of stock in the past decade.  At a market cap of $3.1 trillion, Apple is the world's most valuable enterprise.  Apple sells some of the most in-demand hardware products.",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.6801",
                "source": "Motley Fool",
                "ticker": "AAPL",
                "title": "This Tech Giant Is a Stock Buyback Leader. Here's What That Means for Investors.",
                "url": "https://finance.yahoo.com/news/tech-giant-stock-buyback-leader-103800895.html"
            },
            {
                "headline": "Apple's (NASDAQ:AAPL) biggest iPhone headache might not be a chip shortage — it's tariffs. President Donald Trump's aggressive new round of China tariffs has temporarily spared electronics like smartphones and laptops, but that grace period is short-lived. Commerce Secretary Howard Lutnick on Sunday told ABC's \"This Week\" that Apple and other tech companies should expect new semiconductor-specific tariffs \"in probably a month or two.\" Apple's dependence on China is massive. Roughly 90% of iPhone",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.6726",
                "source": "Benzinga",
                "ticker": "AAPL",
                "title": "Steve Jobs Said 14 Years Ago iPhones Would Never Be Made In The U.S.: 'Those Jobs Aren't Coming Back'—Now Tariffs Could Bump Price To $3,500",
                "url": "https://finance.yahoo.com/news/steve-jobs-said-14-years-223049401.html"
            },
            {
                "headline": "Apple's production in India and Vietnam seen as critical hedge as U.S.-China trade tensions escalate, Evercore says",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.6124",
                "source": "GuruFocus.com",
                "ticker": "AAPL",
                "title": "Evercore Backs Apple's Resilience as Global Tariffs Loom",
                "url": "https://finance.yahoo.com/news/evercore-backs-apples-resilience-global-145318073.html"
            },
            {
                "headline": "The Dow Jones Industrial Average fell more than 500 points Thursday, and one stock bore most of the blame: UnitedHealth Group.",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5667",
                "source": "Investopedia",
                "ticker": "AAPL",
                "title": "The One Stock Behind the Dow's Steep Drop Thursday",
                "url": "https://finance.yahoo.com/news/one-stock-behind-dows-500-155927450.html"
            },
            {
                "headline": "Big Tech’s risks in China go far beyond Nvidia, Foreign central banks load up on T-bills and sell U.S. Bonds, more news to start your day.",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.2732",
                "source": "Barrons.com",
                "ticker": "AAPL",
                "title": "Stock Markets Need a Tariffs Savior. Why Fed’s Powell Won’t Ride to the Rescue and 5 Other Things to Know Today.",
                "url": "https://finance.yahoo.com/m/f0b27173-b913-381c-af02-98f7c48ace42/stock-markets-need-a-tariffs.html"
            }
        ],
        "avgScore": 0.16038125000000003
    },
    "4 16 2025": {
        "importantArticles": [
            {
                "headline": "One of its many funds is the Vanguard Dividend Appreciation ETF (NYSEMKT: VIG).  It's one of the smartest funds to buy because it tracks the performance of companies that grow their dividends.  Historically, dividend growth stocks have delivered the highest total returns with the lowest risk.",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7351",
                "source": "Motley Fool",
                "ticker": "AAPL",
                "title": "Got $2,000 to Invest? This Is 1 of the Smartest Vanguard ETFs to Buy and Hold for 20 Years.",
                "url": "https://finance.yahoo.com/news/got-2-000-invest-1-083500393.html"
            },
            {
                "headline": "Gold bumped the 'Magnificent Seven' tech stocks to take the top spot as a crowded trade, according to a BofA survey.",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.6908",
                "source": "Yahoo Finance",
                "ticker": "AAPL",
                "title": "After surge to record highs, gold overtakes 'Magnificent 7' as the most crowded trade on Wall Street",
                "url": "https://finance.yahoo.com/news/after-surge-to-record-highs-gold-overtakes-magnificent-7-as-the-most-crowded-trade-on-wall-street-143338618.html"
            },
            {
                "headline": "We recently published a list of 15 Best Blue Chip Stocks to Buy According to Billionaires. In this article, we are going to take a look at where Apple Inc. (NASDAQ:AAPL) stands against other best blue chip stocks to buy according to billionaires. Is A Potential Trade War on the Horizon? The US stock market […]",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.6705",
                "source": "Insider Monkey",
                "ticker": "AAPL",
                "title": "Why Apple Inc. (AAPL) Is One of the Best Blue Chip Stocks to Buy According to Billionaires",
                "url": "https://finance.yahoo.com/news/why-apple-inc-aapl-one-210846590.html"
            },
            {
                "headline": "Trump's sweeping new tariffs have reignited recession fears, with analysts warning that a resulting pullback in ad spending could wipe out $45 billion from the US market — and potentially accelerate the decline of traditional TV.",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.7906",
                "source": "Yahoo Finance",
                "ticker": "AAPL",
                "title": "Television could go the way of newspapers if the US economy tips into recession, analyst warns",
                "url": "https://finance.yahoo.com/news/television-could-go-the-way-of-newspapers-if-the-us-economy-tips-into-recession-analyst-warns-091448700.html"
            },
            {
                "headline": "We recently published a list of Jim Cramer Sounds the Alarm on China Rhetoric and Dollar Panic Then Analyzes 11 Key Stocks. In this article, we are going to take a look at where Apple Inc. (NASDAQ:AAPL) stands against other key stocks that Jim Cramer analyzes. In his latest appearance on CNBC’s Squawk on the Street, […]",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.6908",
                "source": "Insider Monkey",
                "ticker": "AAPL",
                "title": "Jim Cramer: Apple Inc. (AAPL) Faces an “Existential” China Risk and Is “A Loser to Samsung”",
                "url": "https://finance.yahoo.com/news/jim-cramer-apple-inc-aapl-133149191.html"
            },
            {
                "headline": "Those shopping for a new smartphone or computer may be spared from tariff-induced sticker shock. At least, for now.",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.3818",
                "source": "CNN Business",
                "ticker": "AAPL",
                "title": "‘It’s going to be the small stuff’: Trump’s tariffs could make cheap tech gadgets not so cheap",
                "url": "https://finance.yahoo.com/news/going-small-stuff-trump-tariffs-153035967.html"
            }
        ],
        "avgScore": 0.12943125
    },
    "4 15 2025": {
        "importantArticles": [
            {
                "headline": "Apple (AAPL) will effectively develop Apple Intelligence, while “new form factors” will boost the tech giant’s 2026 revenue, Angelo Zino, a senior equity analyst at CFRA Research predicted recently on the Schwab Network. Zino has a $235 price target and a Buy rating on the shares. Apple’s Positive Catalysts The development of Apple Intelligence, which […]",
                "publication_date": "2025-04-15T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9485",
                "source": "Insider Monkey",
                "ticker": "AAPL",
                "title": "Apple Intelligence, New Form Factors Will Boost AAPL Stock, Analyst Says",
                "url": "https://finance.yahoo.com/news/apple-intelligence-form-factors-boost-145221145.html"
            },
            {
                "headline": "Apple (NASDAQ: AAPL) stock returned 30% in 2024, peaking around $259 per share in late December.  Factors contributing to that upside included strong sales growth in the services business and excitement about new artificial intelligence (AI) features.  President Trump on April 2 outlined an aggressive slate of reciprocal tariffs that would take the average tax on U.S. imports to its highest level in a century.",
                "publication_date": "2025-04-15T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9153",
                "source": "Motley Fool",
                "ticker": "AAPL",
                "title": "Apple Stock Dropped 30% From Its High. History Says This Will Happen Next.",
                "url": "https://finance.yahoo.com/news/apple-stock-dropped-30-high-075500980.html"
            },
            {
                "headline": "Apple's main India suppliers Foxconn and Tata shipped nearly $2 billion worth of iPhones to the United States in March, an all-time high, as the U.S. company airlifted devices to bypass President Donald Trump's impending tariffs, customs data shows.  The smartphone maker stepped up production in India and chartered cargo flights to ferry 600 tons of iPhones to the United States to ensure sufficient inventory in one of its biggest markets on concern Trump's tariffs would push up costs.",
                "publication_date": "2025-04-15T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8442",
                "source": "Reuters",
                "ticker": "AAPL",
                "title": "Apple airlifted iPhones worth a record $2 billion from India in March as Trump tariffs loomed",
                "url": "https://finance.yahoo.com/news/apple-airlifted-iphones-worth-record-144418337.html"
            },
            {
                "headline": "(Bloomberg) -- Japan’s Fair Trade Commission ordered Alphabet Inc.’s Google to stop alleged abuse of its market power over local smartphone manufacturers, just ahead of high-stakes trade negotiations with the US this week.Most Read from BloombergHow Did This Suburb Figure Out Mass Transit?Even Oslo Has an Air Quality ProblemNYC Tourist Helicopter Crashes in Hudson River, Killing Six$15 Million Fund Bets Leadership Training Can Improve Chicago PolicingLA County Floats Leaner Budget Burdened by Fi",
                "publication_date": "2025-04-15T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.8519",
                "source": "Bloomberg",
                "ticker": "AAPL",
                "title": "Japan Orders Google to Stop Forcing Phone Makers to Use Apps",
                "url": "https://finance.yahoo.com/news/japan-orders-google-stop-forcing-103019112.html"
            },
            {
                "headline": "Apple Inc. (NASDAQ:AAPL) CEO Tim Cook previously explained the company’s decision to continue manufacturing its products in China, refuting the widespread belief that it’s due to low labor costs. What Happened: A 2024 video of Tim Cook has resurfaced, providing insights into Apple’s manufacturing choices amid the ongoing U.S.-China tariff war. In the video, posted on X by CNBC TV18 reporter Nigel D’Souza, Cook dismissed the idea that Apple’s manufacturing in China is due to low labor costs, stat",
                "publication_date": "2025-04-15T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.7964",
                "source": "Benzinga",
                "ticker": "AAPL",
                "title": "When Apple's Tim Cook Revealed The Real Reason iPhones Are Made In China—And It's Not 'Low Labor Costs': 'China Stopped Being A Low-Wage Country Years Ago'",
                "url": "https://finance.yahoo.com/news/apples-tim-cook-revealed-real-213129145.html"
            },
            {
                "headline": "(Bloomberg) -- Supply Lines is a daily newsletter that tracks global trade. Sign up here.Most Read from BloombergHow Did This Suburb Figure Out Mass Transit?The Secret Formula for Faster TrainsEven Oslo Has an Air Quality ProblemNYC Tourist Helicopter Crashes in Hudson River, Killing SixLisbon Mayor Wants Companies to Help Fix City’s Housing ShortagePresident Donald Trump’s administration pressed forward with plans to impose tariffs on semiconductor and pharmaceutical imports by initiating trade",
                "publication_date": "2025-04-15T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5994",
                "source": "Bloomberg",
                "ticker": "AAPL",
                "title": "Trump Initiates Chips and Drug Probes Ahead of More Tariffs",
                "url": "https://finance.yahoo.com/news/trump-announces-chips-drug-probes-204108780.html"
            }
        ],
        "avgScore": 0.1444294117647059
    },
    "4 14 2025": {
        "importantArticles": [
            {
                "headline": "An unidentified options trader's multi-million dollar bet on a short-term rebound in Apple Inc.'s shares was set to reap a sizable profit as the iPhone-maker's shares soared on Monday following the Trump administration's weekend move to grant tariff exclusions for smartphones.  On Monday, Apple shares rose as much as 7% to a high of $212.94 before paring gains to trade up 4.5% at $206.05, after the Trump administration, late on Friday, granted exclusions from the steep reciprocal tariffs on smartphones and a set of other electronics products, a move seen as a big break for technology firms such as Apple that rely on imports from China.  The jump in Apple's share price means a bullish options trade opened Friday for about $5 million was, on paper, valued at about $14 million early on Monday, a gain of 180%, according to a Reuters calculation.",
                "publication_date": "2025-04-14T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9678",
                "source": "Reuters",
                "ticker": "AAPL",
                "title": "Bullish trade in Apple options reaps gains as shares jump on tariff exemption",
                "url": "https://finance.yahoo.com/news/bullish-trade-apple-options-reaps-151022816.html"
            },
            {
                "headline": "TAIPEI/SHANGHAI (Reuters) -Shares in Asian tech companies that are major suppliers to companies like Apple rose on Monday after the U.S. government granted temporary exclusions from steep tariffs on smartphones, computers and some other electronics imported largely from China.  Shares in Foxconn, Apple's largest iPhone assembler, rose as much as 7.8% before trimming gains to close 3% higher.  China's Goertek and Lens Tech both rose by more than 7% before also trimming gains.",
                "publication_date": "2025-04-14T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8934",
                "source": "Reuters",
                "ticker": "AAPL",
                "title": "Asian tech stocks bounce back after Trump tariff exemptions",
                "url": "https://finance.yahoo.com/news/taiwan-tech-supply-chain-stocks-023141843.html"
            },
            {
                "headline": "Chip maker  Nvidia  unveiled plans Monday to produce new made-in-America supercomputers that power artificial intelligence, just one day after the Trump administration said tariffs were coming for semiconductor-reliant imports.  The chip maker said it would make AI supercomputers with contract manufacturers in Texas, its first public disclosure of a plan that would amplify ongoing U.S. efforts to bring semiconductor production back to domestic markets.  A darling of the global AI boom, Nvidia promised an eye-popping $500 billion in spending in the coming years, an announcement that echoed a similar goal disclosed by  Apple  in February.",
                "publication_date": "2025-04-14T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8555",
                "source": "The Wall Street Journal",
                "ticker": "AAPL",
                "title": "Nvidia’s Made-in-the-U.S.A. Move Follows a Familiar Trump Pattern",
                "url": "https://finance.yahoo.com/m/bcd86848-f5cd-3aa1-8ff3-dbe5e6f1d84e/nvidia%E2%80%99s-made-in-the-u-s-a-.html"
            },
            {
                "headline": "U.S. stocks edged up Monday as investors digested mixed messages on the trade war, following some of the most chaotic and turbulent weeks in recent market memory.",
                "publication_date": "2025-04-14T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.8122",
                "source": "Quartz",
                "ticker": "AAPL",
                "title": "The Dow and S&P 500 rise slightly, but tariff and recession fears linger",
                "url": "https://finance.yahoo.com/news/stocks-rise-apple-jumps-goldman-121600681.html"
            },
            {
                "headline": "Apple Inc. (NASDAQ:AAPL) has managed to dodge a potential disaster as its key consumer electronics have been exempted from the 125% tariffs on goods manufactured in China by President Donald Trump. What Happened: The tariff exemption announced by President Trump on Friday night encompasses iPhones, iPads, Macs, Apple Watches, and AirTags. Furthermore, the 10% tariff on goods imported from other countries has been waived off for these products. Despite the possibility of a new, lower sectoral tar",
                "publication_date": "2025-04-14T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.743",
                "source": "Benzinga",
                "ticker": "AAPL",
                "title": "Apple Escapes Supply Chain Crisis As Trump Excludes Popular Electronics From Tariffs",
                "url": "https://finance.yahoo.com/news/apple-escapes-supply-chain-crisis-183111921.html"
            },
            {
                "headline": "Tariff uncertainty will cause chaos in the supply chain, says Wedbush’s Dan Ives.",
                "publication_date": "2025-04-14T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.7269",
                "source": "Fortune",
                "ticker": "AAPL",
                "title": "Apple fans won’t stay loyal if tariffs mean $2,000 iPhones, top analyst warns",
                "url": "https://finance.yahoo.com/news/apple-fans-won-t-stay-202605693.html"
            }
        ],
        "avgScore": 0.13417419354838717
    },
    "4 11 2025": {
        "importantArticles": [
            {
                "headline": "We recently published a list of 11 Best Digital Payments Stocks to Buy According to Analysts. In this article, we are going to take a look at where Apple Inc. (NASDAQ:AAPL) stands against other best digital payment stocks. Digital payment stocks are companies that specialize in designing, developing, or administering digital payment solutions. These firms […]",
                "publication_date": "2025-04-11T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8779",
                "source": "Insider Monkey",
                "ticker": "AAPL",
                "title": "Is Apple Inc. (AAPL) Among the Best Digital Payments Stocks to Buy According to Analysts?",
                "url": "https://finance.yahoo.com/news/apple-inc-aapl-among-best-121656313.html"
            },
            {
                "headline": "Apple shares surged Friday, leading other Magnificent Seven members higher amid a broader market rebound to cap off a wild week fueled by tariff-driven volatility.",
                "publication_date": "2025-04-11T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7269",
                "source": "Investopedia",
                "ticker": "AAPL",
                "title": "Apple Leads Magnificent 7 Stocks Higher Friday to Cap Off Volatile Week",
                "url": "https://finance.yahoo.com/news/apple-leads-magnificent-7-stocks-223132162.html"
            },
            {
                "headline": "ChatGPT, OpenAI’s text-generating AI chatbot, has taken the world by storm since its launch in November 2022. What started as a tool to supercharge productivity through writing essays and code with short text prompts has evolved into a behemoth with 300 million weekly active users. 2024 was a big year for OpenAI, from its partnership with Apple for its generative AI offering, Apple Intelligence, the release of GPT-4o with voice capabilities, and the highly-anticipated launch of its text-to-video",
                "publication_date": "2025-04-11T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7003",
                "source": "TechCrunch",
                "ticker": "AAPL",
                "title": "ChatGPT: Everything you need to know about the AI-powered chatbot",
                "url": "https://finance.yahoo.com/news/chatgpt-everything-know-ai-powered-210339686.html"
            },
            {
                "headline": "Investing.com -- The U.S.-China tariff situation escalated, escalated again, and now is a full-blown trade war. As of Friday morning, the U.S. has a 145% tariff on goods coming from China, and China has a 125% tariff on goods coming from the U.S. Ground zero for the trade war is Apple, which makes 90% of its iPhones in China.",
                "publication_date": "2025-04-11T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.8316",
                "source": "Investing.com",
                "ticker": "AAPL",
                "title": "Apple is praying for a tariff exemption, while planning for the worst",
                "url": "https://finance.yahoo.com/news/apple-praying-tariff-exemption-while-161815013.html"
            },
            {
                "headline": "Brad Smith and Madison Mills take a closer look at some of Yahoo Finance's trending tickers. Tesla (TSLA) has stopped taking orders in China for two car models that are imported from the US amid the ongoing US–China trade war. Apple (AAPL) is in focus after Wedbush analysts said the iPhone maker is the tech company most negatively impacted by President Trump's tariffs. JPMorgan Chase (JPM) CEO Jamie Dimon says the US economy faces \"considerable turbulence.\" To watch more expert insights and analysis on the latest market action, check out more Morning Brief here.",
                "publication_date": "2025-04-11T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.7003",
                "source": "Yahoo Finance Video",
                "ticker": "AAPL",
                "title": "Tesla, Apple, Jamie Dimon comments: Trending Tickers",
                "url": "https://finance.yahoo.com/video/tesla-apple-jamie-dimon-comments-144826503.html"
            },
            {
                "headline": "We recently published a list of 10 AI Stocks to Watch Now. In this article, we are going to take a look at where Apple Inc. (NASDAQ:AAPL) stands against other AI stocks to watch now. The trade war between two of the world’s biggest economies, China and the US, is deepening even further. In a […]",
                "publication_date": "2025-04-11T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5994",
                "source": "Insider Monkey",
                "ticker": "AAPL",
                "title": "Apple (AAPL) Gets a Pass on Tariffs – $500 Billion U.S. Investment Could Be Its Saving Grace",
                "url": "https://finance.yahoo.com/news/apple-aapl-gets-pass-tariffs-150422939.html"
            }
        ],
        "avgScore": 0.009448148148148148
    },
    "4 10 2025": {
        "importantArticles": [
            {
                "headline": "Apple shares tumbled Thursday, giving back some of their gains from a historic rally Wednesday when President Trump paused most of the tariffs announced last week.",
                "publication_date": "2025-04-10T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7184",
                "source": "Investopedia",
                "ticker": "AAPL",
                "title": "Apple Stock Resumes Its Slide After Posting Best Day Since 1998",
                "url": "https://finance.yahoo.com/news/apple-stock-resumes-slide-posting-164840947.html"
            },
            {
                "headline": "The \"Magnificent Seven,\" made up of Nvidia (NVDA), Alphabet (GOOG, GOOGL), Tesla (TSLA), Microsoft (MSFT), Amazon (AMZN), Meta (META), and Apple (AAPL), added over $1.8 trillion to their market capitalizations during the tariff pause–fueled stock rally on Wednesday. In this episode of Stocks in Translation, podcast host Jared Blikre dives deeper into the latest price action for large-cap tech names. Catch more Stocks in Translation here, with new episodes every Tuesday and Thursday. To watch more expert insights and analysis on the latest market action, check out more Catalysts here.",
                "publication_date": "2025-04-10T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.6808",
                "source": "Yahoo Finance Video",
                "ticker": "AAPL",
                "title": "Mag 7 market cap value surged on tariff pause news",
                "url": "https://finance.yahoo.com/video/mag-7-market-cap-value-170851996.html"
            },
            {
                "headline": "Carolina Milanesi, Creative Strategies president and principal analyst, says Apple's reported airlift of iPhones from India to the US ahead of tariffs is unlike anything she has seen in her career. She explains why Apple is unlikely to build iPhones in the US with Caroline Hyde and Ed Ludlow on \"Bloomberg Technology.\"",
                "publication_date": "2025-04-10T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.4404",
                "source": "Bloomberg",
                "ticker": "AAPL",
                "title": "Apple's Efforts to Prepare for Tariffs",
                "url": "https://finance.yahoo.com/video/apples-efforts-prepare-tariffs-190121473.html"
            },
            {
                "headline": "Here are some of the stories Wall Street is watching on Thursday, April 10. The ongoing trade battle between the US and China is weighing on shares of Apple (AAPL), Disney (DIS), and Warner Bros. Discovery (WBD). Oil prices (CL=F, BZ=F) are also falling on worries that tariffs could weigh on demand. Stay up to date on the latest market action, minute-by-minute, with Yahoo Finance's Market Minute.",
                "publication_date": "2025-04-10T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.6486",
                "source": "Yahoo Finance Video",
                "ticker": "AAPL",
                "title": "Oil falls, China tensions weigh on Apple, Disney: Market Minute",
                "url": "https://finance.yahoo.com/video/oil-falls-china-tensions-weigh-180921476.html"
            },
            {
                "headline": "We recently published a list of Jim Cramer Says Tariff Pain Isn’t Over Yet And Reviews These 9 Stocks. In this article, we are going to take a look at where Apple Inc. (NASDAQ:AAPL) stands against other stocks that Jim Cramer discusses. In his latest appearance on CNBC’s Squawk on the Street, Jim Cramer dissected the […]",
                "publication_date": "2025-04-10T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5106",
                "source": "Insider Monkey",
                "ticker": "AAPL",
                "title": "Jim Cramer on Apple Inc. (AAPL): Can Tariffs Derail the iPhone Giant’s Global Dominance?",
                "url": "https://finance.yahoo.com/news/jim-cramer-apple-inc-aapl-205651664.html"
            },
            {
                "headline": "Shares of Apple (NASDAQ: AAPL) are heading lower in Thursday's trading.  The stock market skyrocketed yesterday after President Donald Trump announced a 90-day lifting of reciprocal tariffs on all countries except China, but valuations are heading lower today after new information emerged.  While Trump announced yesterday that an import tax rate of 125% would be applied to Chinese goods, it turns out the tariff rate is now 145%.",
                "publication_date": "2025-04-10T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.4215",
                "source": "Motley Fool",
                "ticker": "AAPL",
                "title": "Why Apple Stock Is Sinking Today",
                "url": "https://finance.yahoo.com/news/why-apple-stock-sinking-today-202758166.html"
            }
        ],
        "avgScore": 0.12790769230769225
    },
    "coef": -0.7714285714285715,
    "avgCoef": 0.02969465660327851,
    "similar": {
        "ABEV": 0.6,
        "TTD": 0.6,
        "HTZ": 0.3714285714285715,
        "SNAP": 0.2571428571428572
    }
}