{
    "Important Articles": [
        {
            "headline": "Strong full year earnings growth; GAAP EPS up 40%, Adjusted EPS up 25% GAAP operating cash flows up 14%, Adjusted Free Cash Flow including interest rate swaps up 42% Record recurring monthly revenue and customer retention Returned $423 million to shareholders and continued leverage reduction Maintaining momentum into 2025 with strong cash flow and new $500 million share repurchase plan BOCA RATON, Fla., Feb. 27, 2025 (GLOBE NEWSWIRE) -- ADT Inc. (NYSE: ADT), the most trusted brand in smart home",
            "publication_date": "2025-02-27T11:55:00.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.9712",
            "source": "GlobeNewswire",
            "ticker": "ADT",
            "title": "ADT Reports Fourth Quarter and Full Year 2024 Results",
            "url": "https://finance.yahoo.com/news/adt-reports-fourth-quarter-full-115500225.html"
        },
        {
            "headline": "The latest update is out from Adt ( (ADT) ). ADT Inc. reported a robust third quarter of 2024, with a 5% rise in revenue to $1.2 billion and a 7% increase in GAAP income from continuing operations. The company’s recurring monthly revenue hit a record high, supported by strong customer retention. With successful initiatives like the Trusted Neighbor launch and strategic acquisitions, ADT is on track to meet its 2024 financial targets while enhancing shareholder value. See more insights into ADT s",
            "publication_date": "2024-10-25T11:29:52.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.9643",
            "source": "TipRanks",
            "ticker": "ADT",
            "title": "ADT Inc. Reports Strong Q3 2024 Financial Performance",
            "url": "https://finance.yahoo.com/news/adt-inc-reports-strong-q3-112952614.html"
        },
        {
            "headline": "BOCA RATON, Fla., Jan. 22, 2025 (GLOBE NEWSWIRE) -- ADT Inc. (NYSE: ADT), the most trusted brand in smart home and small business security, today announced the appointment of Thomas Gartland to the Company’s Board of Directors as an additional independent director. In conjunction with his appointment, Gartland will join the Board’s Audit Committee. “We are pleased to welcome Tom to our board of directors,” said ADT Chairman, President and CEO, Jim DeVries. “Tom’s proven track record of driving o",
            "publication_date": "2025-01-22T12:00:00.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.9392",
            "source": "GlobeNewswire",
            "ticker": "ADT",
            "title": "ADT Appoints Thomas Gartland to the Company’s Board of Directors",
            "url": "https://finance.yahoo.com/news/adt-appoints-thomas-gartland-company-120000155.html"
        },
        {
            "headline": "We recently published a list of 10 Worst Affordable Stocks to Buy Under $10. In this article, we are going to take a look at where ADT Inc. (NYSE:ADT) stands against other worst affordable stocks to buy under $10. Will There Be a Small Cap Resurgence in 2025? On February 18, Chris Clark, Chief Executive […]",
            "publication_date": "2025-03-27T01:40:23.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.8481",
            "source": "Insider Monkey",
            "ticker": "ADT",
            "title": "Is ADT Inc. (NYSE:ADT) the Worst Affordable Stocks to Buy Under $10?",
            "url": "https://finance.yahoo.com/news/adt-inc-nyse-adt-worst-014023309.html"
        },
        {
            "headline": "Most consumer discretionary businesses succeed or fail based on the broader economy. This sensitive demand profile can cause discretionary stocks to plummet when macro uncertainty enters the fray, and over the past six months, the industry has shed 10.7%. This drop was worse than the S&P 500’s 5.2% fall.",
            "publication_date": "2025-04-03T19:38:08.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.8126",
            "source": "StockStory",
            "ticker": "ADT",
            "title": "3 Consumer Stocks with Bad Fundamentals",
            "url": "https://finance.yahoo.com/news/3-consumer-stocks-bad-fundamentals-193808969.html"
        },
        {
            "headline": "Investors need to pay close attention to ADT stock based on the movements in the options market lately.",
            "publication_date": "2024-11-05T13:46:00.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.1027",
            "source": "Zacks",
            "ticker": "ADT",
            "title": "Is the Options Market Predicting a Spike in ADT Stock?",
            "url": "https://finance.yahoo.com/news/options-market-predicting-spike-adt-134600102.html"
        }
    ],
    "Avg Score": 0.3987624999999999
}