{
    "4 15 2025": {
        "importantArticles": [
            {
                "headline": "We recently published a list of the 10 Best Machine Learning Stocks to Buy Now. In this article, we are going to take a look at where Advanced Micro Devices, Inc. (NASDAQ:AMD) stands against other machine-learning stocks. Grand View Research reported that the global machine-learning market was valued at $36.73 billion in 2022. It’s now […]",
                "publication_date": "2025-04-15T13:15:59.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9022",
                "source": "Insider Monkey",
                "ticker": "AMD",
                "title": "Is Advanced Micro Devices (AMD) the Best Machine Learning Stock to Buy Now?",
                "url": "https://finance.yahoo.com/news/advanced-micro-devices-amd-best-131559799.html"
            },
            {
                "headline": "Tariffs may be the talk of Wall Street, but there are far more pressing issues for the stock market's artificial intelligence (AI) darling.",
                "publication_date": "2025-04-15T07:51:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8847",
                "source": "Motley Fool",
                "ticker": "AMD",
                "title": "Nvidia Has 3 Considerably Bigger Concerns Than Tariffs",
                "url": "https://finance.yahoo.com/news/nvidia-3-considerably-bigger-concerns-075100065.html"
            },
            {
                "headline": "TAIPEI (Reuters) -Advanced Micro Devices said on Tuesday its key processor chips would soon be made at TSMC's new production site in Arizona, marking the first time that its products will be manufactured in the United States.  Though AMD's plans predate U.S. President Donald Trump's return to office, tech companies' efforts to diversify their supply chains have taken on added significance given Trump's escalating tariff war.  \"Our new fifth-generation EPYC is doing very well, so we're ready to start production,\" AMD Chief Executive Lisa Su told reporters in Taipei, referring to the company's central processing unit (CPU) for data centres.",
                "publication_date": "2025-04-15T01:19:56.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7328",
                "source": "Reuters",
                "ticker": "AMD",
                "title": "AMD set to produce its CPU chip at TSMC plant in Arizona",
                "url": "https://finance.yahoo.com/news/amd-ceo-says-ready-start-011956898.html"
            },
            {
                "headline": "AMD said Tuesday that some of its central-processing units for data centers will be made at Taiwan Semiconductor Manufacturing’s site in Arizona.",
                "publication_date": "2025-04-15T14:06:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Barrons.com",
                "ticker": "AMD",
                "title": "AMD to Make Chips at U.S. Site with TSMC. It’s the Latest Stock to Rev Up U.S. Manufacturing.",
                "url": "https://finance.yahoo.com/m/2b268bd7-1ac4-3efe-8601-38b8d3b49bb0/amd-to-make-chips-at-u-s-.html"
            },
            {
                "headline": "AMD's New Venice Processor to Launch From Arizona, Marking Historic Domestic Manufacturing Shif",
                "publication_date": "2025-04-15T12:34:47.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "GuruFocus.com",
                "ticker": "AMD",
                "title": "AMD to Launch U.S.-Made Venice Chip at TSMC Arizona Plant",
                "url": "https://finance.yahoo.com/news/amd-launch-u-made-venice-123447449.html"
            },
            {
                "headline": "Despite a brief recovery, structural issues and high valuations weigh heavily on Intel's outlook",
                "publication_date": "2025-04-15T09:57:56.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "GuruFocus.com",
                "ticker": "AMD",
                "title": "Intel: Overblown Optimism Meets Stark Reality",
                "url": "https://finance.yahoo.com/news/intel-overblown-optimism-meets-stark-095756917.html"
            }
        ],
        "avgScore": 0.29240000000000005
    },
    "4 14 2025": {
        "importantArticles": [
            {
                "headline": "Advanced Micro Devices (NasdaqGS:AMD) has experienced a notable price increase of 12% over the past week, largely reflected in its launch of the 5th Gen AMD EPYC processors integrated into Oracle Cloud Infrastructure. This development highlights the company's advancements in server technology, boosting interest in AMD and possibly contributing to its strong stock performance. While the broader market's recent 6% gain due to tariff exemptions and other favorable tech stock movements could also...",
                "publication_date": "2025-04-14T17:24:23.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9552",
                "source": "Simply Wall St.",
                "ticker": "AMD",
                "title": "Advanced Micro Devices (NasdaqGS:AMD) Launches 5th Gen EPYC Processors in Oracle Cloud Infrastructure",
                "url": "https://finance.yahoo.com/news/advanced-micro-devices-nasdaqgs-amd-172423981.html"
            },
            {
                "headline": "VAST Data has been recognized on the Forbes AI 50 list for 2025, which highlights the most promising private AI companies globally. This listing underscores VAST’s significant role in AI infrastructure, evidenced by its platform being utilized by numerous organizations for AI training and inference operations. The company has been noted for its strong innovation and sustained growth in the competitive AI market. VAST Data’s distributed, internet-scale platform has become integral to...",
                "publication_date": "2025-04-14T11:37:24.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9184",
                "source": "Simply Wall St.",
                "ticker": "AMD",
                "title": "AI Chips Update - VAST Data Shines on Forbes AI 50 List 2025",
                "url": "https://finance.yahoo.com/news/ai-chips-vast-data-shines-113724303.html"
            },
            {
                "headline": "Apple led the \"Magnificent Seven\" stocks higher Monday as investors cheered the Trump administration's temporary tariff exemptions for tech products announced over the weekend.",
                "publication_date": "2025-04-14T12:54:23.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.802",
                "source": "Yahoo Finance",
                "ticker": "AMD",
                "title": "Apple leads tech stocks higher on Trump's temporary tech tariff reprieve",
                "url": "https://finance.yahoo.com/news/apple-leads-tech-stocks-higher-on-trumps-temporary-tech-tariff-reprieve-125423982.html"
            },
            {
                "headline": "Wall Street has soured on this AI hardware challenger despite strong business results. Should smart investors be buying while others are fearful?",
                "publication_date": "2025-04-14T08:19:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.4023",
                "source": "Motley Fool",
                "ticker": "AMD",
                "title": "This Artificial Intelligence Challenger Is Down 49%. Is It Time to Buy the Dip on the Stock?",
                "url": "https://finance.yahoo.com/news/artificial-intelligence-challenger-down-49-081900358.html"
            },
            {
                "headline": "We recently published a list of 14 AI Stocks Catching Wall Street’s Attention. In this article, we are going to take a look at where Advanced Micro Devices, Inc. (NASDAQ:AMD) stands against other AI stocks catching Wall Street’s attention. In the latest development in the feud between OpenAI and Elon Musk, the ChatGPT maker has […]",
                "publication_date": "2025-04-14T13:15:50.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.1027",
                "source": "Insider Monkey",
                "ticker": "AMD",
                "title": "Advanced Micro Devices (AMD): New AI Chips and GPU Momentum Fuel Optimism Despite Lower Target",
                "url": "https://finance.yahoo.com/news/advanced-micro-devices-amd-ai-131550630.html"
            },
            {
                "headline": "AMD Achieves First TSMC N2 Product Silicon Milestone \"AMD Chair and CEO, Dr. Lisa Su and TSMC Chairman and CEO Dr. C.C. Wei holding a wafer of the next gen AMD EPYC CPU, codenamed 'Venice' produced on the TSMC advanced 2nm (N2) process technology.\" — Next-generation AMD EPYC CPU, codenamed “Venice,” is the first HPC product to be brought up on TSMC’s next-generation N2 node — SANTA CLARA, Calif., April 14, 2025 (GLOBE NEWSWIRE) -- AMD (NASDAQ: AMD) today announced its next-generation AMD EPYC™ p",
                "publication_date": "2025-04-14T22:01:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.25",
                "source": "GlobeNewswire",
                "ticker": "AMD",
                "title": "AMD Achieves First TSMC N2 Product Silicon Milestone",
                "url": "https://finance.yahoo.com/news/amd-achieves-first-tsmc-n2-220100807.html"
            }
        ],
        "avgScore": 0.38151428571428575
    },
    "4 11 2025": {
        "importantArticles": [
            {
                "headline": "The stock market is off to a rough start to 2025.  It's never fun to see the value of your portfolio dwindle, and there's never any certainty about when a period of market volatility will end.  Buying top AI stocks at their now-lower prices could be the smartest move you make this year.",
                "publication_date": "2025-04-11T08:08:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.5801",
                "source": "Motley Fool",
                "ticker": "AMD",
                "title": "2 AI Stocks to Buy in the Wake of the Market Sell-Off",
                "url": "https://finance.yahoo.com/news/2-ai-stocks-buy-wake-080800243.html"
            },
            {
                "headline": "We recently published a list of Top 10 Stocks in Ken Griffin’s Portfolio to Buy According to Analysts. In this article, we are going to take a look at where Advanced Micro Devices Inc. (NASDAQ:AMD) stands against other top stocks in Ken Griffin’s portfolio to buy according to analysts. Ken Griffin is one billionaire investor […]",
                "publication_date": "2025-04-11T16:21:35.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.5574",
                "source": "Insider Monkey",
                "ticker": "AMD",
                "title": "Is Advanced Micro Devices Inc. (AMD) the Top Stock in Ken Griffin’s Portfolio to Buy According to Analysts?",
                "url": "https://finance.yahoo.com/news/advanced-micro-devices-inc-amd-162135774.html"
            },
            {
                "headline": "AMD has introduced the 5th Gen AMD EPYC processors, which are now powering Google Cloud's new C4D and H4D virtual machines (VMs). These VMs offer significant enhancements in performance, scalability, and efficiency, specifically tailored for demanding cloud workloads including AI and high-performance computing (HPC). The C4D instances, fueled by AMD's \"Zen 5\" architecture, show up to 80% higher throughput per vCPU, catering to general-purpose and AI inferencing tasks, while the H4D instances...",
                "publication_date": "2025-04-11T11:37:37.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.34",
                "source": "Simply Wall St.",
                "ticker": "AMD",
                "title": "AI Chips Update - AMD Powers Google Cloud With 5th Gen EPYC Processors",
                "url": "https://finance.yahoo.com/news/ai-chips-amd-powers-google-113737152.html"
            },
            {
                "headline": "The chipmaking giant has a new CEO, but it still faces existential challenges.",
                "publication_date": "2025-04-11T08:14:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.1154",
                "source": "Motley Fool",
                "ticker": "AMD",
                "title": "Where Will Intel Stock Be in 3 Years?",
                "url": "https://finance.yahoo.com/news/where-intel-stock-3-years-081400654.html"
            },
            {
                "headline": "NVIDIA, Palantir Technologies, Advanced Micro Devices, Microsoft and Amazon.com are included in this Analyst Blog.",
                "publication_date": "2025-04-11T10:44:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.25",
                "source": "Zacks",
                "ticker": "AMD",
                "title": "The Zacks Analyst Blog Highlights NVIDIA, Palantir Technologies, Advanced Micro Devices, Microsoft and Amazon.com",
                "url": "https://finance.yahoo.com/news/zacks-analyst-blog-highlights-nvidia-104400653.html"
            },
            {
                "headline": "AMD and Google Cloud Join Forces on High-Performance VMs",
                "publication_date": "2025-04-11T18:14:12.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.296",
                "source": "GuruFocus.com",
                "ticker": "AMD",
                "title": "AMD Shares Climb on Expanding AI Footprint in New Google Cloud Partnership",
                "url": "https://finance.yahoo.com/news/amd-shares-climb-expanding-ai-181412775.html"
            }
        ],
        "avgScore": 0.35648333333333343
    },
    "4 10 2025": {
        "importantArticles": [
            {
                "headline": "We recently published a list of Top 12 Tech Stocks to Buy According to Billionaire Ken Fisher. In this article, we are going to take a look at where Advanced Micro Devices, Inc. (NASDAQ:AMD) stands against other top tech stocks to buy according to Billionaire Ken Fisher. Under the umbrella of Fisher Asset Management, Billionaire […]",
                "publication_date": "2025-04-10T21:45:19.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7269",
                "source": "Insider Monkey",
                "ticker": "AMD",
                "title": "Advanced Micro Devices (AMD): Among the Top Tech Stocks to Buy According to Billionaire Ken Fisher",
                "url": "https://finance.yahoo.com/news/advanced-micro-devices-amd-among-214519638.html"
            },
            {
                "headline": "Advanced Micro Devices (NASDAQ: AMD) stock saw a day of big sell-offs Thursday.  The semiconductor company's share price wound up down 8.4% in a day of trading that saw the S&P 500 fall 3.5% and the Nasdaq Composite fall 4.4%.  The stock market followed Wednesday's surge on tariff news with substantial sell-offs today as more information about import taxes on China came into focus.",
                "publication_date": "2025-04-10T21:00:22.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.6124",
                "source": "Motley Fool",
                "ticker": "AMD",
                "title": "Why AMD Stock Is Plummeting Today",
                "url": "https://finance.yahoo.com/news/why-amd-stock-plummeting-today-210022308.html"
            },
            {
                "headline": "Advanced Micro Devices is benefiting from an expanding usage of its fifth-generation EPYC processors.",
                "publication_date": "2025-04-10T16:49:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.25",
                "source": "Zacks",
                "ticker": "AMD",
                "title": "AMD's EPYC Powers GOOGL & ORCL Solutions: Should You Hold the Stock?",
                "url": "https://finance.yahoo.com/news/amds-epyc-powers-googl-orcl-164900962.html"
            },
            {
                "headline": "Nvidia avoided new chip export restrictions to China after discussions between CEO Jensen Huang and President Trump.",
                "publication_date": "2025-04-10T21:27:58.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.34",
                "source": "GuruFocus.com",
                "ticker": "AMD",
                "title": "Nvidia and AMD Push Forward With AI Chip Strategies Amid Tariff Relief, Stock Volatility",
                "url": "https://finance.yahoo.com/news/nvidia-amd-push-forward-ai-212758235.html"
            },
            {
                "headline": "A put ratio backspread for AMD stock involves selling a put and then buying two further out-of-the-money puts.",
                "publication_date": "2025-04-10T15:35:27.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Investor's Business Daily",
                "ticker": "AMD",
                "title": "How A Put Ratio Backspread Can Limit Losses On AMD Stock",
                "url": "https://finance.yahoo.com/m/c75d6a11-9360-3022-a58e-6f48bdb06d3d/how-a-put-ratio-backspread.html"
            },
            {
                "headline": "These market leaders have high return potential through 2030.",
                "publication_date": "2025-04-10T08:05:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Motley Fool",
                "ticker": "AMD",
                "title": "Got $1,000? 2 Top Growth Stocks to Buy That Could Double Your Money",
                "url": "https://finance.yahoo.com/news/got-1-000-2-top-080500336.html"
            }
        ],
        "avgScore": 0.2082166666666667
    },
    "4 9 2025": {
        "importantArticles": [
            {
                "headline": "Brad Smith takes a closer look at the top stories as part of today's Market Minute. Trump Media & Technology Group (DJT) stock gains as US President Trump tells markets to \"be cool,\" saying it's \"a great time to buy.\" Advanced Micro Devices (AMD) gains amid a broader tech rally despite TD Cowen analysts cutting the company's price target to $100 from $135. Bernstein analysts downgrade Ford (F) to Sell from Hold, citing the impact of tariffs. Stay up to date on the latest market action, minute-by-minute, with Yahoo Finance's Market Minute.",
                "publication_date": "2025-04-09T16:25:19.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8807",
                "source": "Yahoo Finance Video",
                "ticker": "AMD",
                "title": "DJT stock pops, AMD rises, Ford tariff risks: Market Minute",
                "url": "https://finance.yahoo.com/video/djt-stock-pops-amd-rises-162519217.html"
            },
            {
                "headline": "LPL Financial Holdings Inc. has appointed Vaughn Harvey as the executive vice president and chief data and artificial intelligence (AI) officer, marking a significant move in its AI strategy. With over 25 years of experience in AI-driven digital transformations, Harvey will spearhead LPL’s data and AI initiatives, enhancing digital transformation across the organization. This appointment comes as LPL Financial aims to advance its offerings in artificial intelligence through programs like AI...",
                "publication_date": "2025-04-09T11:38:02.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8591",
                "source": "Simply Wall St.",
                "ticker": "AMD",
                "title": "This Week In AI Chips - LPL Financial Enhances AI Strategy With Key Executive Appointment",
                "url": "https://finance.yahoo.com/news/week-ai-chips-lpl-financial-113802366.html"
            },
            {
                "headline": "The company will showcase its vision for AI, and the hardware, software, partners and customers that will advance ItSANTA CLARA, Calif., April 09, 2025 (GLOBE NEWSWIRE) -- Today, AMD (NASDAQ: AMD) announced “Advancing AI 2025,” an in-person and livestreamed event on June 12, 2025. The industry event will showcase the company’s bold vision for AI, announce the next generation of AMD Instinct™ GPUs, AMD ROCm™ open software ecosystem progress, and reveal details on AI solutions for hyperscalers, en",
                "publication_date": "2025-04-09T13:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8442",
                "source": "GlobeNewswire",
                "ticker": "AMD",
                "title": "AMD Announces “Advancing AI 2025”",
                "url": "https://finance.yahoo.com/news/amd-announces-advancing-ai-2025-130000071.html"
            },
            {
                "headline": "The S&P 500 surged 9.5% on Wednesday, April 9, roaring back in an afternoon rally after President Trump temporarily suspended widespread tariffs.",
                "publication_date": "2025-04-09T20:57:01.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.4767",
                "source": "Investopedia",
                "ticker": "AMD",
                "title": "S&P 500 Gains and Losses Today: Index Roars Back After Reprieve on 'Reciprocal' Tariffs",
                "url": "https://finance.yahoo.com/news/p-500-gains-losses-today-205701179.html"
            },
            {
                "headline": "The latest investor updates on stocks that are trending on Wednesday.",
                "publication_date": "2025-04-09T09:32:54.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Yahoo Finance UK",
                "ticker": "AMD",
                "title": "Trending tickers: Apple, Advanced Micro Devices, Ford, BP and AstraZeneca",
                "url": "https://finance.yahoo.com/news/apple-advanced-micro-devices-ford-bp-astrazeneca-trending-tickers-093254195.html"
            },
            {
                "headline": "The most talked about and market moving research calls around Wall Street are now in one place. Here are today’s research calls that investors need to know, as compiled by The Fly. Top 5 Upgrades: Melius Research upgraded Dollar General (DG) to Buy from Hold with a $110 price target. While the company had its own “self-inflicted” challenges and competitive challenges over the last 12 months, the firm believes it likely will benefit from a worsening macro environment and a lack of tariff exposure",
                "publication_date": "2025-04-09T13:35:20.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.2023",
                "source": "TipRanks",
                "ticker": "AMD",
                "title": "AMD downgraded, Dollar General upgraded: Wall Street’s top analyst calls",
                "url": "https://finance.yahoo.com/news/amd-downgraded-dollar-general-upgraded-133520598.html"
            }
        ],
        "avgScore": 0.4164785714285714
    },
    "coef": 0.39999999999999997,
    "avgCoef": 0.17637981827210847
}