{
    "importantArticles": [
        {
            "headline": "In a strategic partnership, Navitas Semiconductor and Great Wall have developed a next-generation 400V-DC power architecture specifically designed for AI data centers. Leveraging Navitas’ GaNSense technology, the collaboration has resulted in an ultra-high power density DC-DC converter delivering 2.5kW of power—marking a significant leap in power efficiency and density. This innovative power solution supports evolving data center requirements by accommodating more GPUs while promoting energy...",
            "publication_date": "2025-04-04T11:07:30.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.9506",
            "source": "Simply Wall St.",
            "ticker": "AMD",
            "title": "AI Chips Today - Pioneering Power Efficiency In Next-Gen Data Centers",
            "url": "https://finance.yahoo.com/news/ai-chips-today-pioneering-power-110730132.html"
        },
        {
            "headline": "Advanced Micro Devices (NasdaqGS:AMD) launched its 5th Gen EPYC processors, offering a potential uptick in cost-performance ratios and signaling strength in its cloud and embedded markets, which could have supported its share price rise of 3% over the last month. Significant governance changes, such as plans to increase authorized shares, along with altered leadership in AMD's fixed-income offerings, reflect ongoing structural adjustments. Concurrently, the market has faced volatility amid...",
            "publication_date": "2025-04-02T17:34:04.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.926",
            "source": "Simply Wall St.",
            "ticker": "AMD",
            "title": "Advanced Micro Devices (NasdaqGS:AMD) Rises 3% in a Month Amid New EPYC Processors Launch",
            "url": "https://finance.yahoo.com/news/advanced-micro-devices-nasdaqgs-amd-173404382.html"
        },
        {
            "headline": "Super Micro Computer (SMCI) might have the word “micro” in its name, but make no mistake—this Silicon Valley-based server and storage powerhouse has been delivering mighty growth over the past three years. With the boom in AI training, cloud data centers, and enterprise IT, Super Micro has surged 829%, alongside some of the hottest trends in technology. While the company’s most explosive alpha years—2023 and 2024—are now behind us, I believe the runway is far from finished. Based on projected ea",
            "publication_date": "2025-04-03T11:28:27.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.8555",
            "source": "TipRanks",
            "ticker": "AMD",
            "title": "SMCI Stock Set to Transition from Micro to Mighty as Wall St. Analysts Eye 40% Upside",
            "url": "https://finance.yahoo.com/news/smci-stock-set-transition-micro-112827327.html"
        },
        {
            "headline": "Shares of computer processor maker AMD (NASDAQ:AMD) fell 8.4% in the morning session after China imposed a 34% tariff on all U.S. imports amid escalating trade war tensions. This was especially rough for the US chipmakers because a big chunk of their business leans on demand out of China. The new tariffs not only threaten to erode profit margins but also risk reducing market share. Adding to the uncertainty, the Trump administration signaled the possibility of further regulatory action against t",
            "publication_date": "2025-04-04T19:14:05.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.5435",
            "source": "StockStory",
            "ticker": "AMD",
            "title": "Why AMD (AMD) Shares Are Getting Obliterated Today",
            "url": "https://finance.yahoo.com/news/why-amd-amd-shares-getting-191405734.html"
        },
        {
            "headline": "Paul Tudor Jones is betting on these two turnaround stocks over Nvidia.",
            "publication_date": "2025-04-05T12:53:00.000Z",
            "sentiment": "Neutral",
            "sentimentScore": "0.0",
            "source": "Motley Fool",
            "ticker": "AMD",
            "title": "Billionaire Paul Tudor Jones Trimmed His Position in Nvidia and Is Piling Into 2 Turnaround Tech Stocks",
            "url": "https://finance.yahoo.com/news/billionaire-paul-tudor-jones-trimmed-125300769.html"
        },
        {
            "headline": "CoreWeave's stock finds its footing after a muted IPO.",
            "publication_date": "2025-04-02T14:47:23.000Z",
            "sentiment": "Neutral",
            "sentimentScore": "0.0",
            "source": "Yahoo Finance",
            "ticker": "AMD",
            "title": "CoreWeave stock rips higher after muted IPO",
            "url": "https://finance.yahoo.com/news/coreweave-stock-rips-higher-after-muted-ipo-144723161.html"
        }
    ],
    "avgScore": 0.47744117647058826,
    "todayPctChange": -0.05624037613939204,
    "vScore": -2.6851471349139735
}