{
    "Important Articles": [
        {
            "headline": "In a strategic partnership, Navitas Semiconductor and Great Wall have developed a next-generation 400V-DC power architecture specifically designed for AI data centers. Leveraging Navitas’ GaNSense technology, the collaboration has resulted in an ultra-high power density DC-DC converter delivering 2.5kW of power—marking a significant leap in power efficiency and density. This innovative power solution supports evolving data center requirements by accommodating more GPUs while promoting energy...",
            "publication_date": "2025-04-04T11:07:30.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.9506",
            "source": "Simply Wall St.",
            "ticker": "AMD",
            "title": "AI Chips Today - Pioneering Power Efficiency In Next-Gen Data Centers",
            "url": "https://finance.yahoo.com/news/ai-chips-today-pioneering-power-110730132.html"
        },
        {
            "headline": "Advanced Micro Devices (NasdaqGS:AMD) launched its 5th Gen EPYC processors, offering a potential uptick in cost-performance ratios and signaling strength in its cloud and embedded markets, which could have supported its share price rise of 3% over the last month. Significant governance changes, such as plans to increase authorized shares, along with altered leadership in AMD's fixed-income offerings, reflect ongoing structural adjustments. Concurrently, the market has faced volatility amid...",
            "publication_date": "2025-04-02T17:34:04.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.926",
            "source": "Simply Wall St.",
            "ticker": "AMD",
            "title": "Advanced Micro Devices (NasdaqGS:AMD) Rises 3% in a Month Amid New EPYC Processors Launch",
            "url": "https://finance.yahoo.com/news/advanced-micro-devices-nasdaqgs-amd-173404382.html"
        },
        {
            "headline": "Syntiant Corp. has announced the upcoming demonstration of its multimodal vision transformer (ViT) security solution, which will debut at ISC West 2025. This cutting-edge system, designed for deployment at the edge on Ambarella's CV75M system on chip, enhances real-time image processing for security applications without relying on cloud resources. The demonstrated solution leverages AI and machine learning to achieve faster, more efficient monitoring, reducing latency and costs while boosting...",
            "publication_date": "2025-04-02T11:07:44.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.9168",
            "source": "Simply Wall St.",
            "ticker": "AMD",
            "title": "This Week In AI Chips - Syntiant Unveils Next-Gen Vision Transformer for Edge Security",
            "url": "https://finance.yahoo.com/news/week-ai-chips-syntiant-unveils-110744142.html"
        },
        {
            "headline": "Shares of computer processor maker AMD (NASDAQ:AMD) fell 8.4% in the morning session after China imposed a 34% tariff on all U.S. imports amid escalating trade war tensions. This was especially rough for the US chipmakers because a big chunk of their business leans on demand out of China. The new tariffs not only threaten to erode profit margins but also risk reducing market share. Adding to the uncertainty, the Trump administration signaled the possibility of further regulatory action against t",
            "publication_date": "2025-04-04T19:14:05.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.5435",
            "source": "StockStory",
            "ticker": "AMD",
            "title": "Why AMD (AMD) Shares Are Getting Obliterated Today",
            "url": "https://finance.yahoo.com/news/why-amd-amd-shares-getting-191405734.html"
        },
        {
            "headline": "CoreWeave's stock finds its footing after a muted IPO.",
            "publication_date": "2025-04-02T14:47:23.000Z",
            "sentiment": "Neutral",
            "sentimentScore": "0.0",
            "source": "Yahoo Finance",
            "ticker": "AMD",
            "title": "CoreWeave stock rips higher after muted IPO",
            "url": "https://finance.yahoo.com/news/coreweave-stock-rips-higher-after-muted-ipo-144723161.html"
        },
        {
            "headline": "Advanced Micro Devices (NasdaqGS:AMD) experienced a 7% decline over the past month. Despite announcing their 5th Gen AMD EPYC processors to power Oracle Cloud, and expanding their x86 embedded processor portfolio, AMD’s share price nonetheless trended downward. This aligns with a broader sell-off affecting tech stocks amid escalating global trade tensions and a downtrend in major indices, including the Nasdaq, which entered bear market territory. Investor concerns over trade-related impacts...",
            "publication_date": "2025-04-04T17:43:35.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.128",
            "source": "Simply Wall St.",
            "ticker": "AMD",
            "title": "Advanced Micro Devices (NasdaqGS:AMD) Unveils 5th Gen EPYC Processors as Stock Falls 7%",
            "url": "https://finance.yahoo.com/news/advanced-micro-devices-nasdaqgs-amd-174335203.html"
        }
    ],
    "Avg Score": 0.5395941176470589
}