{
    "4 15 2025": {
        "importantArticles": [
            {
                "headline": "As consumers become more aware and more discerning about what they buy, companies that embrace Conscious Capitalism will enjoy an ever-growing competitive edge over those that simply look to grow profits and any cost.  In this podcast, Motley Fool co-founder David Gardner hosts the founder and CEO of Fair Trade USA, Paul Rice, who explains how trade can be more effective than aid in improving the world's economic issues.  To catch full episodes of all The Motley Fool's free podcasts, check out our podcast center.",
                "publication_date": "2025-04-15T14:22:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9516",
                "source": "Motley Fool",
                "ticker": "AMZN",
                "title": "Every Purchase Matters, With Fair Trade USA's Paul Rice",
                "url": "https://finance.yahoo.com/news/every-purchase-matters-fair-trade-142200960.html"
            },
            {
                "headline": "The market may feel like a roller coaster right now. These stocks are poised to weather the storm and make you wealthy for years beyond it.",
                "publication_date": "2025-04-15T10:05:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7184",
                "source": "Motley Fool",
                "ticker": "AMZN",
                "title": "3 Stocks That Could Be Easy Wealth Builders",
                "url": "https://finance.yahoo.com/news/3-stocks-could-easy-wealth-100500004.html"
            },
            {
                "headline": "On one hand, it's understandable that Amazon's (NASDAQ: AMZN) share price fell as much as 29% below its previous high during the recent market sell-off.  After all, the company's e-commerce revenue could be at risk if tariffs lead to an economic decline that causes consumer spending to sink.  On the other hand, I'd argue that Amazon is more insulated from a faltering economy than meets the eye.",
                "publication_date": "2025-04-15T08:45:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7003",
                "source": "Motley Fool",
                "ticker": "AMZN",
                "title": "Stock Market Whiplash: 3 Growth Stocks That Are No-Brainer Buys on the Bounce",
                "url": "https://finance.yahoo.com/news/stock-market-whiplash-3-growth-084500504.html"
            },
            {
                "headline": "We recently published a list of Jim Cramer’s Game Plan: 15 Stocks to Watch. In this article, we are going to take a look at where Amazon.com, Inc. (NASDAQ:AMZN) stands against other stocks that Jim Cramer discusses. On Friday, Mad Money host Jim Cramer outlined what investors should focus on in the week, especially pointing […]",
                "publication_date": "2025-04-15T19:03:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.4939",
                "source": "Insider Monkey",
                "ticker": "AMZN",
                "title": "Amazon.com, Inc. (AMZN) – “Amazon vs. China”: Jim Cramer Warns of a Coming Stock Shortage",
                "url": "https://finance.yahoo.com/news/amazon-com-inc-amzn-amazon-190300387.html"
            },
            {
                "headline": "We recently published a list of 10 AI Stocks to Watch Amid Market Volatility. In this article, we are going to take a look at where Amazon.com Inc (NASDAQ:AMZN) stands against other AI stocks to watch amid market volatility. The uncertain macroeconomic environment is diminishing investors’ readiness to pay high prices for stocks related to […]",
                "publication_date": "2025-04-15T17:17:48.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.1531",
                "source": "Insider Monkey",
                "ticker": "AMZN",
                "title": "Amazon.com, Inc. (AMZN): Hit by Macro Fears, Still a Top Buy",
                "url": "https://finance.yahoo.com/news/amazon-com-inc-amzn-hit-171748458.html"
            },
            {
                "headline": "“All services are starting to recover and resume,” Binance said on X.",
                "publication_date": "2025-04-15T17:05:45.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Fortune",
                "ticker": "AMZN",
                "title": "Binance among crypto exchanges hit by Amazon Web Services outage",
                "url": "https://finance.yahoo.com/news/binance-among-crypto-exchanges-hit-170545776.html"
            }
        ],
        "avgScore": 0.32247692307692305
    },
    "4 14 2025": {
        "importantArticles": [
            {
                "headline": "Apple led the \"Magnificent Seven\" stocks higher Monday as investors cheered the Trump administration's temporary tariff exemptions for tech products announced over the weekend.",
                "publication_date": "2025-04-14T12:54:23.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.802",
                "source": "Yahoo Finance",
                "ticker": "AMZN",
                "title": "Apple leads tech stocks higher on Trump's temporary tech tariff reprieve",
                "url": "https://finance.yahoo.com/news/apple-leads-tech-stocks-higher-on-trumps-temporary-tech-tariff-reprieve-125423982.html"
            },
            {
                "headline": "Investment banks JMP Securities and CFRA today issued bullish notes on Amazon (AMZN) and JPMorgan (JPM), respectively. However, both banks cut their price targets on each of the stocks. JMP Securities’ Bullish Take on AMZN Although AMZN’s growth is likely to slow as its e-commerce business decelerates, its share of the e-commerce market will probably […]",
                "publication_date": "2025-04-14T18:27:41.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7906",
                "source": "Insider Monkey",
                "ticker": "AMZN",
                "title": "Bullish Notes Issued on Amazon (AMZN), JPMorgan (JPM)",
                "url": "https://finance.yahoo.com/news/bullish-notes-issued-amazon-amzn-182741554.html"
            },
            {
                "headline": "The long-term outlooks of Walmart (WMT) and Amazon.com (AMZN) are positive, partly because both names have “pricing power,” Jason Brown, the founder of The Brown Report told Schwab Network recently. The network described Brown as “an expert on stocks.” WMT Has “Huge Pricing Power,” Brown Says In addition to having “huge pricing power,” WMT is […]",
                "publication_date": "2025-04-14T16:16:42.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.5574",
                "source": "Insider Monkey",
                "ticker": "AMZN",
                "title": "Top Stock Picker Is Bullish on WMT, AMZN",
                "url": "https://finance.yahoo.com/news/top-stock-picker-bullish-wmt-161642297.html"
            },
            {
                "headline": "Investing.com -- Citi has trimmed target prices (TPs) and earnings projections for several U.S. internet stocks amid the negative effects of recently imposed tariffs, more limited macro visibility, and a weakening outlook for online advertising.",
                "publication_date": "2025-04-14T12:52:35.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.8173",
                "source": "Investing.com",
                "ticker": "AMZN",
                "title": "Citi cuts internet stock targets amid tariffs and softer macro",
                "url": "https://finance.yahoo.com/news/citi-cuts-internet-stock-targets-125235785.html"
            },
            {
                "headline": "We recently published a list of Jim Cramer Discussed These 12 Stocks. In this article, we are going to take a look at where Amazon.com, Inc. (NASDAQ:AMZN) stands against other stocks that Jim Cramer discussed. On Thursday, Jim Cramer, host of Mad Money, described the 145% duty on China as so extreme that it essentially […]",
                "publication_date": "2025-04-14T00:45:55.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.4939",
                "source": "Insider Monkey",
                "ticker": "AMZN",
                "title": "“Screw the Chinese or Get Screwed!” – Jim Cramer’s Bold Amazon.com (AMZN) Take",
                "url": "https://finance.yahoo.com/news/screw-chinese-screwed-jim-cramer-004555210.html"
            },
            {
                "headline": "Amazon (AMZN) reachead $182.13 at the closing of the latest trading day, reflecting a -1.48% change compared to its last close.",
                "publication_date": "2025-04-14T21:45:17.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.1779",
                "source": "Zacks",
                "ticker": "AMZN",
                "title": "Amazon (AMZN) Stock Sinks As Market Gains: Here's Why",
                "url": "https://finance.yahoo.com/news/amazon-amzn-stock-sinks-market-214517709.html"
            }
        ],
        "avgScore": 0.2805666666666667
    },
    "4 11 2025": {
        "importantArticles": [
            {
                "headline": "Warren Buffett is one of the most successful investors of all time.  Let's explore why a $1,000 bet on Amazon (NASDAQ: AMZN) or BYD (OTC: BYDDY) could turn into significantly more over the long term.  Berkshire Hathaway owns 10 million shares of Amazon, worth roughly $1.75 billion at the time of writing.",
                "publication_date": "2025-04-11T10:30:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8622",
                "source": "Motley Fool",
                "ticker": "AMZN",
                "title": "Got $1,000? 2 No-Brainer Warren Buffett Stocks to Buy Right Now.",
                "url": "https://finance.yahoo.com/news/got-1-000-2-no-103000621.html"
            },
            {
                "headline": "Recently, Amazon.com (NasdaqGS:AMZN) introduced Nova Sonic, a new AI model poised to enhance the company's voice application capabilities. This development aligns with broader market trends where technology stocks saw gains. During the past week, Amazon's shares rose by 6%, contrasting with the broader market's relative stability. The rise in Amazon's stock may have been influenced by this AI advancement, in conjunction with a positive overall tech sector performance, amidst volatile market...",
                "publication_date": "2025-04-11T17:15:26.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8481",
                "source": "Simply Wall St.",
                "ticker": "AMZN",
                "title": "Amazon.com (NasdaqGS:AMZN) Powers EHR Data Revolution With OMNY Health Partnership",
                "url": "https://finance.yahoo.com/news/amazon-com-nasdaqgs-amzn-powers-171526265.html"
            },
            {
                "headline": "There's probably no one better in the investing world to turn to during these times than Warren Buffett.  The billionaire investor and CEO of Berkshire Hathaway has amassed a $250 billion portfolio of stocks, and many of his picks have stood the test of time.  If you're in the market for solid companies that could be great long-term picks, here are two no-brainer Buffett stocks to buy and hold.",
                "publication_date": "2025-04-11T12:20:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7506",
                "source": "Motley Fool",
                "ticker": "AMZN",
                "title": "2 No-Brainer Warren Buffett Stocks to Buy Right Now",
                "url": "https://finance.yahoo.com/news/2-no-brainer-warren-buffett-122000811.html"
            },
            {
                "headline": "At the same time, investors might want to be a little cautious given the uncertainty over the effects that the Trump administration's on-again, off-again tariffs might have on the global economy.  As the leading e-commerce retailer in the world, Amazon (NASDAQ: AMZN) will no doubt be affected by tariffs.  In May, the Trump Administration will also close the \"de minimus\" loophole that these companies have used to avoid duties.",
                "publication_date": "2025-04-11T08:20:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.791",
                "source": "Motley Fool",
                "ticker": "AMZN",
                "title": "My 2 Favorite Stocks to Buy Right Now",
                "url": "https://finance.yahoo.com/news/2-favorite-stocks-buy-now-082000221.html"
            },
            {
                "headline": "(Bloomberg) -- President Donald Trump is casting his latest tariff plan as a strategic win. Markets and business leaders only see more chaos ahead. Most Read from BloombergMidtown Office Building Evacuated on Concerns of Wall CollapseIn Chicago, a Former Steel Mill Looks to Make a Quantum LeapThe Secret Formula for Faster TrainsNYC Tourist Helicopter Crashes in Hudson River, Killing SixInside the Quiet, Extravagant Expansion of the Frick CollectionStock plunged on Thursday, as anxiety spiked amo",
                "publication_date": "2025-04-11T11:16:29.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.7425",
                "source": "Bloomberg",
                "ticker": "AMZN",
                "title": "Trump’s tariff shift still has markets, industry groups panicked",
                "url": "https://finance.yahoo.com/news/trump-tariff-shift-still-markets-111629466.html"
            },
            {
                "headline": "With the Nasdaq Composite in bear market territory (marked by the index falling more than 20% from its all-time high), there is some panic in the market.  Investors are worried about the effect of tariffs on the consumer and would rather be in more conservative investments than artificial intelligence (AI) stocks, which have more upside but with more risk.  Anyone selling right now has a one-year time frame in mind, rather than the three- to five-year time frame that individual investors should have.",
                "publication_date": "2025-04-11T11:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.6236",
                "source": "Motley Fool",
                "ticker": "AMZN",
                "title": "Nasdaq Bear Market: 3 No-Brainer Artificial Intelligence (AI) Stocks to Buy in April",
                "url": "https://finance.yahoo.com/news/nasdaq-bear-market-3-no-110000820.html"
            }
        ],
        "avgScore": 0.07993750000000001
    },
    "4 10 2025": {
        "importantArticles": [
            {
                "headline": "Amazon CEO Andy Jassy thinks companies should invest \"aggressively\" in AI now to reap the full financial rewards in the future. In his annual letter to Amazon shareholders published Thursday, Jassy said \"substantial capital\" is required to keep up with the pace of AI innovation and customer demand for AI products. He added that Amazon, too, needs to spend this money now if it hopes to see strong returns on its investment years down the line. Jassy's comments come after Amazon announced plans dur",
                "publication_date": "2025-04-10T16:01:36.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9423",
                "source": "TechCrunch",
                "ticker": "AMZN",
                "title": "Amazon CEO Andy Jassy urges companies to invest heavily in AI",
                "url": "https://finance.yahoo.com/news/amazon-ceo-andy-jassy-urges-160136603.html"
            },
            {
                "headline": "Amazon chief executive Andy Jassy on Thursday justified the company's billions of dollars in outlays for artificial intelligence development, saying the investment was necessary to remain competitive.  \"If your mission is to make customers' lives better and easier every day, and you believe every customer experience will be reinvented by AI, you're going to invest deeply and broadly in AI,\" Jassy wrote in his letter to shareholders, an annual rite of passage for the top boss at the Seattle retailer.  He said substantial capital investment is necessary to obtain AI chips and build data centers.",
                "publication_date": "2025-04-10T11:09:53.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9382",
                "source": "Reuters",
                "ticker": "AMZN",
                "title": "Amazon CEO sets out AI investment mission in annual shareholder letter",
                "url": "https://finance.yahoo.com/news/amazon-ceo-sets-ai-investment-110953905.html"
            },
            {
                "headline": "It can be discouraging to see your stocks suddenly drop in value, but stock prices don't always match up with a company's long-term value.  Warren Buffett made his fortune by investing in companies when they were selling at discounted prices to what they were ultimately worth.  History has shown repeatedly that investors get their best returns buying shares of quality companies during bear markets.",
                "publication_date": "2025-04-10T10:45:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9267",
                "source": "Motley Fool",
                "ticker": "AMZN",
                "title": "2 Growth Stocks to Buy and Hold Forever",
                "url": "https://finance.yahoo.com/news/2-growth-stocks-buy-hold-104500149.html"
            },
            {
                "headline": "(Bloomberg) -- International Business Machines Corp. spent months revising its diversity initiatives as conservative attacks and souring attitudes toward DEI shifted into a full-blown assault from President Donald Trump.Most Read from BloombergMidtown Office Building Evacuated on Concerns of Wall CollapseIn Chicago, a Former Steel Mill Looks to Make a Quantum LeapThe Secret Formula for Faster TrainsHelicopter Crashes Into Hudson River With Multiple FatalitiesInside the Quiet, Extravagant Expansi",
                "publication_date": "2025-04-10T23:30:48.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.7717",
                "source": "Bloomberg",
                "ticker": "AMZN",
                "title": "IBM Informs Staff of DEI Retreat as Trump-Era Scrutiny Grows",
                "url": "https://finance.yahoo.com/news/ibm-informs-staff-dei-retreat-233048287.html"
            },
            {
                "headline": "Jassy appeared on CNBC but avoided confirming or denying the reports.",
                "publication_date": "2025-04-10T19:18:54.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.7351",
                "source": "GuruFocus.com",
                "ticker": "AMZN",
                "title": "Amazon CEO Sidesteps TikTok Bid Question, Cites Policy Against M&A Comments",
                "url": "https://finance.yahoo.com/news/amazon-ceo-denies-company-made-191854446.html"
            },
            {
                "headline": "(Bloomberg) -- Supply Lines is a daily newsletter that tracks global trade. Sign up here.US President Donald Trump may have announced a delay in some of his tariff plans, but the first signs of an economically-damaging slowdown in global trade are already emerging as companies around the world hit their own pause button on orders and he continues to escalate his trade war with China. Trump announced Wednesday that he would increase import duties on Chinese goods to 125% while also announcing a 9",
                "publication_date": "2025-04-10T09:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.6187",
                "source": "Bloomberg",
                "ticker": "AMZN",
                "title": "Trump is already slowing global trade as companies pause orders",
                "url": "https://finance.yahoo.com/news/trump-already-slowing-global-trade-090000989.html"
            }
        ],
        "avgScore": 0.24344901960784315
    },
    "4 9 2025": {
        "importantArticles": [
            {
                "headline": "Discover the best credit cards to save money, earn rewards and travel smarter.",
                "publication_date": "2025-04-09T10:14:28.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9442",
                "source": "Yahoo Finance UK",
                "ticker": "AMZN",
                "title": "Best credit card deals of the week, 9 April",
                "url": "https://finance.yahoo.com/news/best-credit-card-deals-101428083.html"
            },
            {
                "headline": "Retail investors have a great opportunity to join the smart money right now.",
                "publication_date": "2025-04-09T08:30:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8957",
                "source": "Motley Fool",
                "ticker": "AMZN",
                "title": "Warren Buffett and 8 Other Billionaires Have $8.5 Billion Invested in This Incredible Stock",
                "url": "https://finance.yahoo.com/news/warren-buffett-8-other-billionaires-083000988.html"
            },
            {
                "headline": "The recent sell-off has left few stocks unscathed, including \"Magnificent Seven\" stocks such as Amazon (NASDAQ: AMZN).  Let's take a closer look at Amazon's businesses and financials to see if the stock could still be a winner this year.  It may surprise some investors to learn that the online sales enterprise is likely not a compelling reason to buy Amazon stock.",
                "publication_date": "2025-04-09T22:41:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8894",
                "source": "Motley Fool",
                "ticker": "AMZN",
                "title": "Is Amazon Stock a Buy, Sell, or Hold in 2025?",
                "url": "https://finance.yahoo.com/news/amazon-stock-buy-sell-hold-224100015.html"
            },
            {
                "headline": "According to Bloomberg, the vendors received no warning of the cancellations, which occurred after President Trump's \"Liberation Day\" announcement.",
                "publication_date": "2025-04-09T20:48:03.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5574",
                "source": "Sourcing Journal",
                "ticker": "AMZN",
                "title": "Amazon Pulls Plug on Some China Orders, Footing Vendors with Tariff Bill",
                "url": "https://finance.yahoo.com/news/amazon-pulls-plug-china-orders-204803144.html"
            },
            {
                "headline": "Now is not the time to panic. Now is the time to make rational decisions for your stock portfolio.",
                "publication_date": "2025-04-09T09:40:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5106",
                "source": "Motley Fool",
                "ticker": "AMZN",
                "title": "Stock Market Sell-Off: The 3 Best Stocks to Buy Right Now",
                "url": "https://finance.yahoo.com/news/stock-market-sell-off-3-094000313.html"
            },
            {
                "headline": "A quiet move after Trump's tariff bombshell is exposing Amazon's suppliers--and investors--to a whole new level of risk.",
                "publication_date": "2025-04-09T17:48:54.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.4939",
                "source": "GuruFocus.com",
                "ticker": "AMZN",
                "title": "Amazon Just Canceled Millions in Asia Orders--What They're Not Telling You Will Rattle Markets",
                "url": "https://finance.yahoo.com/news/amazon-just-canceled-millions-asia-174854904.html"
            }
        ],
        "avgScore": 0.18294210526315793
    },
    "4 8 2025": {
        "importantArticles": [
            {
                "headline": "Due to his success -- both personally and through his company, Berkshire Hathaway -- Warren Buffett draws a lot of attention when he speaks and makes investing moves.  With Buffett's net worth of over $150 billion and Berkshire Hathaway's market cap of over $1 trillion (as of April 7), it's easy to see why.  People often look to Berkshire Hathaway's stock portfolio to get inspiration for investments they may want to consider, especially during turbulent market times like we're witnessing now.",
                "publication_date": "2025-04-08T11:38:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9287",
                "source": "Motley Fool",
                "ticker": "AMZN",
                "title": "The Best Warren Buffett Stocks to Buy With $1,000 Right Now",
                "url": "https://finance.yahoo.com/news/best-warren-buffett-stocks-buy-113800383.html"
            },
            {
                "headline": "We recently published a list of 13 Best Big Data Stocks to Buy According to Analysts. In this article, we are going to take a look at where Amazon.com, Inc. (NASDAQ:AMZN) stands against other best big data stocks to buy according to analysts. The big data companies focus on collecting, storing, and analyzing huge amounts […]",
                "publication_date": "2025-04-08T18:05:52.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8934",
                "source": "Insider Monkey",
                "ticker": "AMZN",
                "title": "Is Amazon.com, Inc. (AMZN) the Best Big Data Stock to Buy According to Analysts?",
                "url": "https://finance.yahoo.com/news/amazon-com-inc-amzn-best-180552690.html"
            },
            {
                "headline": "We recently published a list of 10 Best Stocks to Buy According to Billionaire Steve Cohen. In this article, we are going to take a look at where Amazon.com, Inc. (NASDAQ:AMZN) stands against other best stocks to buy according to billionaire Steve Cohen. Steve Cohen, a prominent figure in the world of hedge funds, is […]",
                "publication_date": "2025-04-08T22:11:46.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8934",
                "source": "Insider Monkey",
                "ticker": "AMZN",
                "title": "Is Amazon.com, Inc. (AMZN) the Best Stock to Buy According to Billionaire Steve Cohen?",
                "url": "https://finance.yahoo.com/news/amazon-com-inc-amzn-best-221146630.html"
            },
            {
                "headline": "Tariffs are once again flooding the headlines. They're in your newsfeed, your inbox, and probably your group chat. The Trump administration's sweeping new import taxes—set to hit everything from electronics to apparel—are back in the spotlight, and of course, billionaire entrepreneur Mark Cuban has thoughts. Spoiler: he's not shy about sharing them. \"If these tariffs stick, it's going to be ugly for Amazon, but incredible for all the American sellers,\" Cuban posted on Bluesky. That post lit a fu",
                "publication_date": "2025-04-08T22:30:38.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.864",
                "source": "Benzinga",
                "ticker": "AMZN",
                "title": "Mark Cuban Predicts Tariffs Will Make Things 'Ugly For Amazon, But Incredible for American Sellers' — But Some Point Out They All Source From China",
                "url": "https://finance.yahoo.com/news/mark-cuban-predicts-tariffs-things-223038307.html"
            },
            {
                "headline": "JPMorgan cut its price targets for Amazon stock and Meta Tuesday along with a list of internet stocks, citing recession risk.",
                "publication_date": "2025-04-08T18:08:24.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.6486",
                "source": "Investor's Business Daily",
                "ticker": "AMZN",
                "title": "Meta, Amazon Stock Price Targets Cut By Analyst. Here's How Wall Street Views Tech Giants' Tariff Risk.",
                "url": "https://finance.yahoo.com/m/0d170e44-211e-3574-9ade-21270262e2bd/meta-amazon-stock-price.html"
            },
            {
                "headline": "Trump's tariffs have sent shockwaves through markets amid one of the largest three-day crashes since World War II.",
                "publication_date": "2025-04-08T08:00:53.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5994",
                "source": "Yahoo Finance",
                "ticker": "AMZN",
                "title": "8 charts show the dramatic fallout from Trump’s 'Liberation Day' announcement",
                "url": "https://finance.yahoo.com/news/8-charts-show-the-dramatic-fallout-from-trumps-liberation-day-announcement-080053892.html"
            }
        ],
        "avgScore": 0.3391541666666665
    },
    "coef": -0.4285714285714286,
    "avgCoef": 0.17660613546186438
}