{
    "4 14 2025": {
        "importantArticles": [
            {
                "headline": "We recently published a list of the 11 Best Dividend Paying Stocks According to Hedge Funds. In this article, we are going to take a look at where Broadcom Inc. (NASDAQ:AVGO) stands against other best dividend-paying stocks. Dividend-paying stocks have consistently attracted investor interest due to their long-term value. CNBC highlights this by examining the […]",
                "publication_date": "2025-04-14T16:52:17.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9485",
                "source": "Insider Monkey",
                "ticker": "AVGO",
                "title": "Is Broadcom Inc. (AVGO) the Best Dividend Paying Stock According to Hedge Funds?",
                "url": "https://finance.yahoo.com/news/broadcom-inc-avgo-best-dividend-165217477.html"
            },
            {
                "headline": "Broadcom (NasdaqGS:AVGO) recently announced a substantial share buyback program worth up to $10 billion, enhancing investor confidence. Concurrently, the company is advancing its optical interconnect solutions to support AI infrastructure, potentially bolstering its market position. In the broader market context, tech stocks experienced volatility amid news of tariff exemptions, affecting companies differently within the sector. The tech-heavy Nasdaq Composite saw various fluctuations,...",
                "publication_date": "2025-04-14T17:32:34.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.891",
                "source": "Simply Wall St.",
                "ticker": "AVGO",
                "title": "Broadcom (NasdaqGS:AVGO) Announces Share Buyback Plan Worth Up To US$10 Billion",
                "url": "https://finance.yahoo.com/news/broadcom-nasdaqgs-avgo-announces-share-173234143.html"
            },
            {
                "headline": "One of those is Broadcom (NASDAQ: AVGO), as the market hasn't priced in the future growth of an exciting product line.  At one point, Broadcom's stock was down around 40% from its all-time highs, but has since rebounded to be down around 30%.  Whether you're paying a discount of 25% or 40% from its all-time high, there isn't a lot that's going to derail Broadcom, and investors should use this opportunity to load up on shares.",
                "publication_date": "2025-04-14T12:40:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8061",
                "source": "Motley Fool",
                "ticker": "AVGO",
                "title": "1 Genius Stock to Buy Down 30% From Its High During the Nasdaq Bear Market",
                "url": "https://finance.yahoo.com/news/1-genius-stock-buy-down-124000213.html"
            },
            {
                "headline": "We recently published a list of 14 AI Stocks Catching Wall Street’s Attention. In this article, we are going to take a look at where Broadcom Inc. (NASDAQ:AVGO) stands against other AI stocks catching Wall Street’s attention. In the latest development in the feud between OpenAI and Elon Musk, the ChatGPT maker has countersued billionaire […]",
                "publication_date": "2025-04-14T13:16:54.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.34",
                "source": "Insider Monkey",
                "ticker": "AVGO",
                "title": "Broadcom Inc. (AVGO): Analyst Cuts AI Stock Target Amid Intensifying Tariff Fears",
                "url": "https://finance.yahoo.com/news/broadcom-inc-avgo-analyst-cuts-131654891.html"
            },
            {
                "headline": "BofA Stands by Nvidia, Broadcom with Chip Sector Buoyed by Tariff Delay",
                "publication_date": "2025-04-14T14:18:05.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.3182",
                "source": "GuruFocus.com",
                "ticker": "AVGO",
                "title": "BofA Reaffirms Nvidia and Broadcom as Top Chip Picks After Tariff Pause",
                "url": "https://finance.yahoo.com/news/bofa-reaffirms-nvidia-broadcom-top-141805609.html"
            },
            {
                "headline": "Broadcom Inc. (AVGO) has been one of the stocks most watched by Zacks.com users lately. So, it is worth exploring what lies ahead for the stock.",
                "publication_date": "2025-04-14T13:00:14.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.1621",
                "source": "Zacks",
                "ticker": "AVGO",
                "title": "Here is What to Know Beyond Why Broadcom Inc. (AVGO) is a Trending Stock",
                "url": "https://finance.yahoo.com/news/know-beyond-why-broadcom-inc-130014284.html"
            }
        ],
        "avgScore": 0.41248333333333337
    },
    "4 11 2025": {
        "importantArticles": [
            {
                "headline": "Tariffs crushed NVIDIA and Broadcom this year, but which stock is now a great deal for investors?",
                "publication_date": "2025-04-11T19:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.6956",
                "source": "Zacks",
                "ticker": "AVGO",
                "title": "Which AI Stock, NVIDIA or Broadcom, Is the Better Bargain to Buy?",
                "url": "https://finance.yahoo.com/news/ai-stock-nvidia-broadcom-better-190000358.html"
            },
            {
                "headline": "We recently published a list of 12 Best Tech Stocks to Buy For Long-Term Investment. In this article, we are going to take a look at where Broadcom Inc. (NASDAQ:AVGO) stands against other tech stocks to buy for long-term investment. On April 1, Chris Verrone, chief market strategist at Strategas Research Partners, appeared on CNBC’s […]",
                "publication_date": "2025-04-11T21:30:07.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.6369",
                "source": "Insider Monkey",
                "ticker": "AVGO",
                "title": "Is Broadcom Inc. (NASDAQ:AVGO) the Best Tech Stock to Buy For Long-Term Investment?",
                "url": "https://finance.yahoo.com/news/broadcom-inc-nasdaq-avgo-best-213007759.html"
            },
            {
                "headline": "We recently published a list of Top 12 Tech Stocks to Buy According to Billionaire Ken Fisher. In this article, we are going to take a look at where Broadcom Inc. (NASDAQ:AVGO) stands against other top tech stocks to buy according to billionaire Ken Fisher. Under the umbrella of Fisher Asset Management, Billionaire Ken Fisher […]",
                "publication_date": "2025-04-11T13:48:25.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.6249",
                "source": "Insider Monkey",
                "ticker": "AVGO",
                "title": "Is Broadcom Inc. (AVGO) the Top Tech Stock to Buy According to Billionaire Ken Fisher?",
                "url": "https://finance.yahoo.com/news/broadcom-inc-avgo-top-tech-134825738.html"
            },
            {
                "headline": "With the Nasdaq Composite in bear market territory (marked by the index falling more than 20% from its all-time high), there is some panic in the market.  Investors are worried about the effect of tariffs on the consumer and would rather be in more conservative investments than artificial intelligence (AI) stocks, which have more upside but with more risk.  Anyone selling right now has a one-year time frame in mind, rather than the three- to five-year time frame that individual investors should have.",
                "publication_date": "2025-04-11T11:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.6236",
                "source": "Motley Fool",
                "ticker": "AVGO",
                "title": "Nasdaq Bear Market: 3 No-Brainer Artificial Intelligence (AI) Stocks to Buy in April",
                "url": "https://finance.yahoo.com/news/nasdaq-bear-market-3-no-110000820.html"
            },
            {
                "headline": "The stock market sold off rapidly over the past few weeks, leading many to label this a stock market crash brought on by President Donald Trump's tariff announcements.  Stocks moved down sharply this week as reciprocal tariffs went into effect; they recovered quickly as Trump announced tariff relief on every country except China, but continued to mark additional losses on Thursday.  The tariffs might have some effect in the short term, but it's unlikely that they will still be the primary topic of discussion five years from now.",
                "publication_date": "2025-04-11T10:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5187",
                "source": "Motley Fool",
                "ticker": "AVGO",
                "title": "Stock Market Turmoil: Here Are My Top 10 Stocks to Buy Now",
                "url": "https://finance.yahoo.com/news/stock-market-turmoil-top-10-100000537.html"
            },
            {
                "headline": "Forced selling by Big Money makes shares of Broadcom, Inc. (AVGO) fall fast.",
                "publication_date": "2025-04-11T17:18:50.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.2023",
                "source": "FX Empire",
                "ticker": "AVGO",
                "title": "Big Money Selloff of Broadcom Could Be Long-Term Opportunity",
                "url": "https://finance.yahoo.com/news/big-money-selloff-broadcom-could-171850932.html"
            }
        ],
        "avgScore": 0.19662222222222217
    },
    "4 10 2025": {
        "importantArticles": [
            {
                "headline": "We recently published a list of Long-Term Stock Portfolio: 15 Best Stocks for 15 Years. In this article, we are going to take a look at where Broadcom Inc. (NASDAQ:AVGO) stands against other best stocks for 15 years. Russell Investments believes that 3 features are defining the market outlook for 2025. These include the elevated level […]",
                "publication_date": "2025-04-10T22:09:59.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8555",
                "source": "Insider Monkey",
                "ticker": "AVGO",
                "title": "Is Broadcom Inc. (AVGO) the Best Stock for 15 Years?",
                "url": "https://finance.yahoo.com/news/broadcom-inc-avgo-best-stock-220959835.html"
            },
            {
                "headline": "Key Insights Broadcom's estimated fair value is US$188 based on 2 Stage Free Cash Flow to Equity With US$185 share...",
                "publication_date": "2025-04-10T14:00:08.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7906",
                "source": "Simply Wall St.",
                "ticker": "AVGO",
                "title": "A Look At The Fair Value Of Broadcom Inc. (NASDAQ:AVGO)",
                "url": "https://finance.yahoo.com/news/look-fair-value-broadcom-inc-140008486.html"
            },
            {
                "headline": "Five AI infrastructure stocks have strong short-term and long-term revenue and earnings growth potential. These are: NVDA, AVGO, MRVL, JBL, SMCI.",
                "publication_date": "2025-04-10T11:57:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7096",
                "source": "Zacks",
                "ticker": "AVGO",
                "title": "5 AI Bigwigs to Buy at Attractive Valuations Amid Extreme Volatility",
                "url": "https://finance.yahoo.com/news/5-ai-bigwigs-buy-attractive-115700612.html"
            },
            {
                "headline": "Shares of the semiconductor company Broadcom (NASDAQ: AVGO) were falling hard today as the broader market turned red once again.  Investors are still trying to figure out what to do amid President Donald Trump's chaotic rollout, and subsequent rollback, of some import tariffs.  Semiconductor stocks, including Broadcom's, are also likely reeling as investors process the news that China and the U.S. are in a full-blown trade war.",
                "publication_date": "2025-04-10T15:57:19.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.7845",
                "source": "Motley Fool",
                "ticker": "AVGO",
                "title": "Why Broadcom Stock Is Plummeting Today",
                "url": "https://finance.yahoo.com/news/why-broadcom-stock-plummeting-today-155719580.html"
            },
            {
                "headline": "Broadcom, Nvidia, and peers slump as renewed trade fears raise uncertainty over supply chains and earnings guidance",
                "publication_date": "2025-04-10T18:00:58.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.6369",
                "source": "GuruFocus.com",
                "ticker": "AVGO",
                "title": "Chip Stocks Reverse Rally as Trade Fears Resurface",
                "url": "https://finance.yahoo.com/news/chip-stocks-reverse-rally-trade-180058307.html"
            },
            {
                "headline": "We recently published a list of Jim Cramer Says Tariff Pain Isn’t Over Yet And Reviews These 9 Stocks. In this article, we are going to take a look at where Broadcom Inc. (NASDAQ:AVGO) stands against other stocks that Jim Cramer discusses. In his latest appearance on CNBC’s Squawk on the Street, Jim Cramer dissected the […]",
                "publication_date": "2025-04-10T12:41:13.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5106",
                "source": "Insider Monkey",
                "ticker": "AVGO",
                "title": "Broadcom Inc. (AVGO): Jim Cramer Sees a Hidden Bargain Behind the Sell-Off",
                "url": "https://finance.yahoo.com/news/broadcom-inc-avgo-jim-cramer-124113832.html"
            }
        ],
        "avgScore": 0.08796363636363638
    },
    "4 9 2025": {
        "importantArticles": [
            {
                "headline": "We recently published a list of the 10 High Growth Dividend Paying Stocks to Invest in. In this article, we are going to take a look at where Broadcom Inc. (NASDAQ:AVGO) stands against other profitable dividend stocks. Amid growing concerns about economic growth and President Trump’s tariffs, investors have been seeking safer investment options. In […]",
                "publication_date": "2025-04-09T20:19:55.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.891",
                "source": "Insider Monkey",
                "ticker": "AVGO",
                "title": "Broadcom Inc. (AVGO): One of the High Growth Dividend Paying Stocks to Invest in",
                "url": "https://finance.yahoo.com/news/broadcom-inc-avgo-one-high-201955948.html"
            },
            {
                "headline": "Like the rest of the stock market, Broadcom (NASDAQ: AVGO) was hit hard by the stock market sell-off.  The two-day crash that followed President Donald Trump's tariffs announcement pushed Broadcom stock down 15%.  CEO Hock Tan said the repurchase move showed the board's \"confidence in the strength of Broadcom's diversified semiconductor and infrastructure software product franchises,\" adding, \"We are uniquely positioned in mission critical infrastructure software and enabling hyperscalers to drive innovation in generative AI.\"",
                "publication_date": "2025-04-09T13:40:46.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7351",
                "source": "Motley Fool",
                "ticker": "AVGO",
                "title": "This AI Stock Just Flashed a Big Buy Signal",
                "url": "https://finance.yahoo.com/news/ai-stock-just-flashed-big-134046725.html"
            },
            {
                "headline": "Broadcom (NASDAQ: AVGO) stock posted explosive gains in Wednesday's trading amid a dramatic recovery for the broader market.  Meanwhile, the S&P 500 (SNPINDEX: ^GSPC) and the Nasdaq Composite (NASDAQINDEX: ^IXIC) ended the day's trading with gains of 9.5% and 12.1%, respectively.  Stocks surged today after President Trump announced a 90-day pause on reciprocal tariffs.",
                "publication_date": "2025-04-09T20:32:59.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7351",
                "source": "Motley Fool",
                "ticker": "AVGO",
                "title": "Why Broadcom Stock Is Skyrocketing Today",
                "url": "https://finance.yahoo.com/news/why-broadcom-stock-skyrocketing-today-203259133.html"
            },
            {
                "headline": "President Trump's announcement of tariffs on imports from countries worldwide has rocked the stock market -- and the tech-heavy Nasdaq Composite (NASDAQINDEX: ^IXIC) has led the decline, crashing more than 20% from its most recent high.  Why are tech stocks being hit so hard?  All this has prompted investors to worry about tech earnings ahead, fleeing shares of these companies.",
                "publication_date": "2025-04-09T22:10:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.3749",
                "source": "Motley Fool",
                "ticker": "AVGO",
                "title": "The Stock Market Has Crashed: My Top 5 Dirt Cheap Tech Stocks to Buy Now",
                "url": "https://finance.yahoo.com/news/stock-market-crashed-top-5-221000917.html"
            },
            {
                "headline": "Added to the Zacks Rank #1 (Strong Buy) list on Wednesday, Broadcom's (AVGO) stock is standing out as markets ripped higher on news that President Trump will temporarily rescind reciprocal tariffs on many countries outside of China.",
                "publication_date": "2025-04-09T23:10:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Zacks",
                "ticker": "AVGO",
                "title": "Time to Buy Broadcom (AVGO) Stock as Markets Rip Higher",
                "url": "https://finance.yahoo.com/news/time-buy-broadcom-avgo-stock-231000418.html"
            },
            {
                "headline": "Apple, NVIDIA and Broadcom are included in this Analyst Blog.",
                "publication_date": "2025-04-09T10:38:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Zacks",
                "ticker": "AVGO",
                "title": "The Zacks Analyst Blog Highlights Apple, NVIDIA and Broadcom",
                "url": "https://finance.yahoo.com/news/zacks-analyst-blog-highlights-apple-103800973.html"
            }
        ],
        "avgScore": 0.37200909090909096
    },
    "4 8 2025": {
        "importantArticles": [
            {
                "headline": "Madison Mills and Brad Smith take a closer look at some of today's trending tickers ahead of the opening bell. Nvidia (NVDA) stock extends gains, leading the \"Magnificent Seven\" group higher. The chipmaker stock was the top performer of the Dow Jones Industrial Average (^DJI) on Monday. Broadcom (AVGO) stock rallies after the company authorized $10 billion in share buybacks, reiterating confidence in the semiconductor industry. To watch more expert insights and analysis on the latest market action, check out more Morning Brief here.",
                "publication_date": "2025-04-08T13:54:03.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9201",
                "source": "Yahoo Finance Video",
                "ticker": "AVGO",
                "title": "Nvidia leads Mag 7, Broadcom's share buyback: Trending Tickers",
                "url": "https://finance.yahoo.com/video/nvidia-leads-mag-7-broadcoms-135403987.html"
            },
            {
                "headline": "We recently published a list of 10 Best Fundamental Stocks to Buy According to Billionaires. In this article, we are going to take a look at where Broadcom Inc. (NASDAQ:AVGO) stands against other best fundamental stocks to buy according to billionaires. As per Fitch Ratings, the US tariffs are now at levels that continue to […]",
                "publication_date": "2025-04-08T02:33:08.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8555",
                "source": "Insider Monkey",
                "ticker": "AVGO",
                "title": "Is Broadcom Inc. (AVGO) the Best Fundamental Stock to Buy According to Billionaires?",
                "url": "https://finance.yahoo.com/news/broadcom-inc-avgo-best-fundamental-023308275.html"
            },
            {
                "headline": "As part of today's Market Minute, Madison Mills takes a look at some of the top stories on Wall Street. Walgreens (WBA) quarterly earnings came in better than expected. Sycamore Partners is set to take the company private later this year. Broadcom (AVGO) stock gains after the chipmaker announced a $10 billion share buyback program. CVS (CVS) stock pops after the company named a new CFO, saying it will meet or exceed its current full-year guidance. Stay up to date on the latest market action, minute-by-minute, with Yahoo Finance's Market Minute.",
                "publication_date": "2025-04-08T15:17:45.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8074",
                "source": "Yahoo Finance Video",
                "ticker": "AVGO",
                "title": "Walgreens, Broadcom, CVS: Market Minute",
                "url": "https://finance.yahoo.com/video/walgreens-broadcom-cvs-market-minute-151745426.html"
            },
            {
                "headline": "Technology stocks have taken a big beating in recent months as the Trump administration's policies have led investors to press the panic button amid concerns that the tariff-fueled global trade war could hurt the U.S. economy and may even send it into a recession.  Investors have become risk-averse, which explains why high-flying tech stocks that were benefiting big time from the rapid adoption of cloud computing and artificial intelligence (AI) have pulled back substantially.  The tech-heavy Nasdaq Composite index, which hit its most recent high on Dec. 16 last year, has shed nearly 23% of its value since then and now trades in bear territory.",
                "publication_date": "2025-04-08T09:05:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.8979",
                "source": "Motley Fool",
                "ticker": "AVGO",
                "title": "Nasdaq Sell-Off: 2 Solid Artificial Intelligence (AI) Stocks to Buy Hand Over Fist Before They Soar 70% to 85%, According to Wall Street",
                "url": "https://finance.yahoo.com/news/nasdaq-sell-off-2-solid-090500504.html"
            },
            {
                "headline": "Astera Labs' lower-than-expected gross margin can be attributed to a shift in product mix toward hardware-based solutions, which impacted investors' sentiment.",
                "publication_date": "2025-04-08T19:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.34",
                "source": "Zacks",
                "ticker": "AVGO",
                "title": "ALAB Slides 47% Since Q4 Results: A Risky Bet Amid Chip Stock Slump?",
                "url": "https://finance.yahoo.com/news/alab-slides-47-since-q4-190000519.html"
            },
            {
                "headline": "The latest investor updates on stocks that are trending on Tuesday.",
                "publication_date": "2025-04-08T09:48:09.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Yahoo Finance UK",
                "ticker": "AVGO",
                "title": "Trending tickers: Tesla, US Steel, Broadcom, Levi's and Porsche",
                "url": "https://finance.yahoo.com/news/tesla-united-states-steel-broadcom-levis-porsche-trending-tickers-094809037.html"
            }
        ],
        "avgScore": 0.3496846153846155
    },
    "coef": -0.09999999999999999,
    "avgCoef": 0.1893352213018503
}