{
    "4 24 2025": {
        "importantArticles": [
            {
                "headline": "Whitaker served as the head of the FAA, the U.S. agency in charge of air safety, efficiency, and the air traffic system, from October 2023 to January this year, during which he oversaw the agency's response to significant safety issues at Boeing.  IndiGo, the world's second-largest airline by market capitalisation, has been tapping India's growing outbound travel market to drive growth as capacity constraints hinder domestic growth.  The appointment comes as IndiGo has been expanding internationally, while also trying to attract more affluent passengers in a departure from its low-cost model focus.",
                "publication_date": "2025-04-24T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.946",
                "source": "Reuters",
                "ticker": "BA",
                "title": "India's IndiGo appoints former FAA chief Whitaker as independent director",
                "url": "https://finance.yahoo.com/news/indias-indigo-appoints-former-faa-092432503.html"
            },
            {
                "headline": "WASHINGTON (Reuters) -Orders for long-lasting U.S. manufactured goods surged in March on strong demand for commercial aircraft, but activity elsewhere was muted, likely as businesses exercised caution against the backdrop of a darkening economic outlook caused by tariffs.  Orders for durable goods, items ranging from toasters to aircraft meant to last three years or more, jumped 9.2% last month after slightly downwardly revised 0.9% gain in February, the Commerce Department's Census Bureau said on Thursday.  Economists polled by Reuters had forecast durable goods orders advancing 2.0% after a previously reported 1.0% gain in February.",
                "publication_date": "2025-04-24T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9022",
                "source": "Reuters",
                "ticker": "BA",
                "title": "US durable goods orders soar on aircraft bookings in March",
                "url": "https://finance.yahoo.com/news/us-durable-goods-orders-soar-130357626.html"
            },
            {
                "headline": "Shares of aerospace and defense company Boeing (NYSE:BA) jumped 7.2% in the morning session after the company reported impressive first-quarter 2025 results, which significantly blew past analysts' EBITDA and EPS expectations, signaling improved profitability.",
                "publication_date": "2025-04-24T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8807",
                "source": "StockStory",
                "ticker": "BA",
                "title": "Why Is Boeing (BA) Stock Soaring Today",
                "url": "https://finance.yahoo.com/news/why-boeing-ba-stock-soaring-174402492.html"
            },
            {
                "headline": "The airplane maker reported a narrower first-quarter loss as CEO Kelly Ortberg said the company’s higher backlog has provided some flexibility amid the trade war.",
                "publication_date": "2025-04-24T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5859",
                "source": "The Wall Street Journal",
                "ticker": "BA",
                "title": "Boeing Leans on Backlog, Looks for Alternatives to China Trade",
                "url": "https://finance.yahoo.com/m/9d838acc-dae2-3d96-95cb-fe953620204a/boeing-leans-on-backlog-.html"
            },
            {
                "headline": "The company is successfully ramping back up production, but is dealing with fallout from the U.S.’s trade war as China customers refuse to accept deliveries.",
                "publication_date": "2025-04-24T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5647",
                "source": "Manufacturing Dive",
                "ticker": "BA",
                "title": "Boeing revenue jumps in Q1 to $19.5B, as tariff impacts loom",
                "url": "https://finance.yahoo.com/news/boeing-revenue-jumps-q1-19-112000654.html"
            },
            {
                "headline": "SEOUL/PARIS (Reuters) -Boeing is looking to resell potentially dozens of planes locked out of China by tariffs after repatriating a third jet to the United States in a delivery standoff that drew new criticism of Beijing from U.S. President Donald Trump on Thursday.  The move to prevent a repeat of the costly build-up of undelivered jets seen during past safety and trade crises comes as the planemaker seeks to prevent tensions undercutting its efforts to save cash and pay down debts.  Boeing took the rare step of publicly flagging the potential aircraft sale during an analyst call on Wednesday, saying there would be no shortage of buyers in a tight jet market.",
                "publication_date": "2025-04-24T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.1531",
                "source": "Reuters",
                "ticker": "BA",
                "title": "Boeing poised to resell jets as tariffs hit China trade",
                "url": "https://finance.yahoo.com/news/chinese-customers-rejecting-jets-due-025618567.html"
            }
        ],
        "avgScore": 0.29966538461538456,
        "pctChange": 0.024503547891341376
    },
    "4 23 2025": {
        "importantArticles": [
            {
                "headline": "Boeing (NYSE: BA) stock rose by as much as 8.7% in trading before 10 a.m. today.  On the other hand, its well-regarded CEO, Kelly Ortberg, has a huge opportunity to engineer a turnaround at the company simply by executing well.  As such, Boeing is almost a \"self-help\" story, and the good news from this earnings report is that the company seems to be starting to help itself.",
                "publication_date": "2025-04-23T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9325",
                "source": "Motley Fool",
                "ticker": "BA",
                "title": "Here's Why Boeing Stock Rocketed Higher Today",
                "url": "https://finance.yahoo.com/news/heres-why-boeing-stock-rocketed-161500694.html"
            },
            {
                "headline": "We recently published a list of Goldman Sachs Defense Stocks: Top 12 Stock Picks. In this article, we will take a look at where The Boeing Company (NYSE:BA) stands against other top defense stock picks from the Goldman Sachs Portfolio. After a subdued start to the year, American defense stocks are beginning to see improved […]",
                "publication_date": "2025-04-23T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.802",
                "source": "Insider Monkey",
                "ticker": "BA",
                "title": "The Boeing Company (BA): One of the Top Defense Stock Picks from the Goldman Sachs Portfolio",
                "url": "https://finance.yahoo.com/news/boeing-company-ba-one-top-225011452.html"
            },
            {
                "headline": "Despite a dip in commercial aerospace sales, Hexcel Corp (HXL) leverages defense sector growth and strategic contracts to maintain a strong market position.",
                "publication_date": "2025-04-23T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7506",
                "source": "GuruFocus.com",
                "ticker": "BA",
                "title": "Hexcel Corp (HXL) Q1 2025 Earnings Call Highlights: Navigating Challenges with Strategic ...",
                "url": "https://finance.yahoo.com/news/hexcel-corp-hxl-q1-2025-070558027.html"
            },
            {
                "headline": "The “cloudiness of forecasts” for Boeing (BA) is likely to keep weighing on BA stock going forward, said Dave Mazza, the CEO of Roundhill Investments, on the Schwab Network recently. Specifically, the uncertainty of the outcome of trade battle between the U.S. and China, along with worries about the economy and doubts about the firm’s […]",
                "publication_date": "2025-04-23T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.8402",
                "source": "Insider Monkey",
                "ticker": "BA",
                "title": "Uncertain Outlook Likely to Keep Weighing on Boeing (BA), Investor Says",
                "url": "https://finance.yahoo.com/news/uncertain-outlook-likely-keep-weighing-164041753.html"
            },
            {
                "headline": "U.S. stock indexes rallied at midday Wednesday as President Donald Trump said he has \"no intention\" of firing Federal Reserve Chair Jerome Powell and made further comments suggesting a de-escalation of the trade war with China.",
                "publication_date": "2025-04-23T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.8176",
                "source": "Investopedia",
                "ticker": "BA",
                "title": "Top Stock Movers Now: Tesla, Boeing, Enphase, and More",
                "url": "https://finance.yahoo.com/news/top-stock-movers-now-tesla-161308735.html"
            },
            {
                "headline": "This was the quarter  Boeing  was waiting for.  Then came President Trump’s trade war.  Instead, Chief Executive  Kelly Ortberg  spent much of the morning Wednesday talking about a pair of Boeing jets returned by China and issuing reassurances that tariff wars won’t derail the company’s turnaround.",
                "publication_date": "2025-04-23T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.8074",
                "source": "The Wall Street Journal",
                "ticker": "BA",
                "title": "Boeing Will Stop Making Jets for China if Airlines Won’t Accept Planes, CEO Says",
                "url": "https://finance.yahoo.com/m/ca199f1c-d3aa-33c0-beac-7cb9c697b8bd/boeing-will-stop-making-jets.html"
            }
        ],
        "avgScore": 0.01581562500000001,
        "pctChange": 0.01754951117343163
    },
    "4 22 2025": {
        "importantArticles": [
            {
                "headline": "Boeing announced it will sell assets to Thoma Bravo for nearly $11 billion in cash. Nomura agreed to buy an asset management business in its most significant overseas acquisition since Lehman Brothers in 2008, while Barrick exits a mining business, in part to John Paulson. Does this signal more dealmaking? Bloomberg's Liana Baker joined Wall Street Beat on Open Interest with some insight.",
                "publication_date": "2025-04-22T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8553",
                "source": "Bloomberg",
                "ticker": "BA",
                "title": "Takeover Tuesday Takes Shape from Boeing to Barrick",
                "url": "https://finance.yahoo.com/video/takeover-tuesday-takes-shape-boeing-151230454.html"
            },
            {
                "headline": "Boeing [NYSE: BA] has entered into a definitive agreement to sell portions of its Digital Aviation Solutions business, including its Jeppesen, ForeFlight, AerData and OzRunways assets, to Thoma Bravo, a leading software investment firm. This all-cash transaction is valued at $10.55 billion.",
                "publication_date": "2025-04-22T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8176",
                "source": "PR Newswire",
                "ticker": "BA",
                "title": "Boeing to Sell Portions of Digital Aviation Solutions to Thoma Bravo for $10.55 Billion",
                "url": "https://finance.yahoo.com/news/boeing-sell-portions-digital-aviation-130000935.html"
            },
            {
                "headline": "Boosted by explosive growth and strong demand, Boeing and Lockheed supplier Loar stock navigates turbulent market.",
                "publication_date": "2025-04-22T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7845",
                "source": "Investor's Business Daily",
                "ticker": "BA",
                "title": "Boeing, Lockheed Partner Targets Breakout — And 1,441% Growth",
                "url": "https://finance.yahoo.com/m/e00505c7-7e8b-366a-91e9-5f051c44ed11/boeing-lockheed-partner.html"
            },
            {
                "headline": "We recently published a list of Billionaire Rob Citrone’s Top 10 Stock Picks. In this article, we are going to take a look at where The Boeing Company (NYSE:BA) stands against other billionaire Rob Citrone’s top stock picks. Robert K. Citrone is a well-known figure in the financial world. Rob, as many call him, is […]",
                "publication_date": "2025-04-22T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.8481",
                "source": "Insider Monkey",
                "ticker": "BA",
                "title": "The Boeing Company (BA): Among Billionaire Rob Citrone’s Top Stock Picks",
                "url": "https://finance.yahoo.com/news/boeing-company-ba-among-billionaire-171059137.html"
            },
            {
                "headline": "China warns countries looking for a U.S. trade deal, gold glitters as dollar weakens, more news to start your day.",
                "publication_date": "2025-04-22T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.4019",
                "source": "Barrons.com",
                "ticker": "BA",
                "title": "Trump’s Powell Attack Put Stock Markets on Fed Alert. There’s Plenty More to Worry About and 5 Other Things to Know Today.",
                "url": "https://finance.yahoo.com/m/38744282-cfac-3f7c-91e9-722565279674/trump%E2%80%99s-powell-attack-put.html"
            },
            {
                "headline": "The sale to private equity firm Thoma Bravo comes as the aircraft maker strains to shore up its finances.",
                "publication_date": "2025-04-22T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.296",
                "source": "Manufacturing Dive",
                "ticker": "BA",
                "title": "Boeing to sell some digital businesses for $10.55B",
                "url": "https://finance.yahoo.com/news/boeing-sell-digital-businesses-10-124300076.html"
            }
        ],
        "avgScore": 0.2877272727272727,
        "pctChange": 0.06060786725191864
    },
    "4 21 2025": {
        "importantArticles": [
            {
                "headline": "All three major US stock indexes were down past 2.5% in late-morning trading Monday after President",
                "publication_date": "2025-04-21T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "MT Newswires",
                "ticker": "BA",
                "title": "Top Midday Stories: Capital One's Discover Acquisition Clears Regulatory Hurdles; Boeing Averts 737 Max Slowdown",
                "url": "https://finance.yahoo.com/news/top-midday-stories-capital-one-160821357.html"
            },
            {
                "headline": "Boeing (BA) has been contacted by Malaysia Aviation Group about potentially speeding up the acquisit",
                "publication_date": "2025-04-21T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "MT Newswires",
                "ticker": "BA",
                "title": "Market Chatter: Boeing in Talks With Malaysia Airlines to Take Over Aircraft Delivery Slots",
                "url": "https://finance.yahoo.com/news/market-chatter-boeing-talks-malaysia-115014811.html"
            },
            {
                "headline": "A second Boeing (BA) aircraft planned for use by China's Xiamen Airlines was heading back to the US",
                "publication_date": "2025-04-21T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "MT Newswires",
                "ticker": "BA",
                "title": "Market Chatter: Second Boeing Aircraft Begins Return From China",
                "url": "https://finance.yahoo.com/news/market-chatter-second-boeing-aircraft-101658203.html"
            },
            {
                "headline": "SEOUL (Reuters) -A second Boeing jet intended for use by a Chinese airline was heading back to the U.S. on Monday, flight tracking data showed, in what appeared to be another victim of the tit-for-tat bilateral tariffs launched by President Donald Trump in his global trade offensive.  The 737 MAX 8 landed in the U.S. territory of Guam on Monday, after leaving Boeing's Zhoushan completion center near Shanghai, data from flight tracking website AirNav Radar showed.  Guam is one of the stops such flights make on the 5,000-mile (8,000-km) journey across the Pacific between Boeing's U.S. production hub in Seattle and the Zhoushan completion center, where planes are ferried by Boeing for final work and delivery to a Chinese carrier.",
                "publication_date": "2025-04-21T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.6369",
                "source": "Reuters",
                "ticker": "BA",
                "title": "Second Boeing jet starts return from China, tracker shows",
                "url": "https://finance.yahoo.com/news/second-boeing-jet-starts-return-024910508.html"
            },
            {
                "headline": "A Boeing 737 Max that was getting readied for a Chinese airline has reportedly returned to Seattle due to the ongoing tariff war between China and the U.S.",
                "publication_date": "2025-04-21T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5994",
                "source": "Fox Business",
                "ticker": "BA",
                "title": "China begins returning Boeing aircraft to US",
                "url": "https://finance.yahoo.com/news/china-begins-returning-boeing-aircraft-171939224.html"
            },
            {
                "headline": "A Boeing jet intended for use by a Chinese airline landed back at the planemaker’s U.S. production hub on Sunday, a victim of the tit-for-tat bilateral tariffs launched by President Donald Trump in his global trade offensive.",
                "publication_date": "2025-04-21T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5574",
                "source": "CNN Business",
                "ticker": "BA",
                "title": "Boeing jet returns to US from China, a victim of Trump’s tariff war",
                "url": "https://finance.yahoo.com/news/boeing-jet-returns-us-china-142140437.html"
            }
        ],
        "avgScore": -0.27859,
        "pctChange": 0.019957374216495544
    },
    "4 17 2025": {
        "importantArticles": [
            {
                "headline": "Analysts see Bitcoin poised for a breakout despite trade war shocks. If key resistance holds, $92K is in sight.",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7453",
                "source": "TheStreet",
                "ticker": "BA",
                "title": "Analyst calls Trump's 245% tariff 'extreme' as Nvidia, Boeing take major hits",
                "url": "https://finance.yahoo.com/news/analyst-calls-trumps-245-tariff-165621624.html"
            },
            {
                "headline": "After China reportedly decided that it would no longer accept deliveries of Boeing’s (BA) planes, prominent investor Stephanie Link yesterday said that the news was “clearly not material for Boeing at this time.” Link, who owns BA stock and has called the name her top pick for 2025, is the Chief Investment Strategist of Hightower […]",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.5423",
                "source": "Insider Monkey",
                "ticker": "BA",
                "title": "Well-Known Investor Says China News “Not Material” for Boeing (BA)",
                "url": "https://finance.yahoo.com/news/well-known-investor-says-china-172647797.html"
            },
            {
                "headline": "United Airlines doesn’t expect tariffs to have a significant impact on what it pays for planes, Chief Executive Scott Kirby said.  Most of the aircraft deliveries United is waiting on will come from Boeing, and most of its new Airbus planes are being built in Alabama, though the network of suppliers that the plane makers rely on is spread throughout the world.  Rival Delta Air Lines said last week it won’t pay tariffs on any new Airbus planes coming its way and would defer any deliveries affected by new levies.",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.4939",
                "source": "The Wall Street Journal",
                "ticker": "BA",
                "title": "United Airlines Says It's Unfazed by Tariffs’ Potential Impact",
                "url": "https://finance.yahoo.com/m/4c7ae5d6-b1f7-377a-9d88-94f32c7b9393/united-airlines-says-it-s.html"
            },
            {
                "headline": "The major averages were broadly lower near noon, with the Nasdaq down over 300 points amid escalating trade tensions and new export restrictions.​ This follows the U.S. government’s decision to tighten export controls on advanced AI-related computer chips.​ The recent U.S. actions have intensified concerns over a potential trade war. President Donald Trump has announced a new investigation into critical mineral imports and imposed steep tariffs on Chinese imports. In retaliation, China has incre",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.8555",
                "source": "TipRanks",
                "ticker": "BA",
                "title": "Nvidia, AMD see charges due to new China export rules: Morning Buzz",
                "url": "https://finance.yahoo.com/news/nvidia-amd-see-charges-due-160543145.html"
            },
            {
                "headline": "Boeing already was suffering in its competition with Airbus before Trump started his tariff war. That won't make things any easier for America's top export company.",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5267",
                "source": "LA Times",
                "ticker": "BA",
                "title": "Hiltzik: Trump fired a tariff torpedo at China — and hit Boeing right between the eyes",
                "url": "https://finance.yahoo.com/news/hiltzik-trump-fired-tariff-torpedo-100016766.html"
            },
            {
                "headline": "(Reuters) -A Boeing jet earmarked for China was returning to the United States on Friday, flight tracking data showed, as the planemaker's flagship delivery plant outside Shanghai was drawn into a deepening tariff war between Beijing and Washington.  The return of one of several jets waiting for final work and handover to a Chinese carrier at the completion centre in Zhoushan is the latest sign of disruption to deliveries from a breakdown in the industry's decades-old duty-free status.  In a sign that Boeing was preparing for normal business just weeks before U.S. President Donald Trump announced tariffs on April 2, three new 737 MAX planes had flown from Boeing in Seattle to Zhoushan in March.",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.4939",
                "source": "Reuters",
                "ticker": "BA",
                "title": "Boeing jet returns to US from China amid tariff war",
                "url": "https://finance.yahoo.com/news/boeing-delivery-plant-china-latest-154648995.html"
            }
        ],
        "avgScore": 0.025924999999999948,
        "pctChange": -0.015812215287855796
    },
    "4 16 2025": {
        "importantArticles": [
            {
                "headline": "Northrop Grumman is better than Boeing at building stealth aircraft. Might Northrop Grumman stock be better than Boeing, too?",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.6705",
                "source": "Motley Fool",
                "ticker": "BA",
                "title": "If Boeing Drops the Ball on the F-47, This Giant Defense Stock Should Take the Contract",
                "url": "https://finance.yahoo.com/news/boeing-drops-ball-f-47-012000875.html"
            },
            {
                "headline": "The major averages were fractionally higher near noon, adding slightly to yesterday’s gains as investors reacted to fresh headlines on U.S.-China trade tensions and a new round of corporate earnings. Markets are attempting to stabilize after a rocky stretch, but much of the tone is being shaped by President Trump’s latest tariff decisions. After last week’s escalation, he’s now backing off slightly, offering temporary relief on key consumer electronics and signaling possible concessions for the",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.6454",
                "source": "TipRanks",
                "ticker": "BA",
                "title": "Big banks report Q1 beats, China stops taking Boeing deliveries: Morning Buzz",
                "url": "https://finance.yahoo.com/news/big-banks-report-q1-beats-155936913.html"
            },
            {
                "headline": "Catch up on the top industries and stocks that were impacted, or were predicted to be impacted, by the comments, actions and policies of President Donald Trump with this daily recap compiled by The Fly: POTENTIAL TARIFF DELAY: Shares of car manufacturers Ford (F), General Motors (GM) and Stellantis (STLA) were Trump told reporters that his administration is “looking at something to help car companies” as they slowly move manufacturing to the U.S. President Donald Trump told reporters in the Oval",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.3954",
                "source": "TipRanks",
                "ticker": "BA",
                "title": "Trump Trade: Carmakers may see tariff relief, China halts Boeing deliveries",
                "url": "https://finance.yahoo.com/news/trump-trade-carmakers-may-see-140439617.html"
            },
            {
                "headline": "Boeing  stock fell after China ordered its airlines to halt deliveries of the company’s jets as part of an escalating trade war with the U.S., according to a report.  Chinese airlines have been told not to accept any more Boeing deliveries and asked that carriers not buy any further aircraft-related gear from U.S. companies, Bloomberg reported, citing people familiar with the matter.  Boeing didn’t respond to a request for comment.",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.717",
                "source": "Barrons.com",
                "ticker": "BA",
                "title": "Boeing Stock Is Falling. China Suspends Jet Deliveries, Report Says",
                "url": "https://finance.yahoo.com/m/068e818e-1a27-35dc-9250-d4d3243ee22e/boeing-stock-is-falling-.html"
            },
            {
                "headline": "(Bloomberg) -- Stocks whipsawed as President Donald Trump’s fast-evolving tariff war with top trade partners showed little signs of abating, leaving investors unwilling to take on too much risk after a two-day rally.Most Read from BloombergHow Did This Suburb Figure Out Mass Transit?Trump Signs Executive Orders on Federal Purchasing, Office SpaceEven Oslo Has an Air Quality ProblemLA County Floats Leaner Budget Burdened by Fire and Legal Costs$15 Million Fund Bets Leadership Training Can Improve",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.7096",
                "source": "Bloomberg",
                "ticker": "BA",
                "title": "Stocks Halt Rally Amid Lingering Trade-War Risks: Markets Wrap",
                "url": "https://finance.yahoo.com/news/stocks-rise-led-japan-auto-040211765.html"
            },
            {
                "headline": "BofA analyst Ronald Epstein notes Bloomberg’s report that China halted delivery of all Boeing (BA) jets and asked Chinese carriers to halt any purchases of aircraft-related equipment and parts from U.S. companies as part of the escalating trade war between the countries. Boeing is the largest U.S. exporter, so the firm is not surprised by China’s move, though it sees this situation as “unsustainable” given the firm’s view that Airbus (EADSY) can’t realistically be China’s only supplier of large",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.6774",
                "source": "TipRanks",
                "ticker": "BA",
                "title": "Boeing should be able to reallocate aircraft meant for China, says BofA",
                "url": "https://finance.yahoo.com/news/boeing-able-reallocate-aircraft-meant-144035151.html"
            }
        ],
        "avgScore": -0.08825,
        "pctChange": 0.03470309090189224
    },
    "4 15 2025": {
        "importantArticles": [
            {
                "headline": "(Bloomberg) -- Executives at the world’s biggest trade fair in China found themselves staring into the abyss as the seams of global commerce come apart.Most Read from BloombergHow Did This Suburb Figure Out Mass Transit?Even Oslo Has an Air Quality ProblemNYC Tourist Helicopter Crashes in Hudson River, Killing SixLisbon Mayor Wants Companies to Help Fix City’s Housing Shortage$15 Million Fund Bets Leadership Training Can Improve Chicago PolicingFor many visitors to the Canton Fair, held in the s",
                "publication_date": "2025-04-15T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.5859",
                "source": "Bloomberg",
                "ticker": "BA",
                "title": "Ground Zero of China Trade Boom Reckons With Decoupling From US",
                "url": "https://finance.yahoo.com/news/ground-zero-china-trade-boom-120000112.html"
            },
            {
                "headline": "Shares of Boeing — which considers China one of its biggest growth markets and where rival Airbus holds a dominant position — were down 0.5% in midday trading.  Confusion over changing tariffs could leave aircraft deliveries in limbo, with some airline CEOs saying they would defer delivery of planes rather than pay duties.  China's top three airlines - Air China, China Eastern Airlines and China Southern Airlines - had planned to take delivery of 45, 53 and 81 Boeing planes respectively between 2025 and 2027.",
                "publication_date": "2025-04-15T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.4588",
                "source": "Reuters",
                "ticker": "BA",
                "title": "China orders airlines to suspend Boeing jet deliveries amid trade war, Bloomberg News reports",
                "url": "https://finance.yahoo.com/news/china-orders-halts-boeing-jet-081741631.html"
            },
            {
                "headline": "China has barred its country’s airlines from accepting deliveries from Boeing in retaliation against Donald Trump’s tariffs.",
                "publication_date": "2025-04-15T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.3818",
                "source": "The Telegraph",
                "ticker": "BA",
                "title": "China blocks Boeing deliveries in retaliation to Trump tariffs",
                "url": "https://finance.yahoo.com/news/china-blocks-boeing-deliveries-retaliation-101109491.html"
            },
            {
                "headline": "(Bloomberg) -- Investor sentiment regarding economic prospects is the most negative in three decades, yet fund managers’ pessimism isn’t fully reflected in their asset allocation which could mean more losses for US stocks, a Bank of America Corp. survey shows.Most Read from BloombergHow Did This Suburb Figure Out Mass Transit?Even Oslo Has an Air Quality ProblemNYC Tourist Helicopter Crashes in Hudson River, Killing SixLisbon Mayor Wants Companies to Help Fix City’s Housing Shortage$15 Million F",
                "publication_date": "2025-04-15T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.8169",
                "source": "Bloomberg",
                "ticker": "BA",
                "title": "Investors Haven’t Been This Bearish in 30 Years, BofA Poll Shows",
                "url": "https://finance.yahoo.com/news/investors-haven-t-bearish-30-091717258.html"
            },
            {
                "headline": "China could score a short-term victory by hitting Boeing, America’s embattled plane maker, but it may also have a lot to lose.  Boeing shares dropped around 2% Tuesday morning following reports that Chinese state airlines will stop taking deliveries of its jets and buying its parts in retaliation for Donald Trump’s tariff war.  Boeing is bleeding money as it attempts to increase production and leave behind an era of quality control fiascoes.",
                "publication_date": "2025-04-15T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.8047",
                "source": "The Wall Street Journal",
                "ticker": "BA",
                "title": "China Can Hurt Boeing, but the U.S. Can Win an Aerospace Trade War—Heard on the Street",
                "url": "https://finance.yahoo.com/m/1bc46302-6514-357b-9027-07edcd511153/china-can-hurt-boeing-but.html"
            },
            {
                "headline": "Brad Smith and Madison Mills outline some of today's trending tickers. China reportedly is halting Boeing (BA) deliveries from the US amid the US–China trade war, according to reports from Bloomberg. LVMH (MC.PA) stock is falling after the luxury retail company's first quarter sales missed estimates amid concerns about demand in the US and China. Netflix (NFLX) reportedly plans to double its revenue and grow its market capitalization to $1 trillion by 2030. To watch more expert insights and analysis on the latest market action, check out more Morning Brief here.",
                "publication_date": "2025-04-15T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.802",
                "source": "Yahoo Finance Video",
                "ticker": "BA",
                "title": "Boeing in China, LVMH, Netflix's climb to $1T: Trending Tickers",
                "url": "https://finance.yahoo.com/video/boeing-china-lvmh-netflixs-climb-143039546.html"
            }
        ],
        "avgScore": -0.2298761904761905,
        "pctChange": 0.006108519303908034
    },
    "4 14 2025": {
        "importantArticles": [
            {
                "headline": "The stocks in this article have caught Wall Street’s attention in a big way, with price targets implying returns above 20%. But investors should take these forecasts with a grain of salt because analysts typically say nice things about companies so their firms can win business in other product lines like M&A advisory.",
                "publication_date": "2025-04-14T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9209",
                "source": "StockStory",
                "ticker": "BA",
                "title": "1 of Wall Street’s Favorite Stock with Exciting Potential and 2 to Brush Off",
                "url": "https://finance.yahoo.com/news/1-wall-street-favorite-stock-130402003.html"
            },
            {
                "headline": "However, the Trump administration’s 25% steel and aluminum tariffs and China’s export controls of critical minerals could affect the aircraft manufacturing titan’s progress.",
                "publication_date": "2025-04-14T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.128",
                "source": "Manufacturing Dive",
                "ticker": "BA",
                "title": "Boeing sees delivery uptick in Q1",
                "url": "https://finance.yahoo.com/news/boeing-sees-delivery-uptick-q1-104000478.html"
            },
            {
                "headline": "Let’s dig into the relative performance of Ducommun (NYSE:DCO) and its peers as we unravel the now-completed Q4 aerospace earnings season.",
                "publication_date": "2025-04-14T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "StockStory",
                "ticker": "BA",
                "title": "Q4 Earnings Highlights: Ducommun (NYSE:DCO) Vs The Rest Of The Aerospace Stocks",
                "url": "https://finance.yahoo.com/news/q4-earnings-highlights-ducommun-nyse-090209259.html"
            },
            {
                "headline": "Let’s dig into the relative performance of Ducommun (NYSE:DCO) and its peers as we unravel the now-completed Q4 aerospace earnings season.",
                "publication_date": "2025-04-14T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "StockStory",
                "ticker": "BA",
                "title": "Q4 Earnings Highlights: Ducommun (NYSE:DCO) Vs The Rest Of The Aerospace Stocks",
                "url": "https://finance.yahoo.com/news/q4-earnings-highlights-ducommun-nyse-090209259.html"
            },
            {
                "headline": "However, the Trump administration’s 25% steel and aluminum tariffs and China’s export controls of critical minerals could affect the aircraft manufacturing titan’s progress.",
                "publication_date": "2025-04-14T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.128",
                "source": "Manufacturing Dive",
                "ticker": "BA",
                "title": "Boeing sees delivery uptick in Q1",
                "url": "https://finance.yahoo.com/news/boeing-sees-delivery-uptick-q1-104000478.html"
            },
            {
                "headline": "The stocks in this article have caught Wall Street’s attention in a big way, with price targets implying returns above 20%. But investors should take these forecasts with a grain of salt because analysts typically say nice things about companies so their firms can win business in other product lines like M&A advisory.",
                "publication_date": "2025-04-14T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9209",
                "source": "StockStory",
                "ticker": "BA",
                "title": "1 of Wall Street’s Favorite Stock with Exciting Potential and 2 to Brush Off",
                "url": "https://finance.yahoo.com/news/1-wall-street-favorite-stock-130402003.html"
            }
        ],
        "avgScore": 0.3496333333333334,
        "pctChange": -0.02360619371956361
    },
    "4 11 2025": {
        "importantArticles": [
            {
                "headline": "Boeing (NYSE: BA) stock continued its recent turbulent ride with a decline Thursday morning: As of 12:30 p.m., it was off by 6.4% as the broader stock market reassessed the case for optimism after Wednesday's tariff-pause rebound.  President Donald Trump put a 90-day pause on most of his new tariffs, but left his new base 10% tariffs on nearly all imports in effect.  Trump's move to pause the larger share of his tariffs on most trading partners could reflect his underlying willingness to make conciliatory deals that improve U.S. companies' positions in foreign markets.",
                "publication_date": "2025-04-11T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8898",
                "source": "Motley Fool",
                "ticker": "BA",
                "title": "Why Boeing Stock Lost Ground Today",
                "url": "https://finance.yahoo.com/news/why-boeing-stock-lost-ground-171549402.html"
            },
            {
                "headline": "The end of the earnings season is always a good time to take a step back and see who shined (and who not so much). Let’s take a look at how aerospace stocks fared in Q4, starting with Woodward (NASDAQ:WWD).",
                "publication_date": "2025-04-11T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.4404",
                "source": "StockStory",
                "ticker": "BA",
                "title": "Winners And Losers Of Q4: Woodward (NASDAQ:WWD) Vs The Rest Of The Aerospace Stocks",
                "url": "https://finance.yahoo.com/news/winners-losers-q4-woodward-nasdaq-091435493.html"
            },
            {
                "headline": "The end of the earnings season is always a good time to take a step back and see who shined (and who not so much). Let’s take a look at how aerospace stocks fared in Q4, starting with Woodward (NASDAQ:WWD).",
                "publication_date": "2025-04-11T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.4404",
                "source": "StockStory",
                "ticker": "BA",
                "title": "Winners And Losers Of Q4: Woodward (NASDAQ:WWD) Vs The Rest Of The Aerospace Stocks",
                "url": "https://finance.yahoo.com/news/winners-losers-q4-woodward-nasdaq-091435493.html"
            },
            {
                "headline": "Boeing (NYSE: BA) stock continued its recent turbulent ride with a decline Thursday morning: As of 12:30 p.m., it was off by 6.4% as the broader stock market reassessed the case for optimism after Wednesday's tariff-pause rebound.  President Donald Trump put a 90-day pause on most of his new tariffs, but left his new base 10% tariffs on nearly all imports in effect.  Trump's move to pause the larger share of his tariffs on most trading partners could reflect his underlying willingness to make conciliatory deals that improve U.S. companies' positions in foreign markets.",
                "publication_date": "2025-04-11T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8898",
                "source": "Motley Fool",
                "ticker": "BA",
                "title": "Why Boeing Stock Lost Ground Today",
                "url": "https://finance.yahoo.com/news/why-boeing-stock-lost-ground-171549402.html"
            }
        ],
        "avgScore": 0.6651,
        "pctChange": 0.015557271731565165
    },
    "4 10 2025": {
        "importantArticles": [
            {
                "headline": "Vietnamese budget carrier Vietjet said on Thursday it has signed an agreement worth $300 million with AV AirFinance, a partner of investment fund KKR, to fund the expansion of its fleet.  Thursday's announcement confirmed a Reuters report last week on the finance deal done between Vietjet and AV AirFinance during a visit to the U.S. by Deputy Prime Minister Ho Duc Phoc for reciprocal tariff negotiation.  The agreement with AV AirFinance is the latest in a string of financing agreements worth $4 billion that have been signed with U.S. partners, Vietjet said in its statement.",
                "publication_date": "2025-04-10T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8834",
                "source": "Reuters",
                "ticker": "BA",
                "title": "Vietjet signs $300 million finance deal, in talks to expand order with Boeing",
                "url": "https://finance.yahoo.com/news/vietjet-signs-300-million-finance-025534617.html"
            },
            {
                "headline": "Boeing (BA) witnessed a jump in share price last session on above-average trading volume. The latest trend in earnings estimate revisions for the stock suggests that there could be more strength down the road.",
                "publication_date": "2025-04-10T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.6901",
                "source": "Zacks",
                "ticker": "BA",
                "title": "Boeing (BA) Moves 15.4% Higher: Will This Strength Last?",
                "url": "https://finance.yahoo.com/news/boeing-ba-moves-15-4-134200698.html"
            },
            {
                "headline": "BA stock records year-over-year growth of 56.6% and 85.7% in commercial and defense shipments, respectively, in the first quarter of 2025.",
                "publication_date": "2025-04-10T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.6705",
                "source": "Zacks",
                "ticker": "BA",
                "title": "Boeing Q1 Commercial & Defense Deliveries Rise Y/Y, Lag Airbus",
                "url": "https://finance.yahoo.com/news/boeing-q1-commercial-defense-deliveries-140600106.html"
            },
            {
                "headline": "Commentary by a Jefferies analyst illustrates that commitments to buy the company’s jets could be a negotiating chip in the trade war.",
                "publication_date": "2025-04-10T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5267",
                "source": "Barrons.com",
                "ticker": "BA",
                "title": "Boeing Stock Takes Off as Trump Mitigates Tariff Risk",
                "url": "https://finance.yahoo.com/m/60e8338a-a567-39c1-b65f-87522b8e8918/boeing-stock-takes-off-as.html"
            },
            {
                "headline": "Boeing (BA) has been one of the stocks most watched by Zacks.com users lately. So, it is worth exploring what lies ahead for the stock.",
                "publication_date": "2025-04-10T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.1621",
                "source": "Zacks",
                "ticker": "BA",
                "title": "Is Most-Watched Stock The Boeing Company (BA) Worth Betting on Now?",
                "url": "https://finance.yahoo.com/news/most-watched-stock-boeing-company-130015796.html"
            },
            {
                "headline": "A delivery race, a flood of new orders, and looming tariffs--here's what investors need to know now.",
                "publication_date": "2025-04-10T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.128",
                "source": "GuruFocus.com",
                "ticker": "BA",
                "title": "Airbus Surges, Boeing Fights Back: The Jet War You Can't Ignore",
                "url": "https://finance.yahoo.com/news/airbus-surges-boeing-fights-back-181251391.html"
            }
        ],
        "avgScore": 0.2676222222222222,
        "pctChange": 0.008487603068201743
    },
    "4 9 2025": {
        "importantArticles": [
            {
                "headline": "Market Domination host Julie Hyman goes over the day's trending stories on this segment of Market Minute. Wells Fargo (WFC) stock pops after Piper Sandler upgraded the company to Overweight from Neutral, citing an attractive entry point. Charles Schwab (SCHW) is gaining after Morgan Stanley upgraded the company to Overweight from Equal Weight. Boeing (BA) is in focus after reporting strong first quarter delivery numbers that marked the company's best three months since the fourth quarter of 2023. Stay up to date on the latest market action, minute-by-minute, with Yahoo Finance's Market Minute.",
                "publication_date": "2025-04-09T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.875",
                "source": "Yahoo Finance Video",
                "ticker": "BA",
                "title": "Wells Fargo, Charles Schwab, Boeing: Market Minute",
                "url": "https://finance.yahoo.com/video/wells-fargo-charles-schwab-boeing-182115784.html"
            },
            {
                "headline": "LMT secures a $22.5 million modification contract to provide maintenance and sustainment support for the F-35 jet program's Reprogramming Laboratory facilities and systems.",
                "publication_date": "2025-04-09T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.6124",
                "source": "Zacks",
                "ticker": "BA",
                "title": "Lockheed Martin Secures Contract Involving F-35 Fighter Jet Program",
                "url": "https://finance.yahoo.com/news/lockheed-martin-secures-contract-involving-135500395.html"
            },
            {
                "headline": "After years of setbacks, Boeing just logged its strongest month of orders--can it finally deliver on the hype?",
                "publication_date": "2025-04-09T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.4404",
                "source": "GuruFocus.com",
                "ticker": "BA",
                "title": "Boeing's Big Comeback? Record Orders Signal a Massive Turnaround",
                "url": "https://finance.yahoo.com/news/boeings-big-comeback-record-orders-174831019.html"
            },
            {
                "headline": "Delta Air Lines is working to avoid paying tariffs on the dozens of planes it is set to receive from Airbus this year.  “We will not pay tariffs on any aircraft deliveries we take,” Delta Chief Executive Ed Bastian said during an earnings call Wednesday.  “We will defer any deliveries that have a tariff on it.”",
                "publication_date": "2025-04-09T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.4774",
                "source": "The Wall Street Journal",
                "ticker": "BA",
                "title": "Delta Won’t Swallow Tariff-Related Costs on Planes, CEO Says",
                "url": "https://finance.yahoo.com/m/7cf3b7ed-64f4-3b46-93a6-d2b870bb3bca/delta-won%E2%80%99t-swallow.html"
            },
            {
                "headline": "HANOI/WASHINGTON (Reuters) -Vietnam's Deputy Prime Minister is set to talk on Wednesday with U.S. Treasury Secretary Scott Bessent and plans also to meet Boeing, SpaceX and Apple executives this week, according to an internal schedule seen by Reuters.  The export-reliant Southeast Asian nation is scrambling to persuade the Trump administration to revise its decision to impose tariffs of 46% on Vietnam's exports to Washington, which account for about 30% of the country's gross domestic product.  Deputy Prime Minister Ho Duc Phoc is set to meet Bessent for about 45 minutes at the Treasury in Washington at 4 p.m. EST (2000 GMT) on Wednesday, according to the internal schedule, which is still subject to changes.",
                "publication_date": "2025-04-09T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.4019",
                "source": "Reuters",
                "ticker": "BA",
                "title": "Vietnam's deputy PM to meet US's Bessent, Boeing on Wednesday, schedule shows",
                "url": "https://finance.yahoo.com/news/vietnams-deputy-pm-meet-uss-024113934.html"
            },
            {
                "headline": "Boeing Faces Steep Losses: Analysts Predict $1.44 Per Share Drop",
                "publication_date": "2025-04-09T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.3818",
                "source": "GuruFocus.com",
                "ticker": "BA",
                "title": "Boeing Q1 Earnings Preview: What Analysts Expect from Upcoming Report",
                "url": "https://finance.yahoo.com/news/boeing-q1-earnings-preview-analysts-125717516.html"
            }
        ],
        "avgScore": 0.1597,
        "pctChange": -0.03295611746287774
    },
    "4 8 2025": {
        "importantArticles": [
            {
                "headline": "All three major US stock indexes were up over 2% in late-morning trading Tuesday on rising hopes of",
                "publication_date": "2025-04-08T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.4215",
                "source": "MT Newswires",
                "ticker": "BA",
                "title": "Top Midday Stories: Markets Rally on Trade Deal Hopes; Boeing Q1 Commercial Deliveries Jump 57% Year Over Year",
                "url": "https://finance.yahoo.com/news/top-midday-stories-markets-rally-154449131.html"
            },
            {
                "headline": "LDOS presents Sea Dart, an uncrewed underwater vessel that will help the U.S. Navy and commercial clients in a range of operations.",
                "publication_date": "2025-04-08T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.4019",
                "source": "Zacks",
                "ticker": "BA",
                "title": "Leidos Reveals Its Latest Sea Dart Unmanned Undersea Vessel",
                "url": "https://finance.yahoo.com/news/leidos-reveals-latest-sea-dart-131200655.html"
            },
            {
                "headline": "The Boeing Company [NYSE: BA] announced today major program deliveries across its commercial and defense operations for the first quarter of 2025.",
                "publication_date": "2025-04-08T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.128",
                "source": "PR Newswire",
                "ticker": "BA",
                "title": "Boeing Announces First Quarter Deliveries",
                "url": "https://finance.yahoo.com/news/boeing-announces-first-quarter-deliveries-150000078.html"
            },
            {
                "headline": "Boeing delivered 41 jets in March, up from 29 during the same month a year ago, the company announced Tuesday, though the figure was slightly lower than the 45 handed over in January and 44 in February.  Through the first three months of the year, Boeing delivered 130 jets, including 104 of its best-selling 737 MAX.  Boeing's production and deliveries have been hampered in the last year by a labor strike, regulatory scrutiny and supply chain bottlenecks.",
                "publication_date": "2025-04-08T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.3415",
                "source": "Reuters",
                "ticker": "BA",
                "title": "Boeing deliveries in March jump by 41% compared to a year earlier",
                "url": "https://finance.yahoo.com/news/boeing-deliveries-march-jump-41-150436613.html"
            },
            {
                "headline": "As the Q4 earnings season wraps, let’s dig into this quarter’s best and worst performers in the aerospace industry, including HEICO (NYSE:HEI) and its peers.",
                "publication_date": "2025-04-08T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0258",
                "source": "StockStory",
                "ticker": "BA",
                "title": "Aerospace Stocks Q4 Earnings: HEICO (NYSE:HEI) Best of the Bunch",
                "url": "https://finance.yahoo.com/news/aerospace-stocks-q4-earnings-heico-091413992.html"
            },
            {
                "headline": "The Boeing Company [NYSE: BA] announced today major program deliveries across its commercial and defense operations for the first quarter of 2025.",
                "publication_date": "2025-04-08T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.128",
                "source": "PR Newswire",
                "ticker": "BA",
                "title": "Boeing Announces First Quarter Deliveries",
                "url": "https://finance.yahoo.com/news/boeing-announces-first-quarter-deliveries-150000078.html"
            }
        ],
        "avgScore": 0.12713999999999998,
        "pctChange": 0.15374135898132285
    },
    "4 7 2025": {
        "importantArticles": [
            {
                "headline": "NOC secures a $24.1 million modification contract to provide continued sustainment and technical support for the E-2C and E-2D aircraft as well as common and unique requirements.",
                "publication_date": "2025-04-07T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7269",
                "source": "Zacks",
                "ticker": "BA",
                "title": "Northrop's Arm Wins Contract to Support E-2C & D Hawkeye Jets",
                "url": "https://finance.yahoo.com/news/northrops-arm-wins-contract-support-160800970.html"
            },
            {
                "headline": "RTX will provide funding for manufacturing, assembly, testing and delivery of SM-6 Tactical All-Up Rounds to support full-rate production requirements.",
                "publication_date": "2025-04-07T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.4019",
                "source": "Zacks",
                "ticker": "BA",
                "title": "RTX Wins $117M Contract to Support Standard Missile-6 Program",
                "url": "https://finance.yahoo.com/news/rtx-wins-117m-contract-support-114400046.html"
            },
            {
                "headline": "As the Q4 earnings season comes to a close, it’s time to take stock of this quarter’s best and worst performers in the aerospace industry, including Curtiss-Wright (NYSE:CW) and its peers.",
                "publication_date": "2025-04-07T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0258",
                "source": "StockStory",
                "ticker": "BA",
                "title": "Spotting Winners: Curtiss-Wright (NYSE:CW) And Aerospace Stocks In Q4",
                "url": "https://finance.yahoo.com/news/spotting-winners-curtiss-wright-nyse-091120897.html"
            },
            {
                "headline": "China's move to impose 34% tariffs on all U.S. goods in a tit-for-tat blow against U.S. President Donald Trump is set to roil industries from aviation to agriculture.  China's retaliatory tariffs are set to hit Boeing hard, making its planes far more expensive than those of rivals Airbus and Commercial Aircraft Corporation of China (COMAC).  While Beijing did not impose tariffs on Boeing during Trump's first trade war with China, its sales and deliveries to China plummeted after 2019 following two fatal crashes of MAX 8 jets and amid intensifying tensions between Washington and Beijing over issues ranging from technology to national security.",
                "publication_date": "2025-04-07T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.91",
                "source": "Reuters",
                "ticker": "BA",
                "title": "Factbox-US companies most vulnerable to China's retaliatory import tariffs",
                "url": "https://finance.yahoo.com/news/factbox-us-companies-most-vulnerable-060518500.html"
            },
            {
                "headline": "U.S. planemaker Boeing Co reached settlements with the families of two people who died in the March 2019 crash of an Ethiopian Airlines Boeing 737 MAX on the eve of a trial, the company and lawyers for the families said on Monday.  Terms of the settlements with the families of victims Antoine Lewis and Darcy Belanger were not released.  The trial in U.S. District Court in Chicago had been expected to be the first against the planemaker in two fatal 737 MAX crashes in 2018 and 2019 that led to the bestselling plane's 20-month grounding and cost Boeing more than $20 billion.",
                "publication_date": "2025-04-07T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.8934",
                "source": "Reuters",
                "ticker": "BA",
                "title": "Boeing settles lawsuits with two 737 MAX crash victims' families",
                "url": "https://finance.yahoo.com/news/boeing-settles-lawsuits-two-737-142230124.html"
            },
            {
                "headline": "Millennium Space Systems, a Boeing [NYSE: BA] company, completed the Fire-control On Orbit-support-to-the-war Fighter (FOO Fighter) critical design review (CDR) in just 10 months after authorization to proceed.",
                "publication_date": "2025-04-07T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.1779",
                "source": "PR Newswire",
                "ticker": "BA",
                "title": "Millennium Space Systems Completes FOO Fighter Critical Design Review in Just 10 Months",
                "url": "https://finance.yahoo.com/news/millennium-space-systems-completes-foo-130000814.html"
            }
        ],
        "avgScore": -0.10333749999999998,
        "pctChange": 0.003816785085462295
    },
    "coef": -0.03296703296703297,
    "avgCoef": -0.02110635347627812,
    "similar": {
        "HIMS": 0.5944055944055945,
        "AMD": 0.5104895104895105,
        "JD": 0.5104895104895105,
        "PLTR": 0.4545454545454546
    }
}