{
    "importantArticles": [
        {
            "headline": "Alibaba Group Holding (NYSE:BABA) saw its stock price rise by 36% over the last quarter, against a backdrop where the broader market faced downturns with major indexes like the Nasdaq entering a bear market. This significant gain can be attributed to several key company events, notably its aggressive buyback strategy which saw 51 million shares repurchased for $600 million, enhancing shareholder value. Furthermore, the company's impressive earnings performance, with net income surging from...",
            "publication_date": "2025-04-05T18:24:07.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.9186",
            "source": "Simply Wall St.",
            "ticker": "BABA",
            "title": "Alibaba Group Holding (NYSE:BABA) Soars 36% Over Last Quarter With Net Income Surging to CNY 49,127 Million",
            "url": "https://finance.yahoo.com/news/alibaba-group-holding-nyse-baba-182407041.html"
        },
        {
            "headline": "Alibaba Group Holding (NYSE:BABA) reported significant developments this past quarter, propelling its share price by 53%. Key to this upswing was the buyback of 51 million shares worth $600 million, part of a broader buyback initiative since June 2019. Positive earnings results also bolstered investor confidence, with a nearly threefold rise in net income year-over-year. Despite global market instability from new tariffs imposed by the U.S., which led to widespread declines across major...",
            "publication_date": "2025-04-03T17:36:35.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.9136",
            "source": "Simply Wall St.",
            "ticker": "BABA",
            "title": "Alibaba Group Holding (NYSE:BABA) Completes US$600 Million Share Buyback After 1% Dip",
            "url": "https://finance.yahoo.com/news/alibaba-group-holding-nyse-baba-173635834.html"
        },
        {
            "headline": "Hedge fund manager David Tepper has achieved an average annual return of more than 25% since the inception of his firm, Appaloosa Management, in 1993.  Today, Tepper's net worth tops $21 billion.  The so-called \"Magnificent Seven\" stocks skyrocketed in 2024, and Appaloosa Management profited from their momentum, as several of those giant tech companies were among its top holdings.",
            "publication_date": "2025-04-06T08:51:00.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.9042",
            "source": "Motley Fool",
            "ticker": "BABA",
            "title": "Does Billionaire David Tepper Know Something Wall Street Doesn't?",
            "url": "https://finance.yahoo.com/news/does-billionaire-david-tepper-know-085100366.html"
        },
        {
            "headline": "As part of today's Market Minute, Madison Mills outlines the top stories of the trading day. Intel (INTC) stock plunges as US–China trade war tensions intensify. Dell Technologies (DELL) stock extends losses as Morgan Stanley (MS) analysts raise concerns about tariff impacts. Chinese tech stocks, like Alibaba (BABA), PDD Holdings (PDD), and JD.com (JD), tumble as China retaliates against Trump's new tariffs. Stay up to date on the latest market action, minute-by-minute, with Yahoo Finance's Market Minute.",
            "publication_date": "2025-04-04T15:16:45.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.6705",
            "source": "Yahoo Finance Video",
            "ticker": "BABA",
            "title": "Intel, Dell, Chinese tech stocks fall: Market Minute",
            "url": "https://finance.yahoo.com/video/intel-dell-chinese-tech-stocks-151645306.html"
        },
        {
            "headline": "We recently published a list of Jim Cramer’s Thoughts on Liberation Day, Tariffs, and 17 Stocks to Watch Right Now. In this article, we are going to take a look at where Alibaba Group Holding Ltd. (NYSE:BABA) stands against other stocks that Jim Cramer discusses. On Tuesday, April 1st, the host of Mad Money opened […]",
            "publication_date": "2025-04-05T03:20:50.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.4939",
            "source": "Insider Monkey",
            "ticker": "BABA",
            "title": "Alibaba Group Holding Ltd. (BABA) – Jim Cramer’s Only Bullish China Play",
            "url": "https://finance.yahoo.com/news/alibaba-group-holding-ltd-baba-032050088.html"
        },
        {
            "headline": "China's e-commerce powerhouse appears to have finally let go of what was holding it back from entering a new era.",
            "publication_date": "2025-04-06T14:10:00.000Z",
            "sentiment": "Neutral",
            "sentimentScore": "0.0",
            "source": "Motley Fool",
            "ticker": "BABA",
            "title": "Alibaba Stock Soared 56% in Q1 While the Nasdaq Plunged 10%. Here's Why.",
            "url": "https://finance.yahoo.com/news/alibaba-stock-soared-56-q1-141000080.html"
        }
    ],
    "avgScore": 0.4210388888888889,
    "todayPctChange": -0.013086060783394344,
    "vScore": -0.5509740492172818
}