{
    "importantArticles": [
        {
            "headline": "We recently published a list of 10 Best Financial Stocks to Buy According to Billionaires. In this article, we are going to take a look at where Bank of America Corporation (NYSE:BAC) stands against other best financial stocks to invest in. Financial stocks had a great run in 2024, jumping over 30% by mid-December and […]",
            "publication_date": "2025-04-01T14:03:42.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.926",
            "source": "Insider Monkey",
            "ticker": "BAC",
            "title": "Bank of America (BAC): Among the Best Financial Stocks Billionaires Are Investing In",
            "url": "https://finance.yahoo.com/news/bank-america-bac-among-best-140342230.html"
        },
        {
            "headline": "Finding strong, market-beating stocks with a positive earnings outlook becomes easier with the Focus List, a top feature of the Zacks Premium portfolio service.",
            "publication_date": "2025-04-02T13:30:02.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.8885",
            "source": "Zacks",
            "ticker": "BAC",
            "title": "New to Investing? This 1 Finance Stock Could Be the Perfect Starting Point",
            "url": "https://finance.yahoo.com/news/investing-1-finance-stock-could-133002202.html"
        },
        {
            "headline": "We came across a bullish thesis on Bank of America Corporation (BAC) on Substack by Easy Trader. In this article, we will summarize the bulls’ thesis on BAC. Bank of America Corporation (BAC)’s share was trading at $41.85 as of April 2nd. BAC’s trailing and forward P/E were 13.04 and 11.31 respectively according to Yahoo Finance. Bank […]",
            "publication_date": "2025-04-03T13:46:09.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.7579",
            "source": "Insider Monkey",
            "ticker": "BAC",
            "title": "Bank of America Corporation (BAC): A Bull Case Theory",
            "url": "https://finance.yahoo.com/news/bank-america-corporation-bac-bull-134609058.html"
        },
        {
            "headline": "(Bloomberg) -- Wall Street forecasters are turning ice cold on US equities, telling investors to refrain from buying the selloff as President Donald Trump’s historic trade war raises the specter of recession.Most Read from BloombergHousing Agency Aims to Relocate Its DC HeadquartersMetro-North Is Faster Than Acela on NYC-New Haven Route After Signal UpdatesLocal Governments Vie for Fired Federal WorkersLondon Clears Final Hurdle for More High-Speed Trains to EuropeWhat Would ‘Transportation Abun",
            "publication_date": "2025-04-04T11:55:27.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.802",
            "source": "Bloomberg",
            "ticker": "BAC",
            "title": "Wall Street Turns Icy on US Stocks as Tariffs Hit Markets Hard",
            "url": "https://finance.yahoo.com/news/yardeni-says-us-stock-swoon-061327242.html"
        },
        {
            "headline": "(Bloomberg) -- The S&P 500 Index declined to the lowest level in 11 months, slashing $5.4 trillion in market value in just two sessions as Federal Reserve Chairman Jerome Powell said the Trump administration’s tariffs “could have a persistent impact on inflation.”Most Read from BloombergHousing Agency Aims to Relocate Its DC HeadquartersLocal Governments Vie for Fired Federal WorkersMetro-North Is Faster Than Acela on NYC-New Haven Route After Signal UpdatesWhat Would ‘Transportation Abundance’",
            "publication_date": "2025-04-04T20:26:32.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.7096",
            "source": "Bloomberg",
            "ticker": "BAC",
            "title": "US Stock Market Wipes Out Over $5 Trillion on Trump’s Tariff War",
            "url": "https://finance.yahoo.com/news/us-stock-market-wipes-over-202632831.html"
        },
        {
            "headline": "In a tumultuous period marked by a significant market downturn, Bank of America (NYSE:BAC) experienced a share price decline of 13% over the past week. This drop coincides with recent developments, including notable shareholder activism, where the company received several proposals and recommended votes against them, and a leadership change in its India operations. Additionally, the market's overall turbulence, driven by global trade tensions and fears of an economic recession, compounded the...",
            "publication_date": "2025-04-04T17:32:02.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.6808",
            "source": "Simply Wall St.",
            "ticker": "BAC",
            "title": "Bank of America (NYSE:BAC) Sees 13% Weekly Dip Amid Leadership Change in India",
            "url": "https://finance.yahoo.com/news/bank-america-nyse-bac-sees-173202035.html"
        }
    ],
    "avgScore": 0.06787777777777779,
    "todayPctChange": -0.03456511378057145,
    "vScore": -0.23462031120612337
}