{
    "4 15 2025": {
        "importantArticles": [
            {
                "headline": "Bank of America (NYSE:BAC) recently reported impressive first-quarter earnings, with net income rising to $7.4 billion and EPS increasing to $0.90. This robust financial performance likely played a role in the company's 3% price increase last week, aligning with strong market trends that saw bank stocks lift the indexes. Despite ongoing trade tensions with China affecting some sectors, the financial sector showed resilience, with banks like Citigroup also reporting positive results. The...",
                "publication_date": "2025-04-15T17:19:04.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9641",
                "source": "Simply Wall St.",
                "ticker": "BAC",
                "title": "Bank of America (NYSE:BAC) Reports Higher Q1 Earnings and Net Interest Income",
                "url": "https://finance.yahoo.com/news/bank-america-nyse-bac-reports-171904579.html"
            },
            {
                "headline": "We recently published a list of the 10 Best Value Dividend Stocks to Buy According to Billionaires. In this article, we are going to take a look at where Bank of America Corporation (NYSE:BAC) stands against other best value dividend stocks. Dividends, though sometimes underappreciated, have significantly contributed to long-term investor gains. Between 1960 and the […]",
                "publication_date": "2025-04-15T11:36:40.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9393",
                "source": "Insider Monkey",
                "ticker": "BAC",
                "title": "Is Bank of America (BAC) The Best Value Dividend Stock to Buy According to Billionaires?",
                "url": "https://finance.yahoo.com/news/bank-america-bac-best-value-113640624.html"
            },
            {
                "headline": "Citi and Bank of America posted first-quarter net interest income of $14 billion and $14.4 billion, respectively.  Wall Street expected $14.49 billion of NII for the quarter at BofA, according to data compiled by FactSet, and $13.56 billion at Citi.  BofA said in January that it expected to drive between $14.5 billion and $14.6 billion of net interest income on a fully taxable equivalent basis for the first quarter.",
                "publication_date": "2025-04-15T14:06:51.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8126",
                "source": "Barrons.com",
                "ticker": "BAC",
                "title": "Bank of America and Citi Report Higher NII, Reiterate Outlook",
                "url": "https://finance.yahoo.com/m/fdf73818-b495-3cef-9a72-be51a13cb81c/bank-of-america-and-citi.html"
            },
            {
                "headline": "(Bloomberg) -- Stocks got whipsawed once again as a slew of headlines on President Donald Trump’s fast-evolving tariff war with top trade partners left investors unwilling to take on too much risk following a two-day rally.Most Read from BloombergHow Did This Suburb Figure Out Mass Transit?Even Oslo Has an Air Quality ProblemNYC Tourist Helicopter Crashes in Hudson River, Killing Six$15 Million Fund Bets Leadership Training Can Improve Chicago PolicingLA County Floats Leaner Budget Burdened by F",
                "publication_date": "2025-04-15T17:19:52.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.8555",
                "source": "Bloomberg",
                "ticker": "BAC",
                "title": "Stocks Get Whipsawed on Lingering Trade-War Risks: Markets Wrap",
                "url": "https://finance.yahoo.com/news/stocks-rise-led-japan-auto-040211765.html"
            },
            {
                "headline": "Read more: Wall Street banks are cashing in on trade war chaos",
                "publication_date": "2025-04-15T15:39:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.8225",
                "source": "Quartz",
                "ticker": "BAC",
                "title": "Stocks rise as bank earnings and tech drive markets higher",
                "url": "https://finance.yahoo.com/news/wall-street-banks-cashing-trade-123249767.html"
            },
            {
                "headline": "(Bloomberg) -- Investor sentiment regarding economic prospects is the most negative in three decades, yet fund managers’ pessimism isn’t fully reflected in their asset allocation which could mean more losses for US stocks, a Bank of America Corp. survey shows.Most Read from BloombergHow Did This Suburb Figure Out Mass Transit?Even Oslo Has an Air Quality ProblemNYC Tourist Helicopter Crashes in Hudson River, Killing SixLisbon Mayor Wants Companies to Help Fix City’s Housing Shortage$15 Million F",
                "publication_date": "2025-04-15T09:17:17.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.8169",
                "source": "Bloomberg",
                "ticker": "BAC",
                "title": "Investors Haven’t Been This Bearish in 30 Years, BofA Poll Shows",
                "url": "https://finance.yahoo.com/news/investors-haven-t-bearish-30-091717258.html"
            }
        ],
        "avgScore": 0.25635142857142856
    },
    "4 14 2025": {
        "importantArticles": [
            {
                "headline": "We recently published a list of the 11 Best Dividend Paying Stocks According to Hedge Funds. In this article, we are going to take a look at where Bank of America Corporation (NYSE:BAC) stands against other best dividend-paying stocks. Dividend-paying stocks have consistently attracted investor interest due to their long-term value. CNBC highlights this by […]",
                "publication_date": "2025-04-14T13:53:15.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9485",
                "source": "Insider Monkey",
                "ticker": "BAC",
                "title": "Bank of America Corporation (BAC): One of the Best Dividend Paying Stocks According to Hedge Funds",
                "url": "https://finance.yahoo.com/news/bank-america-corporation-bac-one-135315692.html"
            },
            {
                "headline": "Yahoo Finance host Josh Lipton highlights what to watch on Tuesday, April 15. Earnings reports are expected from Johnson & Johnson (JNJ), Albertsons (ACI), and United Airlines (UAL), as well as major banks like Bank of America (BAC) and Citi (C). Fresh Federal Reserve commentary is coming as Fed Governor Lisa Cook is set to speak. The deadline to file 2024 federal income tax returns is also on Tuesday. To watch more expert insights and analysis on the latest market action, check out more Market Domination Overtime&nbsp;here.",
                "publication_date": "2025-04-14T23:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8032",
                "source": "Yahoo Finance Video",
                "ticker": "BAC",
                "title": "Big Bank earnings, Fed commentary, tax deadline: What to Watch",
                "url": "https://finance.yahoo.com/video/big-bank-earnings-fed-commentary-230000867.html"
            },
            {
                "headline": "Bank of America and Citigroup are expected to notch higher revenue and profit when they post results Tuesday morning.  On Monday, Goldman Sachs reported profit that jumped 15% from a year earlier as its trading business boomed.",
                "publication_date": "2025-04-14T21:41:21.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7003",
                "source": "Barrons.com",
                "ticker": "BAC",
                "title": "Bank of America, Citi Earnings: What to Expect",
                "url": "https://finance.yahoo.com/m/6f8548e3-a3ba-3347-ac20-fb7946330a18/bank-of-america-citi.html"
            },
            {
                "headline": "Goldman Sachs Group Inc.'s stock traders posted their highest quarterly revenue haul on record, riding a wave of volatility triggered by an emerging global trade war that's roiled financial markets. KBW Analyst of Large Cap Banks David Konrad has more on the story.",
                "publication_date": "2025-04-14T18:03:42.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5994",
                "source": "Bloomberg",
                "ticker": "BAC",
                "title": "KBW Analyst on Goldman Sachs' Record Quarter",
                "url": "https://finance.yahoo.com/video/kbw-analyst-goldman-sachs-record-180342835.html"
            },
            {
                "headline": "A federal judge ordered Bank of America to pay $540.3 million in a long-running Federal Deposit Insurance Corporation lawsuit accusing the second-largest U.S. bank of underpaying what it owed for deposit insurance.  In a decision made public on Monday, U.S. District Judge Loren AliKhan in Washington, D.C., said the payment covers assessments from the second quarter of 2013 through the end of 2014, plus interest.  The FDIC sued Charlotte, North Carolina-based Bank of America for $1.12 billion in 2017, accusing it of reducing its deposit insurance contributions by failing to honor a 2011 rule that changed how banks report risk exposure to counterparties.",
                "publication_date": "2025-04-14T22:09:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.4404",
                "source": "Reuters",
                "ticker": "BAC",
                "title": "Judge orders Bank of America to pay $540 million in FDIC lawsuit",
                "url": "https://finance.yahoo.com/news/judge-orders-bank-america-pay-220900153.html"
            },
            {
                "headline": "Does JPM stock deserve a place in your investment portfolio after posting an upbeat Q1 performance? Let's find out.",
                "publication_date": "2025-04-14T13:13:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Zacks",
                "ticker": "BAC",
                "title": "How to Play JPMorgan Stock After Upbeat Q1 Earnings Performance",
                "url": "https://finance.yahoo.com/news/play-jpmorgan-stock-upbeat-q1-131300969.html"
            }
        ],
        "avgScore": 0.2736125
    },
    "4 11 2025": {
        "importantArticles": [
            {
                "headline": "Dividends are one of the best benefits to being a shareholder, but finding a great dividend stock is no easy task. Does Bank of America (BAC) have what it takes? Let's find out.",
                "publication_date": "2025-04-11T15:45:08.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9022",
                "source": "Zacks",
                "ticker": "BAC",
                "title": "Bank of America (BAC) is a Top Dividend Stock Right Now: Should You Buy?",
                "url": "https://finance.yahoo.com/news/bank-america-bac-top-dividend-154508901.html"
            },
            {
                "headline": "We recently published a list of 11 Best Digital Payments Stocks to Buy According to Analysts. In this article, we are going to take a look at where Bank of America Corporation (NYSE:BAC) stands against other best digital payment stocks. Digital payment stocks are companies that specialize in designing, developing, or administering digital payment solutions. […]",
                "publication_date": "2025-04-11T12:17:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8779",
                "source": "Insider Monkey",
                "ticker": "BAC",
                "title": "Is Bank of America Corporation (BAC) Among the Best Digital Payments Stocks to Buy According to Analysts?",
                "url": "https://finance.yahoo.com/news/bank-america-corporation-bac-among-121700265.html"
            },
            {
                "headline": "Earnings mean less, and old outlooks mean nothing when tariff policy is all Wall Street cares about.",
                "publication_date": "2025-04-11T10:00:25.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.4588",
                "source": "Yahoo Finance",
                "ticker": "BAC",
                "title": "Tariff uncertainty muddies — and refocuses — earnings season: Morning Brief",
                "url": "https://finance.yahoo.com/news/tariff-uncertainty-muddies--and-refocuses--earnings-season-morning-brief-100025876.html"
            },
            {
                "headline": "(Bloomberg) -- Investors should sell any rallies in the S&P 500 Index until the Federal Reserve steps in and the US and China de-escalate the global trade war, according to Bank of America Corp.’s Michael Hartnett.Most Read from BloombergMidtown Office Building Evacuated on Concerns of Wall CollapseThe Secret Formula for Faster TrainsIn Chicago, a Former Steel Mill Looks to Make a Quantum LeapNYC Tourist Helicopter Crashes in Hudson River, Killing SixInside the Quiet, Extravagant Expansion of th",
                "publication_date": "2025-04-11T08:42:40.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.8519",
                "source": "Bloomberg",
                "ticker": "BAC",
                "title": "BofA’s Hartnett Says Sell S&P 500 Rally Until Trade War Abates",
                "url": "https://finance.yahoo.com/news/bofa-hartnett-says-sell-p-084240804.html"
            },
            {
                "headline": "(Bloomberg) -- Wall Street’s gyrations shook markets anew, with stocks erasing losses to notch their best week since 2023. The rally came as a rout in bonds and the dollar abated, following a few chaotic days that underscored fears foreign investors are beating a retreat from American assets.Most Read from BloombergThe Secret Formula for Faster TrainsIn Chicago, a Former Steel Mill Looks to Make a Quantum LeapMidtown Office Building Evacuated on Concerns of Wall CollapseNYC Tourist Helicopter Cr",
                "publication_date": "2025-04-11T21:27:04.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.7269",
                "source": "Bloomberg",
                "ticker": "BAC",
                "title": "S&P 500 Notches Its Best Week Since November 2023: Markets Wrap",
                "url": "https://finance.yahoo.com/news/euro-advances-treasuries-sell-off-055911617.html"
            },
            {
                "headline": "Earnings preview of key companies reporting this week and what to look out for.",
                "publication_date": "2025-04-11T13:11:11.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Yahoo Finance UK",
                "ticker": "BAC",
                "title": "Stocks to watch this week: Goldman Sachs, TSMC, ASML, Netflix, LVMH and Sainsbury's",
                "url": "https://finance.yahoo.com/news/goldman-sachs-tsmc-asml-netflix-lvmh-and-sainsburys-stocks-to-watch-131111514.html"
            }
        ],
        "avgScore": 0.1459
    },
    "4 10 2025": {
        "importantArticles": [
            {
                "headline": "Innovation sessions, governance oversight and a clear focus on solving practical problems helped shape internal and customer-facing use cases.",
                "publication_date": "2025-04-10T07:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.5994",
                "source": "CIO Dive",
                "ticker": "BAC",
                "title": "How Bank of America scaled AI",
                "url": "https://finance.yahoo.com/news/bank-america-scaled-ai-070000347.html"
            },
            {
                "headline": "As bank-earnings season begins Friday with JPMorgan, investors care more about the outlook than prior results.",
                "publication_date": "2025-04-10T09:30:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.4939",
                "source": "The Wall Street Journal",
                "ticker": "BAC",
                "title": "Why the Trade War Isn’t Over for America’s Biggest Banks",
                "url": "https://finance.yahoo.com/m/c3135b2c-e06d-32ed-a83f-df41555192d8/why-the-trade-war-isn%E2%80%99t-over.html"
            },
            {
                "headline": "After a rip-roaring rally yesterday, stocks resumed their sell-off today, as unrest about tariffs and U.S.-Chinese relations once again found the spotlight.  Shares of JPMorgan Chase (NYSE: JPM) traded roughly 4% lower.  Shares of Bank of America (NYSE: BAC) and Wells Fargo (NYSE: WFC) had fallen roughly 4.6% and 5.7%, respectively.",
                "publication_date": "2025-04-10T20:12:06.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.4767",
                "source": "Motley Fool",
                "ticker": "BAC",
                "title": "Why Bank Stocks JPMorgan Chase, Bank of America, and Wells Fargo Are Falling Ahead of Earnings",
                "url": "https://finance.yahoo.com/news/why-bank-stocks-jpmorgan-chase-201206095.html"
            },
            {
                "headline": "(Bloomberg) -- The Canadian government has invited representatives from US banks including JPMorgan Chase & Co. for a meeting, according to people with knowledge of the matter, after US President Donald Trump complained that American banks have trouble doing business in Canada.Most Read from BloombergMidtown Office Building Evacuated on Concerns of Wall CollapseIn Chicago, a Former Steel Mill Looks to Make a Quantum LeapThe Secret Formula for Faster TrainsHelicopter Crashes Into Hudson River Wit",
                "publication_date": "2025-04-10T16:54:09.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.6486",
                "source": "Bloomberg",
                "ticker": "BAC",
                "title": "Canadian Officials Said to Plan Meeting With US Banks After Trump Complaints",
                "url": "https://finance.yahoo.com/news/canadian-officials-said-plan-meeting-165409007.html"
            },
            {
                "headline": "Bank of America (BAC) was a big mover last session on higher-than-average trading volume. The latest trend in earnings estimate revisions might not help the stock continue moving higher in the near term.",
                "publication_date": "2025-04-10T13:42:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.3089",
                "source": "Zacks",
                "ticker": "BAC",
                "title": "Bank of America (BAC) Soars 6.1%: Is Further Upside Left in the Stock?",
                "url": "https://finance.yahoo.com/news/bank-america-bac-soars-6-134200455.html"
            },
            {
                "headline": "Bank of America today announced the launch of Golf with Us, a new initiative designed to grow the next generation of golfers.",
                "publication_date": "2025-04-10T13:10:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "PR Newswire",
                "ticker": "BAC",
                "title": "BofA Launches 'Golf with Us' to Bring Affordable Rounds to More Than 50,000 Youth Nationwide",
                "url": "https://finance.yahoo.com/news/bofa-launches-golf-us-bring-131000640.html"
            }
        ],
        "avgScore": 0.12321428571428576
    },
    "4 9 2025": {
        "importantArticles": [
            {
                "headline": "(Bloomberg) -- It’s possible for Apple Inc. to move iPhone production to America, but it would almost double the cost of making the device while creating logistical headaches, according to Bank of America.“iPhone cost can increase 25% purely on higher labor cost in the US,” BofA analysts led by Wamsi Mohan wrote in a note to clients on Wednesday. While the tech giant can find domestic labor for assembly, a “significant portion” of parts used in manufacturing the iPhone would still be assembled i",
                "publication_date": "2025-04-09T17:43:42.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.6956",
                "source": "Bloomberg",
                "ticker": "BAC",
                "title": "Apple’s iPhone cost could rise 90% if it’s made in US, BofA says",
                "url": "https://finance.yahoo.com/news/apple-iphone-cost-could-rise-174342086.html"
            },
            {
                "headline": "Bank of America is slated to report Q1 results on April 15. Let's analyze whether the stock is worth betting on despite the recession risk because of tariffs.",
                "publication_date": "2025-04-09T13:42:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.6182",
                "source": "Zacks",
                "ticker": "BAC",
                "title": "Is BAC Stock a Buy Before Q1 Earnings as Tariffs Stoke Recession Fear?",
                "url": "https://finance.yahoo.com/news/bac-stock-buy-q1-earnings-134200907.html"
            },
            {
                "headline": "We recently published a list of Jim Cramer Warns of a 36% Market Drop & Reviews These 9 Key Stocks. In this article, we are going to take a look at where Bank of America Corporation (NYSE:BAC) stands against other stocks Jim Cramer discusses. In his appearance on CNBC’s Squawk on the Street on Monday, […]",
                "publication_date": "2025-04-09T14:19:49.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.3612",
                "source": "Insider Monkey",
                "ticker": "BAC",
                "title": "Jim Cramer on Bank of America (BAC): “This Is Not 2007 – Don’t Panic Sell”",
                "url": "https://finance.yahoo.com/news/jim-cramer-bank-america-bac-141949981.html"
            },
            {
                "headline": "Bank of America (NYSE:BAC) recently announced a series of dividends on various preferred stock, a move that provides insight into its financial strategy amidst ongoing market volatility. Despite this, the company's stock price fell 15% last month. This decline aligns with broader market trends affected by recent tariff-related trade tensions causing uncertainty in financial markets, with the Dow and S&P 500 experiencing similar downturns. In this context, the investor activism and the...",
                "publication_date": "2025-04-09T17:43:30.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.6908",
                "source": "Simply Wall St.",
                "ticker": "BAC",
                "title": "Bank of America (NYSE:BAC) Declares Preferred Stock Dividends with US$1,268 Payout",
                "url": "https://finance.yahoo.com/news/bank-america-nyse-bac-declares-174330802.html"
            },
            {
                "headline": "We recently published a list of Jim Cramer Warns of a 36% Market Drop & Reviews These 9 Key Stocks. In this article, we are going to take a look at where Bank of America Corporation (NYSE:BAC) stands against other stocks Jim Cramer discusses. In his appearance on CNBC’s Squawk on the Street on Monday, […]",
                "publication_date": "2025-04-09T14:19:49.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.3612",
                "source": "Insider Monkey",
                "ticker": "BAC",
                "title": "Jim Cramer on Bank of America (BAC): “This Is Not 2007 – Don’t Panic Sell”",
                "url": "https://finance.yahoo.com/news/jim-cramer-bank-america-bac-141949981.html"
            },
            {
                "headline": "Bank of America is slated to report Q1 results on April 15. Let's analyze whether the stock is worth betting on despite the recession risk because of tariffs.",
                "publication_date": "2025-04-09T13:42:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.6182",
                "source": "Zacks",
                "ticker": "BAC",
                "title": "Is BAC Stock a Buy Before Q1 Earnings as Tariffs Stoke Recession Fear?",
                "url": "https://finance.yahoo.com/news/bac-stock-buy-q1-earnings-134200907.html"
            }
        ],
        "avgScore": 0.06545000000000004
    },
    "4 8 2025": {
        "importantArticles": [
            {
                "headline": "Bank of America Corporation today announced the Board of Directors has authorized regular cash dividends on the outstanding shares or depositary shares of the following series of preferred stock:",
                "publication_date": "2025-04-08T20:15:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8126",
                "source": "PR Newswire",
                "ticker": "BAC",
                "title": "Bank of America Declares Preferred Stock Dividends Payable in May and June 2025",
                "url": "https://finance.yahoo.com/news/bank-america-declares-preferred-stock-201500313.html"
            },
            {
                "headline": "Bank of America uses innovative technology to meet and anticipate the needs of its clients and 213,000 employees. For many years, this commitment has carried through in its approach to AI and machine learning. The technology is embedded today across the company's business lines and areas including global technology, operations, and training.",
                "publication_date": "2025-04-08T13:35:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7096",
                "source": "PR Newswire",
                "ticker": "BAC",
                "title": "AI Adoption by BofA's Global Workforce Improves Productivity, Client Service",
                "url": "https://finance.yahoo.com/news/ai-adoption-bofas-global-workforce-133500377.html"
            },
            {
                "headline": "Bank of America (BAC) possesses the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations.",
                "publication_date": "2025-04-08T14:00:09.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.2263",
                "source": "Zacks",
                "ticker": "BAC",
                "title": "Bank of America (BAC) Expected to Beat Earnings Estimates: Should You Buy?",
                "url": "https://finance.yahoo.com/news/bank-america-bac-expected-beat-140009970.html"
            },
            {
                "headline": "(Bloomberg) -- Wild swings lashed Wall Street for a fourth straight session as back-and-forth trade threats between the US and China knocked down stocks, erasing an earlier rally that was the biggest since 2022. The S&P 500 fell 1.6%, leaving it on the brink of a bear market.Most Read from BloombergThe Irish Hot Press Is the Low-Tech Laundry Trick the World NeedsTrump Order on CDFI Fund Risks Aid for Small Businesses, HousingThis Skinny Mexico City Tower Is Just 14 Feet Wide on One SideIn Chicag",
                "publication_date": "2025-04-08T21:16:56.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.4939",
                "source": "Bloomberg",
                "ticker": "BAC",
                "title": "Stocks Hit by Wild Volatility on US-China Threats: Markets Wrap",
                "url": "https://finance.yahoo.com/news/asian-traders-brace-swings-us-224236671.html"
            },
            {
                "headline": "The Trump tariff turmoil triggered new signs of stress on Wall Street, from a freeze in IPOs to a pause in bond sales to a widening of credit spreads.",
                "publication_date": "2025-04-08T16:08:57.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.3612",
                "source": "Yahoo Finance",
                "ticker": "BAC",
                "title": "Signs of Wall Street stress pile up amid Trump tariff turmoil",
                "url": "https://finance.yahoo.com/news/signs-of-wall-street-stress-pile-up-amid-trump-tariff-turmoil-160857268.html"
            },
            {
                "headline": "Bank of America (BAC) closed at $35.02 in the latest trading session, marking a -1.57% move from the prior day.",
                "publication_date": "2025-04-08T21:50:15.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Zacks",
                "ticker": "BAC",
                "title": "Bank of America (BAC) Stock Moves -1.57%: What You Should Know",
                "url": "https://finance.yahoo.com/news/bank-america-bac-stock-moves-215015462.html"
            }
        ],
        "avgScore": 0.12762857142857142
    },
    "coef": 0.028571428571428574,
    "avgCoef": 0.15824725628109637
}