{
    "Important Articles": [
        {
            "headline": "BP receives the Iraqi government's final approval to redevelop Kirkuk oil fields, aiming to produce more than 3 billion barrels and boost Iraq's energy sector.",
            "publication_date": "2025-03-27T16:37:00.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.7845",
            "source": "Zacks",
            "ticker": "BP",
            "title": "BP Gets Final Approval for Iraq's Kirkuk Oil Redevelopment",
            "url": "https://finance.yahoo.com/news/bp-gets-final-approval-iraqs-163700585.html"
        },
        {
            "headline": "TTE completes the acquisition of three renewable portfolios. These acquisitions should help expand its operations globally and strengthen its Integrated Power business.",
            "publication_date": "2025-04-03T12:01:00.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.743",
            "source": "Zacks",
            "ticker": "BP",
            "title": "TotalEnergies Closes Three Acquisitions, Expands Renewable Portfolio",
            "url": "https://finance.yahoo.com/news/totalenergies-closes-three-acquisitions-expands-120100173.html"
        },
        {
            "headline": "BP expands its natural gas portfolio, joining SOCAR and NewMed in exploring Israel's offshore reserves after winning six key licenses.",
            "publication_date": "2025-04-02T11:47:00.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.743",
            "source": "Zacks",
            "ticker": "BP",
            "title": "BP Secures Israeli Offshore Gas Licenses With SOCAR, NewMed",
            "url": "https://finance.yahoo.com/news/bp-secures-israeli-offshore-gas-114700632.html"
        },
        {
            "headline": "(Bloomberg) -- Shell Plc Chief Executive Officer Wael Sawan said the UK energy company will continue to look for potential acquisitions, but warned of the risks inherent in pursuing a major deal.Most Read from BloombergThey Built a Secret Apartment in a Mall. Now the Mall Is Dying.Why Did the Government Declare War on My Adorable Tiny Truck?Trump Slashed International Aid. Geneva Is Feeling the Impact.How SUVs Are Making Traffic WorseParis Votes to Make 500 More Streets Car-FreeSpeaking in a Blo",
            "publication_date": "2025-03-25T22:12:21.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.7506",
            "source": "Bloomberg",
            "ticker": "BP",
            "title": "Shell CEO Says Pursuing Major Deal Risks Being a Distraction",
            "url": "https://finance.yahoo.com/news/shell-ceo-says-pursuing-major-221221083.html"
        },
        {
            "headline": "(Bloomberg) -- Elliott Investment Management Ltd., which is in the middle of an activist campaign at BP Plc, has taken a short position equivalent to 0.5% of shares in London-based peer Shell Plc.Most Read from BloombergWhy Did the Government Declare War on My Adorable Tiny Truck?Gold-Rush Fever Returns to Historic New Zealand Mining TownHow SUVs Are Making Traffic WorseTrump Slashed International Aid. Geneva Is Feeling the Impact.These US Bridges Face High Risk of Catastrophic Ship StrikesThe s",
            "publication_date": "2025-03-28T12:59:21.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.6369",
            "source": "Bloomberg",
            "ticker": "BP",
            "title": "Elliott Takes Short Position in Shell Amid BP Activist Campaign",
            "url": "https://finance.yahoo.com/news/elliott-takes-short-position-shell-125921979.html"
        },
        {
            "headline": "Elliott Management is pressuring BP for deeper cost cuts, asset sales and leadership changes as the oil giant pivots back to hydrocarbons.",
            "publication_date": "2025-03-26T11:02:00.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.2732",
            "source": "Zacks",
            "ticker": "BP",
            "title": "BP's Strategy Under Scrutiny as Elliott Pushes for Further Changes",
            "url": "https://finance.yahoo.com/news/bps-strategy-under-scrutiny-elliott-110200949.html"
        }
    ],
    "Avg Score": 0.16492352941176472
}