{
    "Important Articles": [
        {
            "headline": "Citigroup (NYSE: C) has had a great run over the past six months, rising more than 22% over the span.  There was probably a time when Citigroup's shares were a bargain, but that time doesn't appear to be now.  The stock's performance over the last six months speaks to a company that has clearly been much loved by investors, and that love has had an almost inevitable effect.",
            "publication_date": "2025-03-28T08:35:00.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.965",
            "source": "Motley Fool",
            "ticker": "C",
            "title": "1 Magnificent High-Yield Bank Stock Down 30% to Buy and Hold Forever",
            "url": "https://finance.yahoo.com/news/1-magnificent-high-yield-bank-083500261.html"
        },
        {
            "headline": "CVS Health, Ulta Beauty, Progressive, AMD and Citigroup are part of the Zacks top Analyst Blog.",
            "publication_date": "2025-03-28T15:16:00.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.6808",
            "source": "Zacks",
            "ticker": "C",
            "title": "The Zacks Analyst Blog Highlights CVS Health, Ulta Beauty, Progressive, AMD and Citigroup",
            "url": "https://finance.yahoo.com/news/zacks-analyst-blog-highlights-cvs-151600921.html"
        },
        {
            "headline": "Unlock strong returns with these top female-led firms.",
            "publication_date": "2025-03-27T13:49:00.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.6249",
            "source": "Zacks",
            "ticker": "C",
            "title": "Top Women-Run Company Stocks to Enrich Your Portfolio",
            "url": "https://finance.yahoo.com/news/top-women-run-company-stocks-134900279.html"
        },
        {
            "headline": "(Bloomberg) -- Oil edged higher as signs of tighter near-term supply-and-demand balances overshadowed an intensifying global trade war that threatens to crimp global energy consumption. Most Read from BloombergWhy Did the Government Declare War on My Adorable Tiny Truck?How SUVs Are Making Traffic WorseGold-Rush Fever Returns to Historic New Zealand Mining TownTrump Slashed International Aid. Geneva Is Feeling the Impact.These US Bridges Face High Risk of Catastrophic Ship StrikesWest Texas Inte",
            "publication_date": "2025-03-27T19:16:58.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.8957",
            "source": "Bloomberg",
            "ticker": "C",
            "title": "Oil Edges Up as US Stockpile Decline Overshadows Wider Trade War",
            "url": "https://finance.yahoo.com/news/oil-holds-gain-us-posts-233047175.html"
        },
        {
            "headline": "(Bloomberg) -- Goldman Sachs Group Inc. strategists cut their targets on European stocks due to the expected hit from President Donald Trump’s tariffs, making a contrarian bet at a time when the region has beaten US peers by a record.Most Read from BloombergWhat Frank Lloyd Wright Learned From the DesertGold-Rush Fever Returns to Historic New Zealand Mining TownBank Regulators Fight for Desks as OCC Returns to New York TowerLondon Clears Final Hurdle for More High-Speed Trains to EuropeThe team",
            "publication_date": "2025-04-01T08:42:11.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.7351",
            "source": "Bloomberg",
            "ticker": "C",
            "title": "Goldman Strategists Cut European Stock Targets on US Tariff Threat",
            "url": "https://finance.yahoo.com/news/goldman-strategists-cut-european-stock-084211659.html"
        },
        {
            "headline": "(Bloomberg) -- Roughly $2.5 trillion was erased from the S&P 500 Index on Thursday amid worries that President Donald Trump’s sweeping new round of tariffs could plunge the economy into a recession.Most Read from BloombergHousing Agency Aims to Relocate Its DC HeadquartersMetro-North Is Faster Than Acela on NYC-New Haven Route After Signal UpdatesLocal Governments Vie for Fired Federal WorkersLondon Clears Final Hurdle for More High-Speed Trains to EuropeWhat Would ‘Transportation Abundance’ Loo",
            "publication_date": "2025-04-03T20:13:46.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.7269",
            "source": "Bloomberg",
            "ticker": "C",
            "title": "Trump Tariffs Wipe Out $2.5 Trillion From US Stock Market",
            "url": "https://finance.yahoo.com/news/trump-tariffs-set-wipe-nearly-120038363.html"
        }
    ],
    "Avg Score": -0.13553684210526318
}