{
    "importantArticles": [
        {
            "headline": "We recently published a list of Starter Stock Portfolio 12 Safe Stocks to Buy. In this article, we are going to take a look at where Citigroup Inc. (NYSE:C) stands against other best beginner stocks. The US stock market has experienced a turbulent first quarter of 2025, marked by increased volatility and negative returns across […]",
            "publication_date": "2025-04-06T20:55:26.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.6705",
            "source": "Insider Monkey",
            "ticker": "C",
            "title": "Citigroup Inc. (C): Among the Best Beginner Stocks",
            "url": "https://finance.yahoo.com/news/citigroup-inc-c-among-best-205526842.html"
        },
        {
            "headline": "Banks are set to kick off first quarter earnings season next week. Bloomberg Intelligence director of research global strategy team Alison Williams joins Catalyst with host Madison Mills to discuss what investors can expect from bank earnings. To watch more expert insights and analysis on the latest market action, check out more Catalysts here.",
            "publication_date": "2025-04-04T15:23:14.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.4767",
            "source": "Yahoo Finance Video",
            "ticker": "C",
            "title": "Banks to kick off earnings: 'Credit risk' will become key concern",
            "url": "https://finance.yahoo.com/video/banks-kick-off-earnings-credit-152314153.html"
        },
        {
            "headline": "Exploring Citigroup's Growth Potential in Emerging Markets",
            "publication_date": "2025-04-04T18:48:56.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.3818",
            "source": "GuruFocus.com",
            "ticker": "C",
            "title": "Citigroup's Transformation: What Investors Need to Know",
            "url": "https://finance.yahoo.com/news/citigroups-transformation-investors-know-184856422.html"
        },
        {
            "headline": "(Bloomberg) -- A Texas experiment to fund new natural gas-burning power plants with $5 billion in public loans is faltering as several of the proposed facilities drop out, threatening the state’s efforts to meet growing electricity demand. Most Read from BloombergHousing Agency Aims to Relocate Its DC HeadquartersThis Skinny Mexico City Tower Is Just 14 Feet Wide on One SideBoston Mayor Wu Embraces Trump Resistance as Campaign Heats UpLocal Governments Vie for Fired Federal WorkersMetro-North Is",
            "publication_date": "2025-04-05T14:00:02.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.7506",
            "source": "Bloomberg",
            "ticker": "C",
            "title": "Texas Attempt to Kickstart New Gas-Fired Power Is Stumbling",
            "url": "https://finance.yahoo.com/news/texas-attempt-kickstart-gas-fired-140002983.html"
        },
        {
            "headline": "(Bloomberg) -- Goldman Sachs Group Inc. strategists cut their targets on European stocks due to the expected hit from President Donald Trump’s tariffs, making a contrarian bet at a time when the region has beaten US peers by a record.Most Read from BloombergWhat Frank Lloyd Wright Learned From the DesertGold-Rush Fever Returns to Historic New Zealand Mining TownBank Regulators Fight for Desks as OCC Returns to New York TowerLondon Clears Final Hurdle for More High-Speed Trains to EuropeThe team",
            "publication_date": "2025-04-01T08:42:11.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.7351",
            "source": "Bloomberg",
            "ticker": "C",
            "title": "Goldman Strategists Cut European Stock Targets on US Tariff Threat",
            "url": "https://finance.yahoo.com/news/goldman-strategists-cut-european-stock-084211659.html"
        },
        {
            "headline": "(Bloomberg) -- Roughly $2.5 trillion was erased from the S&P 500 Index on Thursday amid worries that President Donald Trump’s sweeping new round of tariffs could plunge the economy into a recession.Most Read from BloombergHousing Agency Aims to Relocate Its DC HeadquartersMetro-North Is Faster Than Acela on NYC-New Haven Route After Signal UpdatesLocal Governments Vie for Fired Federal WorkersLondon Clears Final Hurdle for More High-Speed Trains to EuropeWhat Would ‘Transportation Abundance’ Loo",
            "publication_date": "2025-04-03T20:13:46.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.7269",
            "source": "Bloomberg",
            "ticker": "C",
            "title": "Trump Tariffs Wipe Out $2.5 Trillion From US Stock Market",
            "url": "https://finance.yahoo.com/news/trump-tariffs-set-wipe-nearly-120038363.html"
        }
    ],
    "avgScore": -0.2734842105263158,
    "todayPctChange": -0.039698332257149915,
    "vScore": 1.085686705655802
}