{
    "Important Articles": [
        {
            "headline": "Wyndham Rewards members looking to set sail on a Carnival cruise now have a new way to book and save. Starting today, Wyndham Rewards members can book Carnival Cruise Line vacations through Wyndham Travel Bundles, making it easier than ever to plan an entire trip while earning Wyndham Rewards points for every aspect of their booking.",
            "publication_date": "2025-03-26T12:00:00.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.936",
            "source": "PR Newswire",
            "ticker": "CCL",
            "title": "Set Sail for Fun: Wyndham Rewards Now Offers Points and Special Discounts on Carnival Cruise Line Bookings",
            "url": "https://finance.yahoo.com/news/set-sail-fun-wyndham-rewards-120000448.html"
        },
        {
            "headline": "Marking an exciting new chapter for Carnival Cruise Line as Australia's leading cruise operator, Carnival Adventure and Carnival Encounter are preparing to embark on their maiden voyages, delivering more signature Carnival fun to guests departing from Sydney and Brisbane. With the addition of these two ships, Carnival Cruise Line now has the largest fleet of ships in its 53-year history, totaling 29 ships.",
            "publication_date": "2025-03-28T13:00:00.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.8428",
            "source": "PR Newswire",
            "ticker": "CCL",
            "title": "G'DAY, CARNIVAL ADVENTURE AND CARNIVAL ENCOUNTER! TWO SHIPS OFFICIALLY JOIN CARNIVAL FLEET IN AUSTRALIA",
            "url": "https://finance.yahoo.com/news/gday-carnival-adventure-carnival-encounter-130000895.html"
        },
        {
            "headline": "Carnival (NYSE: CCL) (NYSE: CUK) suffered during the early days of the pandemic, but this cruise giant has proven its ability to weather tough times -- and go on to recover and grow.  The company has soared past analysts' earnings estimates quarter after quarter and reported various records, from revenue levels to bookings.  This is all due to renewed demand for cruise travel, Carnival's leadership in the market (it's the world's largest cruise operator), and the company's efforts to favor growth and profitability.",
            "publication_date": "2025-03-20T08:53:00.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.8381",
            "source": "Motley Fool",
            "ticker": "CCL",
            "title": "Could This Bull Market Buy Help You Become a Millionaire?",
            "url": "https://finance.yahoo.com/news/could-bull-market-buy-help-085300847.html"
        },
        {
            "headline": "We recently published a list of Was Jim Cramer Right About These 23 Stocks?. In this article, we are going to take a look at where Carnival Corporation & plc (NYSE:CCL) stands against other stocks that Jim Cramer discussed 12 months ago. During the latest episode of Mad Money, Jim Cramer advised his viewers to […]",
            "publication_date": "2025-03-22T21:06:05.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.4939",
            "source": "Insider Monkey",
            "ticker": "CCL",
            "title": "Was Jim Cramer Right About Carnival Corporation & plc (CCL)?",
            "url": "https://finance.yahoo.com/news/jim-cramer-carnival-corporation-plc-210605519.html"
        },
        {
            "headline": "While reporting fiscal first quarter results, cruise line operator Carnival Corporation's (CCL) adjusted EBITDA guidance for the second quarter missed Wall Street's expectations. Brad Smith and Julie Hyman talk more about Carnival's latest numbers while referencing the company's demand and bookings numbers. To watch more expert insights and analysis on the latest market action, check out more Wealth&nbsp;here.",
            "publication_date": "2025-03-21T15:38:58.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.4019",
            "source": "Yahoo Finance Video",
            "ticker": "CCL",
            "title": "Carnival stock fluctuates as it reports continued demand",
            "url": "https://finance.yahoo.com/video/carnival-stock-fluctuates-reports-continued-153858319.html"
        },
        {
            "headline": "On a per-share basis, the Miami-based company said it had a loss of 6 cents. Earnings, adjusted to extinguish debt, came to 13 cents per share. The results exceeded Wall Street expectations.",
            "publication_date": "2025-03-21T13:21:52.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.3818",
            "source": "Associated Press Finance",
            "ticker": "CCL",
            "title": "Carnival: Fiscal Q1 Earnings Snapshot",
            "url": "https://finance.yahoo.com/news/carnival-fiscal-q1-earnings-snapshot-132152945.html"
        }
    ],
    "Avg Score": 0.2821078947368422
}