{
    "importantArticles": [
        {
            "headline": "Wyndham Rewards members looking to set sail on a Carnival cruise now have a new way to book and save. Starting today, Wyndham Rewards members can book Carnival Cruise Line vacations through Wyndham Travel Bundles, making it easier than ever to plan an entire trip while earning Wyndham Rewards points for every aspect of their booking.",
            "publication_date": "2025-03-26T12:00:00.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.936",
            "source": "PR Newswire",
            "ticker": "CCL",
            "title": "Set Sail for Fun: Wyndham Rewards Now Offers Points and Special Discounts on Carnival Cruise Line Bookings",
            "url": "https://finance.yahoo.com/news/set-sail-fun-wyndham-rewards-120000448.html"
        },
        {
            "headline": "Marking an exciting new chapter for Carnival Cruise Line as Australia's leading cruise operator, Carnival Adventure and Carnival Encounter are preparing to embark on their maiden voyages, delivering more signature Carnival fun to guests departing from Sydney and Brisbane. With the addition of these two ships, Carnival Cruise Line now has the largest fleet of ships in its 53-year history, totaling 29 ships.",
            "publication_date": "2025-03-28T13:00:00.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.8428",
            "source": "PR Newswire",
            "ticker": "CCL",
            "title": "G'DAY, CARNIVAL ADVENTURE AND CARNIVAL ENCOUNTER! TWO SHIPS OFFICIALLY JOIN CARNIVAL FLEET IN AUSTRALIA",
            "url": "https://finance.yahoo.com/news/gday-carnival-adventure-carnival-encounter-130000895.html"
        },
        {
            "headline": "Carnival benefits from robust booking trends, with record-high pricing and strong occupancy levels.",
            "publication_date": "2025-03-27T19:00:00.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.8074",
            "source": "Zacks",
            "ticker": "CCL",
            "title": "CCL Stock Slips 13% in a Month - Buy the Dip or Stay on Sidelines?",
            "url": "https://finance.yahoo.com/news/ccl-stock-slips-13-month-190000921.html"
        },
        {
            "headline": "We recently published a list of Was Jim Cramer Right About These 23 Stocks?. In this article, we are going to take a look at where Carnival Corporation & plc (NYSE:CCL) stands against other stocks that Jim Cramer discussed 12 months ago. During the latest episode of Mad Money, Jim Cramer advised his viewers to […]",
            "publication_date": "2025-03-22T21:06:05.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.4939",
            "source": "Insider Monkey",
            "ticker": "CCL",
            "title": "Was Jim Cramer Right About Carnival Corporation & plc (CCL)?",
            "url": "https://finance.yahoo.com/news/jim-cramer-carnival-corporation-plc-210605519.html"
        },
        {
            "headline": "The majority of investors aren't seeing past the pessimism to understand how well this company is doing.",
            "publication_date": "2025-03-27T09:05:00.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.1027",
            "source": "Motley Fool",
            "ticker": "CCL",
            "title": "1 Growth Stock Down 69% to Buy Right Now",
            "url": "https://finance.yahoo.com/news/1-growth-stock-down-69-090500874.html"
        },
        {
            "headline": "This is the moment that Queen Elizabeth met Cunard's newest ship, Queen Anne for the very first time as the iconic Queens docked together in Hong Kong.",
            "publication_date": "2025-04-02T15:55:00.000Z",
            "sentiment": "Neutral",
            "sentimentScore": "0.0",
            "source": "CNW Group",
            "ticker": "CCL",
            "title": "Queen Elizabeth joins Queen Anne in Hong Kong for first meeting with sister ship",
            "url": "https://finance.yahoo.com/news/queen-elizabeth-joins-queen-anne-155500645.html"
        }
    ],
    "avgScore": 0.3346105263157895,
    "todayPctChange": -0.0060277504852299475,
    "vScore": -0.20169487623630486
}