{
    "Important Articles": [
        {
            "headline": "The United States market has seen a positive trend, with a 1.0% increase over the last week and an impressive 32% rise over the past year, while earnings are forecast to grow by 16% annually. In this favorable environment, identifying high growth tech stocks involves looking for companies that demonstrate strong innovation and potential to capitalize on expanding market opportunities.",
            "publication_date": "2024-12-09T14:12:05.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.977",
            "source": "Simply Wall St.",
            "ticker": "CORZ",
            "title": "High Growth Tech Stocks To Watch In December 2024",
            "url": "https://finance.yahoo.com/news/high-growth-tech-stocks-watch-141205676.html"
        },
        {
            "headline": "Over the last 7 days, the United States market has remained flat, yet it has seen a robust increase of 25% over the past year with earnings forecasted to grow by 15% annually. In this dynamic environment, identifying high growth tech stocks requires a focus on companies with strong innovation potential and scalability that align well with these positive market trends.",
            "publication_date": "2025-01-17T18:02:45.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.9709",
            "source": "Simply Wall St.",
            "ticker": "CORZ",
            "title": "Exploring High Growth Tech Stocks In The United States January 2025",
            "url": "https://finance.yahoo.com/news/exploring-high-growth-tech-stocks-180245499.html"
        },
        {
            "headline": "Nvidia (NVDA) has been a market superstar, up about 190% over the last year. A lot of investors bought in early and got some great profits, but now they are starting to look at how to spread that wealth. Kineo Capital Managing Partner Jim Strugger tells Yahoo Finance he is hearing from investors who want to stay long Nvidia, but also want to reduce their exposure and play other aspects of the AI space. Strugger says that there are plenty of industrial stocks that investors can buy to play the AI trend. He also names Core Scientific (CORZ) as a potential play because it is expanding beyond bitcoin mining to be more about \"high-performance compute.\" How do you play those two stocks in the options market? Watch the video above to find out. For more expert insight and the latest market action, click here to watch this full episode of Market Domination Overtime. This post was written by Stephanie Mikulich.",
            "publication_date": "2024-09-27T21:12:38.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.9674",
            "source": "Yahoo Finance Video",
            "ticker": "CORZ",
            "title": "How to play Nvidia, Core Scientific with options",
            "url": "https://finance.yahoo.com/video/play-nvidia-core-scientific-options-211238768.html"
        },
        {
            "headline": "(Bloomberg) -- CoreWeave Inc., a closely held cloud computing provider, has offered to acquire Bitcoin miner Core Scientific Inc. for about $1 billion, a person with knowledge of the matter said.Most Read from BloombergBehind ‘Suicide Squad,’ the Year’s Biggest Video-Game FlopReal Estate Investors Are Wiped Out in Bets Fueled by Wall Street LoansBillionaire-Friendly Modi Humbled by Indians Who Make $4 a DayVietnam Tycoon Sentenced to Death Faces New Charges: MediaA Struggling Business Park Deals",
            "publication_date": "2024-06-04T16:12:49.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.8316",
            "source": "Bloomberg",
            "ticker": "CORZ",
            "title": "CoreWeave Offers About $1 Billion for Core Scientific",
            "url": "https://finance.yahoo.com/news/coreweave-offers-1-billion-core-140321199.html"
        },
        {
            "headline": "(Bloomberg) -- Shares of Coinbase Global Inc. and other firms linked to cryptocurrencies were hammered this quarter as growing concerns about the US economy weighed on digital assets. Most Read from BloombergGold-Rush Fever Returns to Historic New Zealand Mining TownWhat Frank Lloyd Wright Learned From the DesertBank Regulators Fight for Desks as OCC Returns to New York TowerCoinbase fell 31% in the worst quarterly performance since FTX collapsed near the end of 2022. Nearly every major crypto-l",
            "publication_date": "2025-03-31T20:18:26.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.6369",
            "source": "Bloomberg",
            "ticker": "CORZ",
            "title": "Coinbase Shares Head for Worst Quarter Since FTX Collapse as Crypto Slumps",
            "url": "https://finance.yahoo.com/news/coinbase-shares-head-worst-quarter-201826737.html"
        },
        {
            "headline": "AUSTIN, Texas, June 06, 2024--Core Scientific Rejects Unsolicited Proposal from CoreWeave",
            "publication_date": "2024-06-06T12:10:00.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.4939",
            "source": "Business Wire",
            "ticker": "CORZ",
            "title": "Core Scientific Rejects Unsolicited Proposal from CoreWeave",
            "url": "https://finance.yahoo.com/news/core-scientific-rejects-unsolicited-proposal-121000462.html"
        }
    ],
    "Avg Score": 0.30863076923076926
}