{
    "Important Articles": [
        {
            "headline": "Over the past six months, Cisco has been a great trade. While the S&P 500 was flat, the stock price has climbed by 20.2% to $60.80 per share. This was partly thanks to its solid quarterly results, and the performance may have investors wondering how to approach the situation.",
            "publication_date": "2025-03-18T09:08:04.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.8593",
            "source": "StockStory",
            "ticker": "CSCO",
            "title": "3 Reasons CSCO is Risky and 1 Stock to Buy Instead",
            "url": "https://finance.yahoo.com/news/3-reasons-csco-risky-1-090804481.html"
        },
        {
            "headline": "GTC -- Cisco [NASDAQ: CSCO] today unveiled an AI factory architecture with NVIDIA that puts security at its core. This collaboration with NVIDIA builds on the expanded partnership that was announced last month, and the companies have moved swiftly to provide validated reference architectures today. Together, the companies are developing the Cisco Secure AI Factory with NVIDIA to dramatically simplify how enterprises deploy, manage, and secure AI infrastructure at any scale.",
            "publication_date": "2025-03-18T20:00:00.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.8519",
            "source": "CNW Group",
            "ticker": "CSCO",
            "title": "Cisco to Deliver Secure AI Infrastructure with NVIDIA",
            "url": "https://finance.yahoo.com/news/cisco-deliver-secure-ai-infrastructure-200000084.html"
        },
        {
            "headline": "It's home to many of the trillion-dollar tech giants that lead the artificial intelligence (AI) industry, so it has delivered spectacular returns over the last couple of years.  The Invesco QQQ Trust (NASDAQ: QQQ) is an exchange-traded fund (ETF) that tracks the performance of the Nasdaq-100 by holding the same stocks and maintaining similar weightings.  The Nasdaq-100 is weighted by market capitalization, meaning its largest constituents have a greater influence over its performance than the smallest.",
            "publication_date": "2025-04-01T08:27:00.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.836",
            "source": "Motley Fool",
            "ticker": "CSCO",
            "title": "Should You Buy the Invesco QQQ ETF During the Nasdaq Correction? History Offers a Clear Answer.",
            "url": "https://finance.yahoo.com/news/buy-invesco-qqq-etf-during-082700387.html"
        },
        {
            "headline": "CISA earlier this week added CVE-2024-20439, a static credential vulnerability in the license management app, to its known exploited vulnerabilities catalog.",
            "publication_date": "2025-04-03T11:23:00.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.6705",
            "source": "Cybersecurity Dive",
            "ticker": "CSCO",
            "title": "Cisco confirms cyberattacks on Smart Licensing Utility flaw",
            "url": "https://finance.yahoo.com/news/cisco-confirms-cyberattacks-smart-licensing-112300561.html"
        },
        {
            "headline": "We recently published a list of Did Jim Cramer Nail or Miss These 14 Stocks? In this article, we are going to take a look at where Cisco Systems, Inc. (NASDAQ:CSCO) stands against other stocks that Jim Cramer discusses. During the most recent episode of Mad Money, Jim Cramer described the current stock market as […]",
            "publication_date": "2025-03-27T17:12:59.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.5859",
            "source": "Insider Monkey",
            "ticker": "CSCO",
            "title": "Cisco Systems, Inc. (CSCO) – Jim Cramer’s Take on the NVIDIA Partnership and Future Growth",
            "url": "https://finance.yahoo.com/news/cisco-systems-inc-csco-jim-171259545.html"
        },
        {
            "headline": "The SANS Internet Storm Center reported exploitation attempts against two critical vulnerabilities, which were initially disclosed in September.",
            "publication_date": "2025-03-20T10:23:40.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.4404",
            "source": "Cybersecurity Dive",
            "ticker": "CSCO",
            "title": "Cisco Smart Licensing Utility flaws under attack",
            "url": "https://finance.yahoo.com/news/cisco-smart-licensing-utility-flaws-102340497.html"
        }
    ],
    "Avg Score": 0.33116571428571434
}