{
    "importantArticles": [
        {
            "headline": "We recently published a list of 10 Best Construction Materials Stocks To Buy Now. In this article, we are going to take a look at where CEMEX, S.A.B. de C.V. (NYSE:CX) stands against the other best construction materials stocks. The New Administration: Implications for the Building Materials and Construction Sector Donald Trump’s policy agenda including […]",
            "publication_date": "2024-11-29T08:08:16.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.8555",
            "source": "Insider Monkey",
            "ticker": "CX",
            "title": "Why CEMEX, S.A.B. de C.V. (CX) Is One of the Best Construction Materials Stocks to Buy Now?",
            "url": "https://finance.yahoo.com/news/why-cemex-b-c-v-080816300.html"
        },
        {
            "headline": "Cemex SAB (CX) has released an update. Cemex SAB has successfully sold its operations in the Philippines, securing approximately $800 million through agreements with DACON Corporation, DMCI Holdings, Inc., and Semirara Mining & Power Corporation. The transaction involves divesting a 100% equity interest in Cemex Asian South East Corporation and other related assets, with the buyers assuming $387 million in financial debt. This move marks Cemex’s strategic exit from the Philippine market, potenti",
            "publication_date": "2024-12-03T11:31:41.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.8316",
            "source": "TipRanks",
            "ticker": "CX",
            "title": "Cemex SAB Completes $800 Million Philippines Exit",
            "url": "https://finance.yahoo.com/news/cemex-sab-completes-800-million-113141146.html"
        },
        {
            "headline": "We recently compiled a list of the 10 Best Construction Stocks to Buy Now. In this article, we are going to take a look at where CEMEX, S.A.B. de C.V. (NYSE:CX) stands against the other construction stocks. As per Cumming Group, which provides project and cost-management services, the construction industry kicked off 2025 with a healthy momentum, […]",
            "publication_date": "2025-02-28T22:06:10.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.7845",
            "source": "Insider Monkey",
            "ticker": "CX",
            "title": "Is CEMEX, S.A.B. de C.V. (CX) the Best Construction Stock to Buy Now?",
            "url": "https://finance.yahoo.com/news/cemex-b-c-v-cx-220610133.html"
        },
        {
            "headline": "RBC Capital Markets has downgraded Cemex SAB de CV (NYSE:CX) to \"underperform,\" citing heightened risks tied to the company's heavy reliance on the U.S.-Mexico trade relationship.  The downgrade, accompanied by a reduction in the stock's price target to $5 from $6, comes in the wake of the recent U.S. presidential election, which has introduced uncertainty around potential trade tariffs and import policies.  Analysts said that the potential for a 25% tariff on Mexican goods, a measure that could significantly disrupt Cemex's operations and revenue streams.",
            "publication_date": "2024-12-11T11:18:53.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.5423",
            "source": "Investing.com",
            "ticker": "CX",
            "title": "Cemex stock downgraded amid US-Mexico trade risks",
            "url": "https://finance.yahoo.com/news/cemex-stock-downgraded-amid-us-111853297.html"
        },
        {
            "headline": "The bridge will enhance transportation infrastructure for the Tampa and St. Petersburg areas.",
            "publication_date": "2024-12-10T10:03:42.000Z",
            "sentiment": "Neutral",
            "sentimentScore": "0.0",
            "source": "World Construction Network",
            "ticker": "CX",
            "title": "Cemex supports $865m Howard Frankland bridge construction in Florida",
            "url": "https://finance.yahoo.com/news/cemex-supports-865m-howard-frankland-100342751.html"
        },
        {
            "headline": "From an AI chatbot plumbing project specs to cosmic rays peering inside infrastructure, the Cemex Ventures-led annual contest surfaced an array of emerging construction tech.",
            "publication_date": "2024-10-23T14:10:00.000Z",
            "sentiment": "Neutral",
            "sentimentScore": "0.0",
            "source": "Construction Dive",
            "ticker": "CX",
            "title": "Contech startup contest taps 8 finalists",
            "url": "https://finance.yahoo.com/news/contech-startup-contest-taps-8-141000190.html"
        }
    ],
    "avgScore": 0.4508599999999999,
    "todayPctChange": -0.021883966784186682,
    "vScore": -0.9866605264318407
}