{
    "importantArticles": [
        {
            "headline": "Dun & Bradstreet has agreed to be acquired by private-equity firm Clearlake Capital for $4.1 billion, the data and analytics provider said on Monday, putting an end to its second stint as a public company after its stock-market listing more than four years ago.  Its shares are down nearly 30% this year and about 60% since going public in 2020, making it an attractive target for Clearlake.  Analysts have also pointed to its healthy free cash flow and potential for growth in revenue and margins as some of the factors that made it ripe for a takeover.",
            "publication_date": "2025-03-24T11:43:09.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.93",
            "source": "Reuters",
            "ticker": "DNB",
            "title": "PE firm Clearlake to buy Dun & Bradstreet for $4.1 billion in cash",
            "url": "https://finance.yahoo.com/news/pe-firm-clearlake-buy-dun-114309190.html"
        },
        {
            "headline": "SANTA MONICA, Calif. & JACKSONVILLE, Fla., March 24, 2025--Clearlake Capital Group, L.P., (together with certain of its affiliates, \"Clearlake\"), today announced that it has entered into a definitive agreement to acquire Dun & Bradstreet Holdings, Inc. (\"Dun & Bradstreet\") (NYSE: DNB), a leading global provider of business decisioning data and analytics, in a transaction valued at $7.7 billion, including outstanding debt / with an equity value of $4.1 billion.",
            "publication_date": "2025-03-24T11:30:00.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.9022",
            "source": "Business Wire",
            "ticker": "DNB",
            "title": "Dun & Bradstreet Enters Into a Definitive Agreement To Be Acquired by Clearlake Capital Group",
            "url": "https://finance.yahoo.com/news/dun-bradstreet-enters-definitive-agreement-113000569.html"
        },
        {
            "headline": "Stock index futures are experiencing a notable surge, reflecting renewed investor optimism, primarily driven by reports suggesting that the U.S. administration may reduce the scope of proposed tariffs, potentially excluding certain sectors. Such developments have bolstered market sentiment, leading to premarket gains across major indices. ​ In the commodities market, oil prices have experienced a slight decline as investors closely monitor ongoing ceasefire talks between Russia and Ukraine. The",
            "publication_date": "2025-03-25T13:00:27.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.7906",
            "source": "TipRanks",
            "ticker": "DNB",
            "title": "Morning Movers: 23andMe plummets after Chapter 11 proceedings and CEO exit",
            "url": "https://finance.yahoo.com/news/morning-movers-23andme-plummets-chapter-130027414.html"
        },
        {
            "headline": "(Bloomberg) -- Clearlake Capital Group has lined up $5.75 billion of debt financing to help pay for its planned acquisition of data and analytics provider Dun & Bradstreet Holdings Inc., according to a securities filing on Monday.Most Read from BloombergThey Built a Secret Apartment in a Mall. Now the Mall Is Dying.Why Did the Government Declare War on My Adorable Tiny Truck?Chicago Transit Faces ‘Doomsday Scenario,’ Regional Agency SaysLA Faces $1 Billion Budget Hole, Warns of Thousands of Layo",
            "publication_date": "2025-03-24T22:51:46.000Z",
            "sentiment": "Neutral",
            "sentimentScore": "-0.0258",
            "source": "Bloomberg",
            "ticker": "DNB",
            "title": "Clearlake Gets $5.75 Billion Loan for Dun & Bradstreet Deal",
            "url": "https://finance.yahoo.com/news/morgan-stanley-leads-6-billion-170925702.html"
        },
        {
            "headline": "Wrapping up Q4 earnings, we look at the numbers and key takeaways for the data & business process services stocks, including CoStar (NASDAQ:CSGP) and its peers.",
            "publication_date": "2025-04-02T09:12:35.000Z",
            "sentiment": "Neutral",
            "sentimentScore": "0.0",
            "source": "StockStory",
            "ticker": "DNB",
            "title": "Reflecting On Data & Business Process Services Stocks’ Q4 Earnings: CoStar (NASDAQ:CSGP)",
            "url": "https://finance.yahoo.com/news/reflecting-data-business-process-services-091235954.html"
        },
        {
            "headline": "Dun & Bradstreet’s stock price has taken a beating over the past six months, shedding 22.3% of its value and falling to $8.94 per share. This was partly driven by its softer quarterly results and may have investors wondering how to approach the situation.",
            "publication_date": "2025-04-01T09:05:35.000Z",
            "sentiment": "Neutral",
            "sentimentScore": "-0.0",
            "source": "StockStory",
            "ticker": "DNB",
            "title": "3 Reasons to Sell DNB and 1 Stock to Buy Instead",
            "url": "https://finance.yahoo.com/news/3-reasons-sell-dnb-1-090535443.html"
        }
    ],
    "avgScore": 0.3498428571428572,
    "todayPctChange": -0.016910892949895326,
    "vScore": -0.5916155106428381
}