{
    "importantArticles": [
        {
            "headline": "Vonage, a global leader in cloud communications and a part of Ericsson (NASDAQ: ERIC), has been named a Gold winner in both the 5G Networks and 5G Innovation of the Year categories at the Merit Awards for Telecom 2025. This recognition underscores Vonage's pivotal role in shaping the future of 5G technology through its innovative network APIs, which enable businesses to accelerate digital transformation across industries.",
            "publication_date": "2025-02-27T08:00:00.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.9337",
            "source": "PR Newswire",
            "ticker": "ERIC",
            "title": "Vonage Recognized for 5G Innovation with Gold Merit Awards for Telecom 2025",
            "url": "https://finance.yahoo.com/news/vonage-recognized-5g-innovation-gold-080000087.html"
        },
        {
            "headline": "In March 2025, the European market is navigating a complex landscape characterized by concerns over U.S. trade tariffs, economic growth uncertainties, and fluctuating monetary policies. Despite these challenges, high growth tech stocks in Europe continue to attract attention as investors seek opportunities that align with resilient business models and innovative capabilities capable of weathering broader market volatility.",
            "publication_date": "2025-03-19T05:08:15.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.9038",
            "source": "Simply Wall St.",
            "ticker": "ERIC",
            "title": "High Growth Tech Stocks In Europe March 2025",
            "url": "https://finance.yahoo.com/news/high-growth-tech-stocks-europe-050815831.html"
        },
        {
            "headline": "Hotchkis & Wiley, an investment management company, released its “Hotchkis & Wiley Mid-Cap Value Fund” fourth quarter 2024 investor letter. A copy of the letter can be downloaded here. The Hotchkis & Wiley Mid-Cap Value Fund returned -2.39% in the fourth quarter, underperforming the Russell Midcap Value Index’s -1.75% return. The portfolio underperformed the index […]",
            "publication_date": "2025-03-31T13:31:29.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.7351",
            "source": "Insider Monkey",
            "ticker": "ERIC",
            "title": "Here’s Why Telefonaktiebolaget LM Ericsson (publ) (ERIC) Surged in Q4",
            "url": "https://finance.yahoo.com/news/why-telefonaktiebolaget-lm-ericsson-publ-133129227.html"
        },
        {
            "headline": "We recently published a list of 9 AI News and Ratings on Investors’ Radar. In this article, we are going to take a look at where Telefonaktiebolaget LM Ericsson (publ) (NASDAQ:ERIC) stands against other AI news and ratings on investors’ radar. According to a Reuters report posted on March 25, Chinese AI firms have made […]",
            "publication_date": "2025-03-28T22:10:52.000Z",
            "sentiment": "Neutral",
            "sentimentScore": "0.0",
            "source": "Insider Monkey",
            "ticker": "ERIC",
            "title": "Telefonaktiebolaget LM Ericsson (ERIC) Partners with SoftBank to Bring AI and 6G to Japan – A Tech Leap Forward!",
            "url": "https://finance.yahoo.com/news/telefonaktiebolaget-lm-ericsson-eric-partners-221052623.html"
        },
        {
            "headline": "Major telecom companies in Zimbabwe and Angola select ERIC's industry-leading portfolio to modernize their network infrastructure.",
            "publication_date": "2025-03-10T15:37:00.000Z",
            "sentiment": "Neutral",
            "sentimentScore": "0.0",
            "source": "Zacks",
            "ticker": "ERIC",
            "title": "Ericsson Boosts Digital Infrastructure in Africa: Stock to Gain?",
            "url": "https://finance.yahoo.com/news/ericsson-boosts-digital-infrastructure-africa-153700170.html"
        },
        {
            "headline": "Telefonaktiebolaget LM Ericsson (NASDAQ: ERIC) (the \"Company\") held its Annual General Meeting (\"AGM\") today on March 25, 2025 in Kista, Stockholm. Shareholders were also able to exercise their voting rights by post before the meeting.",
            "publication_date": "2025-03-25T18:58:00.000Z",
            "sentiment": "Neutral",
            "sentimentScore": "0.0",
            "source": "PR Newswire",
            "ticker": "ERIC",
            "title": "Ericsson's Annual General Meeting 2025",
            "url": "https://finance.yahoo.com/news/ericssons-annual-general-meeting-2025-185800815.html"
        }
    ],
    "avgScore": 0.451475,
    "todayPctChange": -0.030813735530813867,
    "vScore": -1.391163124877419
}