{
    "Important Articles": [
        {
            "headline": "Ericsson (NASDAQ:ERIC) shares are trading higher on Tuesday after the company expanded its partnership with India's Bharti Airtel to deploy its secure and high-performance 5G Core network solutions. Under this agreement, Ericsson will integrate its Signaling Controller solution into Bharti Airtel's network and introduce its 5G Standalone-enabled Charging and Policy solution. The financial terms of the agreement were not disclosed. These advancements will strengthen Airtel's 5G monetization strat",
            "publication_date": "2025-02-25T17:37:40.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.9485",
            "source": "Benzinga",
            "ticker": "ERIC",
            "title": "Ericsson Accelerates 5G Growth in India with Bharti Airtel Deal",
            "url": "https://finance.yahoo.com/news/ericsson-accelerates-5g-growth-india-173740937.html"
        },
        {
            "headline": "Vonage, a global leader in cloud communications and a part of Ericsson (NASDAQ: ERIC), has been named a Gold winner in both the 5G Networks and 5G Innovation of the Year categories at the Merit Awards for Telecom 2025. This recognition underscores Vonage's pivotal role in shaping the future of 5G technology through its innovative network APIs, which enable businesses to accelerate digital transformation across industries.",
            "publication_date": "2025-02-27T08:00:00.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.9337",
            "source": "PR Newswire",
            "ticker": "ERIC",
            "title": "Vonage Recognized for 5G Innovation with Gold Merit Awards for Telecom 2025",
            "url": "https://finance.yahoo.com/news/vonage-recognized-5g-innovation-gold-080000087.html"
        },
        {
            "headline": "Vonage, a global leader in cloud communications helping businesses accelerate their digital transformation and a part of Ericsson (NASDAQ:ERIC), today announced that Lydia Solutions, one of Europe's fastest-growing mobile financial services platforms, has enhanced its security and customer experience with Vonage's powerful Verify API and Silent Authentication powered by the network. By leveraging the solution, Lydia Solutions has protected the data and privacy of tens of thousands of users daily",
            "publication_date": "2025-02-12T12:00:00.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.9186",
            "source": "PR Newswire",
            "ticker": "ERIC",
            "title": "Lydia Solutions Partners with Vonage to Revolutionize Security and User Experience Leveraging Network Capabilities",
            "url": "https://finance.yahoo.com/news/lydia-solutions-partners-vonage-revolutionize-120000672.html"
        },
        {
            "headline": "We recently compiled a list of the 10 Stocks Firm Up Amid Cautious Trading. In this article, we are going to take a look at where Telefonaktiebolaget LM Ericsson (publ) (NASDAQ:ERIC) stands against the other stocks. Wall Street extended its lackluster performance on Tuesday, with two major indices finishing with only slight changes amid a series […]",
            "publication_date": "2025-02-26T11:56:12.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.1027",
            "source": "Insider Monkey",
            "ticker": "ERIC",
            "title": "Why Telefonaktiebolaget LM Ericsson (publ) (ERIC) Soared on Tuesday",
            "url": "https://finance.yahoo.com/news/why-telefonaktiebolaget-lm-ericsson-publ-115612067.html"
        },
        {
            "headline": "Ericsson's (NASDAQ: ERIC) financial report for the first quarter 2025 will be published at approximately 7:00 AM CEST on April 15, 2025. The company will issue a press release with the complete financial report attached, including tables, in PDF format. Following publication of the press release, the financial report will be available on Ericsson's website: www.ericsson.com/en/investors/financial-reports/interim-reports",
            "publication_date": "2025-04-01T06:32:00.000Z",
            "sentiment": "Neutral",
            "sentimentScore": "0.0",
            "source": "PR Newswire",
            "ticker": "ERIC",
            "title": "Invitation to media and analyst briefing for Ericsson Q1 2025 report",
            "url": "https://finance.yahoo.com/news/invitation-media-analyst-briefing-ericsson-063200904.html"
        },
        {
            "headline": "Major telecom companies in Zimbabwe and Angola select ERIC's industry-leading portfolio to modernize their network infrastructure.",
            "publication_date": "2025-03-10T15:37:00.000Z",
            "sentiment": "Neutral",
            "sentimentScore": "0.0",
            "source": "Zacks",
            "ticker": "ERIC",
            "title": "Ericsson Boosts Digital Infrastructure in Africa: Stock to Gain?",
            "url": "https://finance.yahoo.com/news/ericsson-boosts-digital-infrastructure-africa-153700170.html"
        }
    ],
    "Avg Score": 0.5265128205128204
}