{
    "4 17 2025": {
        "importantArticles": [
            {
                "headline": "Navitas Semiconductor has achieved a significant milestone in the electric vehicle sector by securing automotive qualification for its high-power GaNSafe™ integrated circuits (ICs), which meet AEC-Q100 and AEC-Q101 standards. These advancements in gallium nitride (GaN) technology are poised to enhance power density and efficiency for onboard chargers and high-voltage to low-voltage converters within EVs. With innovations like the 650V Bi-Directional GaNFast ICs, Navitas aims to simplify power...",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8442",
                "source": "Simply Wall St.",
                "ticker": "F",
                "title": "Electric Vehicles Update - Navitas Advances EV Innovation with Automotive-Qualified GaN Technology",
                "url": "https://finance.yahoo.com/news/electric-vehicles-navitas-advances-ev-123711711.html"
            },
            {
                "headline": "Ford Motor is recalling more than 148,000 vehicles in the United States as part of two recalls, the National Highway Traffic Safety Administration said on Thursday. The automaker will recall 123,611 vehicles due to a fluid leak that could reduce braking performance and increase stopping distance. This affects certain 2017–18 Ford F-150, Expedition, and Lincoln Navigator models.",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7184",
                "source": "Reuters",
                "ticker": "F",
                "title": "Ford recalls more than 148,000 vehicles, NHTSA says",
                "url": "https://finance.yahoo.com/news/ford-recall-more-123-000-094929067.html"
            },
            {
                "headline": "Catch up on the top industries and stocks that were impacted, or were predicted to be impacted, by the comments, actions and policies of President Donald Trump with this daily recap compiled by The Fly: POTENTIAL TARIFF DELAY: Shares of car manufacturers Ford (F), General Motors (GM) and Stellantis (STLA) were Trump told reporters that his administration is “looking at something to help car companies” as they slowly move manufacturing to the U.S. President Donald Trump told reporters in the Oval",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.3954",
                "source": "TipRanks",
                "ticker": "F",
                "title": "Trump Trade: Carmakers may see tariff relief, China halts Boeing deliveries",
                "url": "https://finance.yahoo.com/news/trump-trade-carmakers-may-see-140439617.html"
            },
            {
                "headline": "Ford Motor may raise prices on its new vehicles if U.S. President Donald Trump's auto tariffs continue, according to a memo sent to dealers on Wednesday that was reviewed by Reuters.  The Dearborn, Michigan, automaker offered deep discounts across its lineup starting earlier this month through June 2.  The program will continue, but pricing on new models produced in May and beyond may change, the memo said.",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Reuters",
                "ticker": "F",
                "title": "Ford Motor may hike prices if Trump's auto tariffs persist, memo says",
                "url": "https://finance.yahoo.com/news/ford-motor-may-hike-prices-194130926.html"
            },
            {
                "headline": "In the latest trading session, Ford Motor Company (F) closed at $9.40, marking a -0.53% move from the previous day.",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Zacks",
                "ticker": "F",
                "title": "Ford Motor Company (F) Stock Moves -0.53%: What You Should Know",
                "url": "https://finance.yahoo.com/news/ford-motor-company-f-stock-214517823.html"
            },
            {
                "headline": "Earnings results often indicate what direction a company will take in the months ahead. With Q4 behind us, let’s have a look at Rivian (NASDAQ:RIVN) and its peers.",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "StockStory",
                "ticker": "F",
                "title": "Winners And Losers Of Q4: Rivian (NASDAQ:RIVN) Vs The Rest Of The Automobile Manufacturing Stocks",
                "url": "https://finance.yahoo.com/news/winners-losers-q4-rivian-nasdaq-090232529.html"
            }
        ],
        "avgScore": 0.2789
    },
    "4 16 2025": {
        "importantArticles": [
            {
                "headline": "Might Lincoln have exceeded 100,000 US sales in 2025? Tariffs on its best seller may have done for that ambition. Perhaps.",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.6369",
                "source": "Just Auto",
                "ticker": "F",
                "title": "Lincoln future models 2025-2035",
                "url": "https://finance.yahoo.com/news/lincoln-future-models-2025-2035-230337587.html"
            },
            {
                "headline": "Ford stock yields a big 6.5% right now, but is the dividend safe?",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.5927",
                "source": "Motley Fool",
                "ticker": "F",
                "title": "Here's How Many Shares of Ford You Should Own to Get $500 in Yearly Dividends",
                "url": "https://finance.yahoo.com/news/heres-many-shares-ford-own-113000259.html"
            },
            {
                "headline": "Canada said that automakers will be allowed to continue to import a certain number of US-made cars and trucks, tariff-free, provided they keep manufacturing vehicles in the country. Keith Naughton reports on Bloomberg Television.",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.34",
                "source": "Bloomberg",
                "ticker": "F",
                "title": "Canada Offers Automakers Tariff Exemption on Imports",
                "url": "https://finance.yahoo.com/video/canada-offers-automakers-tariff-exemption-141656873.html"
            },
            {
                "headline": "Barclays analyst Dan Levy downgraded his view of the sector to “Negative” and cut his rating for General Motors to Hold from Buy.",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.2732",
                "source": "Barrons.com",
                "ticker": "F",
                "title": "GM Stock Falls on 43% Price-Target Cut. Auto Shares Aren’t Reflecting ‘Full Tariff Risk.’",
                "url": "https://finance.yahoo.com/m/021b23ed-f612-36e2-bbde-04287bedb568/gm-stock-falls-on-43-.html"
            },
            {
                "headline": "Griffon and Cars.com's have been highlighted as Zacks Bull and Bear of the Day",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Zacks",
                "ticker": "F",
                "title": "Griffon and Cars.com's have been highlighted as Zacks Bull and Bear of the Day",
                "url": "https://finance.yahoo.com/news/griffon-cars-coms-highlighted-zacks-123900614.html"
            },
            {
                "headline": "The New York Stock Exchange (NYSE) provides a daily pre-market update directly from the NYSE Trading Floor. Access today's NYSE Pre-market update for market insights before trading begins.",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "PR Newswire",
                "ticker": "F",
                "title": "NYSE Content Advisory: Pre-Market update + Bank of America beats earnings estimates",
                "url": "https://finance.yahoo.com/news/nyse-content-advisory-pre-market-125500437.html"
            }
        ],
        "avgScore": 0.22422857142857142
    },
    "4 15 2025": {
        "importantArticles": [
            {
                "headline": "Market Domination host Josh Lipton goes over some of the top stories of the day in this segment of Market Minute. Automaker stocks like General Motors (GM), Ford (F), and Stellantis (STLA) are gaining on Monday after President Trump suggested that automakers could possibly see some tariff relief. Webull (BULL) stock is skyrocketing after the company went public through a special-purpose acquisition company (SPAC) merger. DuPont (DD) was upgraded by KeyBanc to Overweight from Sector Weight, citing the company's strong balance sheet amid economic uncertainty. Stay up to date on the latest market action, minute-by-minute, with Yahoo Finance's Market Minute.",
                "publication_date": "2025-04-15T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8126",
                "source": "Yahoo Finance Video",
                "ticker": "F",
                "title": "Automaker stocks pop, Webull skyrockets, DuPont upgraded",
                "url": "https://finance.yahoo.com/video/automaker-stocks-pop-webull-skyrockets-182221164.html"
            },
            {
                "headline": "Jeff Bezos is reportedly backing a Michigan-based all-electric mobility startup, Slate Auto, with a goal of developing a cheap single-cab EV truck to take on the likes of Tesla Inc. (NASDAQ:TSLA) and Rivian Automotive Inc. (NASDAQ:RIVN). What happened: A report published by TechCrunch shared that the company is backed by Amazon.com Inc. (NASDAQ:AMZN) founder Jeff Bezos. The report said that Slate Auto has brought in people from the likes of Ford Motor Co. (NYSE:F), Harley-Davidson Inc. (NYSE:HOG",
                "publication_date": "2025-04-15T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.802",
                "source": "Benzinga",
                "ticker": "F",
                "title": "Jeff Bezos-Backed Slate Auto To Take On Elon Musk's Tesla, Rivian With Budget EV Pickup: Report",
                "url": "https://finance.yahoo.com/news/jeff-bezos-backed-slate-auto-213025162.html"
            },
            {
                "headline": "President Trump said he is looking at some short-term tariff exemptions to help car companies and said he exempted smartphones and certain electronics from recent tariffs in order to help U.S. smartphone makers, including Apple.  On autos, Trump says he’s considering the exemptions for car companies that are looking to switch making parts from Canada and Mexico to the U.S.  “I’m looking at something to help some of the car companies,” Trump told reporters at the White House, without giving any additional details.",
                "publication_date": "2025-04-15T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8",
                "source": "The Wall Street Journal",
                "ticker": "F",
                "title": "Trump Looks at Tariff Pause for Some Autos",
                "url": "https://finance.yahoo.com/m/60179d67-8a11-3573-a9ee-b0ed5ba4b4f6/trump-looks-at-tariff-pause.html"
            },
            {
                "headline": "F's low valuation and dividend yield may seem attractive, but EV losses, ICE weakness & tariff risks cloud its overall outlook.",
                "publication_date": "2025-04-15T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.8591",
                "source": "Zacks",
                "ticker": "F",
                "title": "Ford Stock Near 52-Week Low: Is it a Steal or Still a Risk?",
                "url": "https://finance.yahoo.com/news/ford-stock-near-52-week-140700803.html"
            },
            {
                "headline": "Auto makers will benefit from dealers ordering cars to beat the Trump tariffs. But they will have a lot pain, too, says an analyst.",
                "publication_date": "2025-04-15T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5346",
                "source": "Barrons.com",
                "ticker": "F",
                "title": "Ford and GM Stocks Pop After Trump Says He’s Looking at Auto Tariff Pause",
                "url": "https://finance.yahoo.com/m/e235ce5a-1ee5-35fa-a1ce-031e5b4a2e96/ford-and-gm-stocks-pop-after.html"
            },
            {
                "headline": "(Bloomberg) -- President Donald Trump’s tariff exclusions for smartphones and other tech products have added to a growing set of confusing signals for companies and trading partners digesting how to engage a White House still promising to negotiate dozens of new deals in America’s favor.Most Read from BloombergHow Did This Suburb Figure Out Mass Transit?The Secret Formula for Faster TrainsEven Oslo Has an Air Quality ProblemNYC Tourist Helicopter Crashes in Hudson River, Killing SixLisbon Mayor",
                "publication_date": "2025-04-15T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.128",
                "source": "Bloomberg",
                "ticker": "F",
                "title": "Trump’s Tangled Tariffs Sow Confusion as Negotiators Line Up",
                "url": "https://finance.yahoo.com/news/trump-tangled-tariffs-sow-confusion-122723925.html"
            }
        ],
        "avgScore": 0.2649307692307693
    },
    "4 14 2025": {
        "importantArticles": [
            {
                "headline": "The automobile industry seems to be caught squarely in the middle of the geopolitical impasse, but there's one curious exception.",
                "publication_date": "2025-04-14T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.4497",
                "source": "Motley Fool",
                "ticker": "F",
                "title": "Here's How Tariffs Could Affect This Industry Giant. Should Investors Be Worried?",
                "url": "https://finance.yahoo.com/news/heres-tariffs-could-affect-industry-080500701.html"
            },
            {
                "headline": "Detroit automakers can run but they can't hide from the potentially devastating impacts tariffs could have on their business.  Amid the slew of analyst downgrades and lowered price targets there's a reality that is setting in for some investors: Tariffs could cause Ford Motor Company (NYSE: F) to alter how it returns value to shareholders.  In other words, Ford may be forced to cut its coveted dividend.",
                "publication_date": "2025-04-14T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.8878",
                "source": "Motley Fool",
                "ticker": "F",
                "title": "1 Way Tariffs Could Cripple Ford for Investors",
                "url": "https://finance.yahoo.com/news/1-way-tariffs-could-cripple-121500824.html"
            },
            {
                "headline": "Detroit automakers can run but they can't hide from the potentially devastating impacts tariffs could have on their business.  Amid the slew of analyst downgrades and lowered price targets there's a reality that is setting in for some investors: Tariffs could cause Ford Motor Company (NYSE: F) to alter how it returns value to shareholders.  In other words, Ford may be forced to cut its coveted dividend.",
                "publication_date": "2025-04-14T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.8878",
                "source": "Motley Fool",
                "ticker": "F",
                "title": "1 Way Tariffs Could Cripple Ford for Investors",
                "url": "https://finance.yahoo.com/news/1-way-tariffs-could-cripple-121500824.html"
            },
            {
                "headline": "The automobile industry seems to be caught squarely in the middle of the geopolitical impasse, but there's one curious exception.",
                "publication_date": "2025-04-14T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.4497",
                "source": "Motley Fool",
                "ticker": "F",
                "title": "Here's How Tariffs Could Affect This Industry Giant. Should Investors Be Worried?",
                "url": "https://finance.yahoo.com/news/heres-tariffs-could-affect-industry-080500701.html"
            }
        ],
        "avgScore": -0.21905000000000002
    },
    "4 11 2025": {
        "importantArticles": [
            {
                "headline": "The recent report on the Second-life EV Batteries Market highlights the growing potential for repurposing used electric vehicle batteries for secondary applications. This market is gaining momentum due to the increasing volume of retired EV batteries and a rising demand for sustainable, cost-effective energy storage solutions. Comprehensive analyses explore the opportunities and challenges associated with integrating second-life batteries into both automotive and non-automotive sectors,...",
                "publication_date": "2025-04-11T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8658",
                "source": "Simply Wall St.",
                "ticker": "F",
                "title": "Electric Vehicles Today - Repurposing EV Batteries for Sustainable Energy Solutions",
                "url": "https://finance.yahoo.com/news/electric-vehicles-today-repurposing-ev-103950536.html"
            },
            {
                "headline": "Shares of automotive manufacturer Ford (NYSE:F) fell 5.8% in the afternoon session after Goldman Sachs downgraded the stock, citing growing concerns over trade tariffs on imported vehicles and car parts, which are expected to pressure profit margins and disrupt supply chains across the industry. The firm added, \"We downgrade Ford to Neutral from Buy to better reflect a more difficult cyclical dynamic including competition internationally, weaker consumer demand, and what we expect will be higher",
                "publication_date": "2025-04-11T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.4889",
                "source": "StockStory",
                "ticker": "F",
                "title": "Why Ford (F) Stock Is Nosediving",
                "url": "https://finance.yahoo.com/news/why-ford-f-stock-nosediving-200407520.html"
            },
            {
                "headline": "DETROIT (Reuters) -A new analysis by the Center for Automotive Research has found that President Donald Trump's 25% auto tariffs imposed in early April will increase costs by about $108 billion for automakers in the U.S. in 2025.  The study, released on Thursday by the Ann Arbor, Michigan-based organization, found Detroit automakers Ford Motor, General Motors and Stellantis, maker of Jeeps and Ram trucks, specifically will see increased costs of $42 billion.  The study found the Detroit Three could see tariffs of nearly $5,000 for the parts they import on average for each car produced in the U.S., and about $8,600 on average for each car they import.",
                "publication_date": "2025-04-11T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.4767",
                "source": "Reuters",
                "ticker": "F",
                "title": "Study finds Trump's 25% auto tariffs could cost US automakers $108 billion",
                "url": "https://finance.yahoo.com/news/study-finds-trumps-25-auto-210135824.html"
            },
            {
                "headline": "Brad Smith and Madison Mills take a closer look at some of the trending tickers in premarket trading. UBS analysts downgrade General Motors (GM) to Neutral from Buy and cut their price target for Tesla (TSLA), while Goldman Sachs downgrades Ford (F) to Neutral from Buy. Nike (NKE) and Lululemon (LULU) fall, retreating from broad tariff pause highs, as investors assess the impact of increased tariffs on imports from China on retailers. CarMax (KMX) pulls its long-term sales forecast, citing macro-level uncertainty. To watch more expert insights and analysis on the latest market action, check out more Morning Brief here.",
                "publication_date": "2025-04-11T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.34",
                "source": "Yahoo Finance Video",
                "ticker": "F",
                "title": "GM, Tesla, & Ford; Nike falls; CarMax outlook: Trending Tickers",
                "url": "https://finance.yahoo.com/video/gm-tesla-ford-nike-falls-135457921.html"
            },
            {
                "headline": "Investing.com -- Goldman Sachs has downgraded Ford Motor (NYSE:F) to Neutral from Buy amid a more difficult macroeconomic and competitive environment for U.S. auto manufacturers.",
                "publication_date": "2025-04-11T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.2716",
                "source": "Investing.com",
                "ticker": "F",
                "title": "Goldman Sachs lowers auto industry outlook; Ford, Visteon downgraded",
                "url": "https://finance.yahoo.com/news/goldman-sachs-lowers-auto-industry-123617508.html"
            },
            {
                "headline": "Paccar (PCAR) witnessed a jump in share price last session on above-average trading volume. The latest trend in earnings estimate revisions for the stock doesn't suggest further strength down the road.",
                "publication_date": "2025-04-11T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.1098",
                "source": "Zacks",
                "ticker": "F",
                "title": "Paccar (PCAR) Stock Jumps 8.7%: Will It Continue to Soar?",
                "url": "https://finance.yahoo.com/news/paccar-pcar-stock-jumps-8-111700405.html"
            }
        ],
        "avgScore": 0.13552499999999998
    },
    "4 10 2025": {
        "importantArticles": [
            {
                "headline": "Brad Smith takes a closer look at the top stories as part of today's Market Minute. Trump Media & Technology Group (DJT) stock gains as US President Trump tells markets to \"be cool,\" saying it's \"a great time to buy.\" Advanced Micro Devices (AMD) gains amid a broader tech rally despite TD Cowen analysts cutting the company's price target to $100 from $135. Bernstein analysts downgrade Ford (F) to Sell from Hold, citing the impact of tariffs. Stay up to date on the latest market action, minute-by-minute, with Yahoo Finance's Market Minute.",
                "publication_date": "2025-04-10T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8807",
                "source": "Yahoo Finance Video",
                "ticker": "F",
                "title": "DJT stock pops, AMD rises, Ford tariff risks: Market Minute",
                "url": "https://finance.yahoo.com/video/djt-stock-pops-amd-rises-162519217.html"
            },
            {
                "headline": "China's electric vehicle market has rapidly transformed, asserting itself as a global leader in production, sales, and technological advancement. By early 2025, new energy vehicles, including battery electric and plug-in hybrid vehicles, make up nearly half of all passenger vehicle sales in the country. This growth is fueled by strong government policies, strategic subsidies, and investments in infrastructure, alongside ambitious electrification goals in major cities. Leading domestic...",
                "publication_date": "2025-04-10T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8779",
                "source": "Simply Wall St.",
                "ticker": "F",
                "title": "This Week In Electric Vehicles - China's Rising Dominance in Global Vehicle Innovation",
                "url": "https://finance.yahoo.com/news/week-electric-vehicles-chinas-rising-123723870.html"
            },
            {
                "headline": "A number of stocks jumped in the afternoon session after markets rallied sharply on news that President Trump announced a 90-day tariff pause. Reciprocal tariffs were also dropped to 10% for most countries, sparking renewed optimism amid ongoing trade talks. The major stock indices rose as investors, growing impatient of seemingly irrational tariff actions, welcomed the pause as a sign of a more measured path forward.",
                "publication_date": "2025-04-10T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.5106",
                "source": "StockStory",
                "ticker": "F",
                "title": "Lucid (LCID) and American Airlines (AAL), Delta Air Lines (DAL), Ford (F), Rivian (RIVN) Shares Are Soaring, What You Need To Know",
                "url": "https://finance.yahoo.com/news/lucid-lcid-american-airlines-aal-183902910.html"
            },
            {
                "headline": "Investing.com --Bernstein downgraded Ford Motor Co (NYSE:F) to “Underperform” from “Market Perform” and slashed its price target to $7 from $9.40, warning that newly implemented U.S. vehicle tariffs and weakening consumer sentiment pose a significant threat to earnings and free cash flow over the next two years.Shares are down roughly 3% in premarket trading.",
                "publication_date": "2025-04-10T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5994",
                "source": "Investing.com",
                "ticker": "F",
                "title": "Ford downgraded as Trump tariffs hammer outlook, target cut to $7",
                "url": "https://finance.yahoo.com/news/ford-downgraded-trump-tariffs-hammer-130537195.html"
            },
            {
                "headline": "Tesla (TSLA) stock has hit a roadblock in the past three years, and investors are growing wary of CEO Elon Musk and his impact on Tesla’s brand. Earlier this month, the American electric vehicle (EV) giant reported 336,681 cars delivered in Q1 2025, representing a 13% year-over-year decline from Q1 2024. The figure missed analyst expectations of 370,000 vehicles and prompted a JPMorgan analyst to reiterate an Underweight rating on Tesla and express concerns over “unprecedented brand damage.” As",
                "publication_date": "2025-04-10T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.128",
                "source": "TipRanks",
                "ticker": "F",
                "title": "Tesla Stock (TSLA) Pain Set to Endure Under Elon Musk’s Leadership",
                "url": "https://finance.yahoo.com/news/tesla-stock-tsla-pain-set-112743271.html"
            },
            {
                "headline": "Bernstein analyst Daniel Roeska downgraded Ford Motor stock to Sell from Hold. He had downgraded GM to Sell from Hold on Monday.",
                "publication_date": "2025-04-10T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Barrons.com",
                "ticker": "F",
                "title": "Ford Stock Soars. There Is Still a Huge Problem.",
                "url": "https://finance.yahoo.com/m/6e5ab07f-f545-3a8f-9eb8-c1db701abb39/ford-stock-soars-there-is.html"
            }
        ],
        "avgScore": 0.22972499999999996
    },
    "4 9 2025": {
        "importantArticles": [
            {
                "headline": "A number of stocks fell in the afternoon session after markets gave up early gains with optimism over progress in US-China trade talks quickly fading as the Trump administration announced plans to raise tariffs on all Chinese imports to well above 100%.",
                "publication_date": "2025-04-09T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8779",
                "source": "StockStory",
                "ticker": "F",
                "title": "Qorvo (QRVO) and Ford (F), Hewlett Packard Enterprise (HPE), HP (HPQ) Shares Plummet, What You Need To Know",
                "url": "https://finance.yahoo.com/news/qorvo-qrvo-ford-f-hewlett-215228877.html"
            },
            {
                "headline": "The end of an earnings season can be a great time to discover new stocks and assess how companies are handling the current business environment. Let’s take a look at how THOR Industries (NYSE:THO) and the rest of the automobile manufacturing stocks fared in Q4.",
                "publication_date": "2025-04-09T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.6249",
                "source": "StockStory",
                "ticker": "F",
                "title": "Q4 Earnings Outperformers: THOR Industries (NYSE:THO) And The Rest Of The Automobile Manufacturing Stocks",
                "url": "https://finance.yahoo.com/news/q4-earnings-outperformers-thor-industries-091143908.html"
            },
            {
                "headline": "The Big Three automakers — Ford (F), General Motors (GM), and Stellantis (STLA) — are the most exposed to US President Trump's auto tariffs, even when compared to foreign automakers, according to auto data firm JATO Dynamics. Senior Autos Reporter Pras Subramanian joins Julie Hyman and Josh Lipton on Market Domination Overtime to take a closer look at the auto sector. To watch more expert insights and analysis on the latest market action, check out more Market Domination Overtime here.",
                "publication_date": "2025-04-09T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0276",
                "source": "Yahoo Finance Video",
                "ticker": "F",
                "title": "Why auto tariffs will be extra harsh on Ford, GM, & Stellantis",
                "url": "https://finance.yahoo.com/video/why-auto-tariffs-extra-harsh-215733894.html"
            },
            {
                "headline": "Catch up on the top industries and stocks that were impacted, or were predicted to be impacted, by the comments, actions and policies of President Donald Trump with this daily recap compiled by The Fly: TRUMP SAYS NO INFLATION: President Trump said via Truth Social, “Oil prices are down, interest rates are down (the slow moving Fed should cut rates!), food prices are down, there is NO INFLATION, and the long time abused USA is bringing in Billions of Dollars a week from the abusing countries on",
                "publication_date": "2025-04-09T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.8155",
                "source": "TipRanks",
                "ticker": "F",
                "title": "Trump Trade: Trump claims ‘no inflation,’ Medicare won’t cover obesity drugs",
                "url": "https://finance.yahoo.com/news/trump-trade-trump-claims-no-142755841.html"
            },
            {
                "headline": "We recently published a list of Jim Cramer Got These 10 Stocks All Wrong. In this article, we are going to take a look at where Ford Motor Company (NYSE:F) stands against other stocks that Jim Cramer discussed 1 year ago. On Tuesday, April 1 , the host of Mad Money opened the show by focusing […]",
                "publication_date": "2025-04-09T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.743",
                "source": "Insider Monkey",
                "ticker": "F",
                "title": "Jim Cramer Stood by Ford (F) Through Its 30% Slide – And Still Thinks It’ll Rebound",
                "url": "https://finance.yahoo.com/news/jim-cramer-stood-ford-f-183539253.html"
            },
            {
                "headline": "We recently published a list of Jim Cramer’s Complete Black Monday Warning Plus 10 Stocks. In this article, we are going to take a look at where Ford Motor Company (NYSE:F) stands against other stocks that Jim Cramer discusses. In his appearance on CNBC’s Squawk on the Street on Friday as markets were crashing for […]",
                "publication_date": "2025-04-09T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.34",
                "source": "Insider Monkey",
                "ticker": "F",
                "title": "Jim Cramer Says Ford Motor Company (F) Needs Help: “Jim Farley Trying to Do the Right Thing”",
                "url": "https://finance.yahoo.com/news/jim-cramer-says-ford-motor-145055329.html"
            }
        ],
        "avgScore": -0.06814999999999997
    },
    "4 8 2025": {
        "importantArticles": [
            {
                "headline": "Ford of Europe saw little demand for the previous generation Mustang EcoBoost, but envisages lots for the new generation 5.0-litre GT.",
                "publication_date": "2025-04-08T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.5641",
                "source": "Just Auto",
                "ticker": "F",
                "title": "Why Ford scrubbed the four-cylinder Mustang",
                "url": "https://finance.yahoo.com/news/why-ford-scrubbed-four-cylinder-195419232.html"
            },
            {
                "headline": "Figuring out if cars are about to get more expensive is easy. They are. By just how much is harder to figure.",
                "publication_date": "2025-04-08T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.4877",
                "source": "Barrons.com",
                "ticker": "F",
                "title": "How Much Tariffs Add to Tesla’s Costs (And Your Price)",
                "url": "https://finance.yahoo.com/m/4baaf1a7-3ce2-398d-b454-2401782802c1/how-much-tariffs-add-to.html"
            },
            {
                "headline": "Auto stocks continued their downward slide on Monday as the sector, heavily exposed to tariffs, looks for a bottom.",
                "publication_date": "2025-04-08T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.0772",
                "source": "Yahoo Finance",
                "ticker": "F",
                "title": "Auto stocks continue slide as tariff impact threatens to decimate sales",
                "url": "https://finance.yahoo.com/news/auto-stocks-continue-slide-as-tariff-impact-threatens-to-decimate-sales-185757899.html"
            },
            {
                "headline": "The two SUV models were recalled in March 2024 for the same problem, which was addressed with an engine control software update.",
                "publication_date": "2025-04-08T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.4019",
                "source": "Automotive Dive",
                "ticker": "F",
                "title": "Ford recalls 33K Bronco Sport, Escape SUVs for potential fuel leaks",
                "url": "https://finance.yahoo.com/news/ford-recalls-33k-bronco-sport-110900998.html"
            },
            {
                "headline": "Tariff and trade-war fears have increased stock market volatility. Technical strategists say they haven’t seen capitulation yet.",
                "publication_date": "2025-04-08T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.1779",
                "source": "Barrons.com",
                "ticker": "F",
                "title": "The Stock Panic Selloff Shows It Isn’t Time to Buy Just Yet",
                "url": "https://finance.yahoo.com/m/9cd8c141-85a9-3cbf-95a6-5bfab8936211/the-stock-panic-selloff-shows.html"
            },
            {
                "headline": "President Trump's tariff plans have walloped auto stocks. Shares of the big three automakers (F, GM, STLA) all closed lower again on Monday. Yahoo Finance Autos Reporter Pras Subramanian reports the latest in the video above.&nbsp; To watch more expert insights and analysis on the latest market action, check out more Market Domination Overtime here.",
                "publication_date": "2025-04-08T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.1226",
                "source": "Yahoo Finance Video",
                "ticker": "F",
                "title": "Auto stocks have been clobbered by Trump's tariffs",
                "url": "https://finance.yahoo.com/video/auto-stocks-clobbered-trumps-tariffs-203056273.html"
            }
        ],
        "avgScore": 0.04536666666666666
    },
    "4 7 2025": {
        "importantArticles": [
            {
                "headline": "In recent developments, the article highlights Attorney General Pam Bondi's decisive actions against domestic terrorism, focusing on the prosecution of individuals targeting Tesla. These legal measures reflect broader governmental efforts to ensure a secure environment conducive to innovation within the electric vehicle sector. Additionally, the discussion around tariffs and economic policies suggests significant changes in trade dynamics that could impact the EV industry. Moreover, the...",
                "publication_date": "2025-04-07T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.4767",
                "source": "Simply Wall St.",
                "ticker": "F",
                "title": "Electric Vehicles Today - Navigating Shifts In Innovation And Policy",
                "url": "https://finance.yahoo.com/news/electric-vehicles-today-navigating-shifts-100938211.html"
            },
            {
                "headline": "We recently published a list of Jim Cramer Says Wait A Little & Discusses These 11 Stocks. In this article, we are going to take a look at where Ford Motor Company (NYSE:F) stands against other stocks that Jim Cramer discusses. In a recent appearance on CNBC’s Squawk on the Street, Jim Cramer commented on […]",
                "publication_date": "2025-04-07T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Insider Monkey",
                "ticker": "F",
                "title": "Jim Cramer Warns on Ford (F): ‘You Can’t Tell Jim Farley Not to Raise Prices – This Isn’t Central Planning!’",
                "url": "https://finance.yahoo.com/news/jim-cramer-warns-ford-f-201657448.html"
            },
            {
                "headline": "President Trump's recent tariff announcement is kneecapping stocks far and wide.  Specifically, Ford's (NYSE: F) stock has already suffered under the threat of 25% tariffs on Mexico and Canada imports, and the potential economic fallout could hurt the company and its peers even further.  The result is that Ford's stock is down nearly 9% over the past six months, pushing its share price to under $10 as of this writing (April 4).",
                "publication_date": "2025-04-07T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.8316",
                "source": "Motley Fool",
                "ticker": "F",
                "title": "Should You Buy Ford While It's Below $10?",
                "url": "https://finance.yahoo.com/news/buy-ford-while-below-10-072000923.html"
            },
            {
                "headline": "President Trump's recent tariff announcement is kneecapping stocks far and wide.  Specifically, Ford's (NYSE: F) stock has already suffered under the threat of 25% tariffs on Mexico and Canada imports, and the potential economic fallout could hurt the company and its peers even further.  The result is that Ford's stock is down nearly 9% over the past six months, pushing its share price to under $10 as of this writing (April 4).",
                "publication_date": "2025-04-07T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.8316",
                "source": "Motley Fool",
                "ticker": "F",
                "title": "Should You Buy Ford While It's Below $10?",
                "url": "https://finance.yahoo.com/news/buy-ford-while-below-10-072000923.html"
            },
            {
                "headline": "We recently published a list of Jim Cramer Says Wait A Little & Discusses These 11 Stocks. In this article, we are going to take a look at where Ford Motor Company (NYSE:F) stands against other stocks that Jim Cramer discusses. In a recent appearance on CNBC’s Squawk on the Street, Jim Cramer commented on […]",
                "publication_date": "2025-04-07T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Insider Monkey",
                "ticker": "F",
                "title": "Jim Cramer Warns on Ford (F): ‘You Can’t Tell Jim Farley Not to Raise Prices – This Isn’t Central Planning!’",
                "url": "https://finance.yahoo.com/news/jim-cramer-warns-ford-f-201657448.html"
            },
            {
                "headline": "In recent developments, the article highlights Attorney General Pam Bondi's decisive actions against domestic terrorism, focusing on the prosecution of individuals targeting Tesla. These legal measures reflect broader governmental efforts to ensure a secure environment conducive to innovation within the electric vehicle sector. Additionally, the discussion around tariffs and economic policies suggests significant changes in trade dynamics that could impact the EV industry. Moreover, the...",
                "publication_date": "2025-04-07T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.4767",
                "source": "Simply Wall St.",
                "ticker": "F",
                "title": "Electric Vehicles Today - Navigating Shifts In Innovation And Policy",
                "url": "https://finance.yahoo.com/news/electric-vehicles-today-navigating-shifts-100938211.html"
            }
        ],
        "avgScore": -0.1183
    },
    "4 4 2025": {
        "importantArticles": [
            {
                "headline": "The global EV fuse market is projected to grow significantly, reaching an anticipated value of US$ 5.6 billion by 2031, according to a report by Stratview Research. This growth accompanies an annual rate of 13.9% from 2024 to 2031, driven by the increasing adoption of electric vehicles (EVs) including battery electric vehicles (BEVs) and hybrid electric vehicles (HEVs). The market segmentation includes various types of fuses used across different applications, with low-voltage fuses...",
                "publication_date": "2025-04-04T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7003",
                "source": "Simply Wall St.",
                "ticker": "F",
                "title": "Electric Vehicles Today - Accelerating Growth In The Global EV Fuse Market",
                "url": "https://finance.yahoo.com/news/electric-vehicles-today-accelerating-growth-100937547.html"
            },
            {
                "headline": "Ford Motor is leaning into the tariff moment with a new ad campaign that highlights its American-made vehicles and extends its employee discounts to the wider buying public.  For its EVs, Ford is throwing in a home charger and free installation.  Employee discounts can shave several thousand dollars off the price of a new car or truck.",
                "publication_date": "2025-04-04T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.5859",
                "source": "The Wall Street Journal",
                "ticker": "F",
                "title": "Ford Offers Its Employee Discount to All New Car Buyers",
                "url": "https://finance.yahoo.com/m/6c494d1d-5fae-3523-8745-5103b8b19f01/ford-offers-its-employee.html"
            },
            {
                "headline": "Auto stocks held up relatively well Thursday in the aftermath of President Donald Trump’s Wednesday tariff bombshell, but that doesn’t mean this is the bottom.  Ford Motor  and  General Motors  shares dropped 5.9% and 4.3%, respectively.  The reason for the somewhat muted reaction is that while Trump shocked the tech world, nothing really changed for cars.",
                "publication_date": "2025-04-04T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.5423",
                "source": "Barrons.com",
                "ticker": "F",
                "title": "Ford, GM Stocks Face Huge Tariff Risks. Don’t Ignore Them.",
                "url": "https://finance.yahoo.com/m/25448fb0-60f6-3396-bef5-5599e9c63429/ford-gm-stocks-face-huge.html"
            },
            {
                "headline": "(Bloomberg) -- Supply Lines is a daily newsletter that tracks global trade. Sign up here.Most Read from BloombergHousing Agency Aims to Relocate Its DC HeadquartersMetro-North Is Faster Than Acela on NYC-New Haven Route After Signal UpdatesLocal Governments Vie for Fired Federal WorkersLondon Clears Final Hurdle for More High-Speed Trains to EuropeWhat Would ‘Transportation Abundance’ Look Like?Just hours after taking effect, President Donald Trump’s 25% tariffs on imported cars are already reve",
                "publication_date": "2025-04-04T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5106",
                "source": "Bloomberg",
                "ticker": "F",
                "title": "Carmakers Idle Plants, Rethink Prices as Trump’s Tariffs Hit",
                "url": "https://finance.yahoo.com/news/trump-25-us-auto-import-105245329.html"
            },
            {
                "headline": "We recently published a list of Jim Cramer Discusses These 10 Stocks & Wonders If Trump Will Try Firing The Fed Chairman. In this article, we are going to take a look at where Ford Motor Company (NYSE:F) stands against other stocks that Jim Cramer discussed. In a recent appearance on CNBC’s Squawk on the […]",
                "publication_date": "2025-04-04T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.34",
                "source": "Insider Monkey",
                "ticker": "F",
                "title": "Jim Cramer on Ford Motor Company (F): I’d Rather Have Musk’s EV Company Be Like It",
                "url": "https://finance.yahoo.com/news/jim-cramer-ford-motor-company-113428333.html"
            },
            {
                "headline": "President Trump's 25% auto tariffs are now in effect. Yahoo Finance Autos Reporter Pras Subramanian takes a closer look at how some of the major automakers are responding. To watch more expert insights and analysis on the latest market action, check out more Morning Brief here.",
                "publication_date": "2025-04-04T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Yahoo Finance Video",
                "ticker": "F",
                "title": "Trump's auto tariffs: Here's how automakers are responding",
                "url": "https://finance.yahoo.com/video/trumps-auto-tariffs-heres-automakers-134737524.html"
            }
        ],
        "avgScore": 0.13723999999999997
    },
    "4 3 2025": {
        "importantArticles": [
            {
                "headline": "NEO Battery Materials Ltd. has entered a collaboration agreement with Elementium Materials Inc. to enhance NEO's silicon battery platform using advanced electrolyte technology. This partnership aims to improve battery stability and electrochemical performance, particularly in ultra-fast charging and discharging, by leveraging Elementium's advanced electrolytes. The collaboration is expected to benefit high-demand markets such as power tools, humanoid robots, drones, and aerospace systems,...",
                "publication_date": "2025-04-03T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9022",
                "source": "Simply Wall St.",
                "ticker": "F",
                "title": "Electric Vehicles Today - Battery Leap: NEO and Elementium's High-Performance Collaboration",
                "url": "https://finance.yahoo.com/news/electric-vehicles-today-battery-leap-120711145.html"
            },
            {
                "headline": "DETROIT (Reuters) -Ford Motor announced discounts across multiple models starting Thursday, leaning on its healthy inventory to offer customers thousands of dollars off as competitors hike prices to absorb tariff costs.  Ford will offer employee pricing - a discounted rate available to its workers - to all customers, the company confirmed, after Reuters reported the news Wednesday.  The incentives apply to much of its lineup, including vehicles like the Mustang Mach-E and Maverick that are built in Mexico.",
                "publication_date": "2025-04-03T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7717",
                "source": "Reuters",
                "ticker": "F",
                "title": "Ford offers across-the-board discounts, jumping on recent tariff-induced sales bump",
                "url": "https://finance.yahoo.com/news/exclusive-ford-offer-across-board-232749435.html"
            },
            {
                "headline": "President Trump made good on his tariff promise for foreign made autos, slapping 25% tariffs across the board on foreign-made automobiles.",
                "publication_date": "2025-04-03T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.6369",
                "source": "Yahoo Finance",
                "ticker": "F",
                "title": "Trump makes good on auto tariff threat with 25% levy on foreign-made cars",
                "url": "https://finance.yahoo.com/news/trump-makes-good-on-auto-tariff-threat-with-25-levy-on-foreign-made-cars-210156415.html"
            },
            {
                "headline": "‘Liberation Day’ has arrived with President Donald Trump set to announce and implement sweeping tariffs on imported goods. Car stocks have fallen in anticipation of the day, but that doesn’t mean its time to buy the dip.",
                "publication_date": "2025-04-03T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.1406",
                "source": "Barrons.com",
                "ticker": "F",
                "title": "Look to Boeing as Lesson on Why It Isn’t Time to Buy Ford and GM Stocks Yet",
                "url": "https://finance.yahoo.com/m/aa14bcca-92af-370b-8729-c25046df18f0/look-to-boeing-as-lesson-on.html"
            },
            {
                "headline": "U.S. vehicle sales are off to a decent start in 2025 as buyers rush to dealerships ahead of price hikes resulting from Trump's new tariffs on imported cars and parts.",
                "publication_date": "2025-04-03T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Zacks",
                "ticker": "F",
                "title": "U.S. Vehicle Sales Rise in Q1: A Boost Before Trump Tariffs Kick In?",
                "url": "https://finance.yahoo.com/news/u-vehicle-sales-rise-q1-134300213.html"
            },
            {
                "headline": "We recently published a list of Jim Cramer is Discussing These 10 Stocks Ahead of Q1 Earnings Season. In this article, we are going to take a look at where Ford Motor Co (NYSE:F) stands against other stocks that Jim Cramer is discussing ahead of Q1 earnings season. Jim Cramer in a latest program on […]",
                "publication_date": "2025-04-03T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Insider Monkey",
                "ticker": "F",
                "title": "Jim Cramer Says He Prefers General Motors Over Ford Motor (F)",
                "url": "https://finance.yahoo.com/news/jim-cramer-says-prefers-general-194441574.html"
            }
        ],
        "avgScore": 0.29245000000000004
    },
    "4 2 2025": {
        "importantArticles": [
            {
                "headline": "Madison Mills and Julie Hyman, joined by Yahoo Finance Senior Reporter Anjalee Khemlani, outline what's driving interest in some of the top trending tickers on Yahoo Finance's platform. Tesla (TSLA) sales in France saw a 37% year-over-year drop as the electric vehicle (EV) pioneer faces headwinds fueled by CEO Elon Musk's involvement in US President Donald Trump's second administration. Conversely, Ford (F) saw US retail sales rise 19% in March, just ahead of Trump's auto tariffs taking effect. PVH (PVH), the parent company of Calvin Klein and Tommy Hilfiger, gained after issuing a positive outlook. Johnson & Johnson (JNJ) stock fell after a judge denied the company's attempt to resolve a talc lawsuit through bankruptcy. To watch more expert insights and analysis on the latest market action, check out more Morning Brief here.",
                "publication_date": "2025-04-02T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7717",
                "source": "Yahoo Finance Video",
                "ticker": "F",
                "title": "Tesla, PVH, Johnson & Johnson: Trending Tickers",
                "url": "https://finance.yahoo.com/video/tesla-pvh-johnson-johnson-trending-140119031.html"
            },
            {
                "headline": "Amid electrification strides, cost-cut efforts and tariff concerns, which auto biggie - General Motors or Ford - is a better pick now?",
                "publication_date": "2025-04-02T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.4404",
                "source": "Zacks",
                "ticker": "F",
                "title": "GM vs. F: Which Legacy Automaker is a Stronger Play Now?",
                "url": "https://finance.yahoo.com/news/gm-vs-f-legacy-automaker-132800268.html"
            },
            {
                "headline": "We recently compiled a list of the 10 Best EV Stocks to Buy Under $50. In this article, we are going to take a look at where Ford Motor Company (NYSE:F) stands against the other EV stocks under $50. Electric vehicle (EV) sales continue to grow but at a slower pace than many had previously […]",
                "publication_date": "2025-04-02T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.3818",
                "source": "Insider Monkey",
                "ticker": "F",
                "title": "Is Ford Motor Company (F) The Best EV Stock to Buy Under $50?",
                "url": "https://finance.yahoo.com/news/ford-motor-company-f-best-142416500.html"
            },
            {
                "headline": "General Motors and Ford reported upbeat first quarter US sales, just as the threat of tariffs portends pain ahead for the Big Three automakers.",
                "publication_date": "2025-04-02T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.7717",
                "source": "Yahoo Finance",
                "ticker": "F",
                "title": "GM, Ford report upbeat Q1 retail sales as Trump tariffs loom",
                "url": "https://finance.yahoo.com/news/gm-ford-report-upbeat-q1-retail-sales-as-trump-tariffs-loom-182750180.html"
            },
            {
                "headline": "U.S. vehicle sales dipped 1.3% in the first quarter. That isn’t bad, considering dealers’ inventories were high as the quarter began.",
                "publication_date": "2025-04-02T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5423",
                "source": "Barrons.com",
                "ticker": "F",
                "title": "Ford Stock Is Falling Because Solid U.S. Sales Aren’t Enough. GM Shares Rise.",
                "url": "https://finance.yahoo.com/m/abc95edd-299c-3edb-8c3b-b64bf0236399/ford-stock-is-falling-because.html"
            },
            {
                "headline": "Ford stock slips amid modest sales decline, but battery plant rollout may cushion tariff-related supply risks",
                "publication_date": "2025-04-02T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.3919",
                "source": "GuruFocus.com",
                "ticker": "F",
                "title": "Ford Slides on Sales Slump, But Battery Plants May Ease Tariff Blow",
                "url": "https://finance.yahoo.com/news/ford-slides-sales-slump-battery-044925415.html"
            }
        ],
        "avgScore": 0.009292307692307659
    },
    "4 1 2025": {
        "importantArticles": [
            {
                "headline": "Volkswagen and Mercedes-Benz stocks both sold off in Germany.  🔎 Read more on Mercedes-Benz.  President Trump told NBC News over the weekend that he didn’t care if foreign automakers raised U.S. prices in response to new tariffs.",
                "publication_date": "2025-04-01T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.4939",
                "source": "The Wall Street Journal",
                "ticker": "F",
                "title": "Auto Stocks Skid After Trump Says He ‘Couldn’t Care Less’ About Higher Prices on Foreign Cars",
                "url": "https://finance.yahoo.com/m/57cc5cc9-a43d-3b2c-863b-962a4a4ab0aa/auto-stocks-skid-after-trump.html"
            },
            {
                "headline": "We recently compiled a list of the 10 Best Stocks Under $10 to Buy Now. In this article, we are going to take a look at where Ford Motor Company (NYSE:F) stands against the other stocks under $10. On March 28, Friday, US stocks declined as Wall Street continued to struggle with President Trump’s trade […]",
                "publication_date": "2025-04-01T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.4404",
                "source": "Insider Monkey",
                "ticker": "F",
                "title": "Is Ford Motor Company (F) The Best Stock Under $10 to Buy Now?",
                "url": "https://finance.yahoo.com/news/ford-motor-company-f-best-193955182.html"
            },
            {
                "headline": "Trump's 25% auto tariffs are likely to drive up car prices, squeeze supply chains and hit import-heavy automakers. Used cars may be a better deal, but not for long.",
                "publication_date": "2025-04-01T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.2382",
                "source": "Zacks",
                "ticker": "F",
                "title": "Trump's 25% Auto Tariffs: Who Wins, Who Loses & What it Means for You?",
                "url": "https://finance.yahoo.com/news/trumps-25-auto-tariffs-wins-133000630.html"
            },
            {
                "headline": "Ford Motor Company (NYSE: F) finds itself at a crossroads as it navigates a challenging landscape.  Its electric vehicle segment has struggled, and today, the stock trades 33% below its 52-week high.  The automotive industry also is feeling the pressure from intensifying trade wars as President Donald Trump recently announced a 25% tariff on all imported vehicles and foreign-made auto parts.",
                "publication_date": "2025-04-01T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.7269",
                "source": "Motley Fool",
                "ticker": "F",
                "title": "Should You Buy Ford While It's Trading Below $10.50?",
                "url": "https://finance.yahoo.com/news/buy-ford-while-trading-below-083900450.html"
            },
            {
                "headline": "On Thursday, The Wall Street Journal reported that Trump had warned auto makers not to raise prices in response to his plan to place 25% import tariffs on all cars and key components starting on Wednesday.  Without price increases, the impact on profit margins would be devastating.  Over the weekend, however, Trump told NBC News he didn’t tell auto makers to avoid raising prices.",
                "publication_date": "2025-04-01T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.6908",
                "source": "Barrons.com",
                "ticker": "F",
                "title": "Car Stocks Fall as Bad News on Trump Tariffs Outweighs Positives",
                "url": "https://finance.yahoo.com/m/34024c5b-3aa5-3298-a118-f159657723a4/car-stocks-fall-as-bad-news.html"
            },
            {
                "headline": "US automakers are making a last-ditch effort to sway the Trump administration on tariffs set to take effect this week, contending that levies on the thousands of parts they source abroad could have catastrophic effects on the industry.",
                "publication_date": "2025-04-01T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.4939",
                "source": "Bloomberg",
                "ticker": "F",
                "title": "US automakers make mad dash to persuade Trump to temper tariffs",
                "url": "https://finance.yahoo.com/news/us-automakers-mad-dash-persuade-013847428.html"
            }
        ],
        "avgScore": -0.08212222222222221
    },
    "3 31 2025": {
        "importantArticles": [
            {
                "headline": "The department aims to further develop the automaker's suite of software and digital services to inspire customer loyalty.",
                "publication_date": "2025-03-31T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.802",
                "source": "Automotive Dive",
                "ticker": "F",
                "title": "Ford taps Lululemon exec to lead integrated services unit",
                "url": "https://finance.yahoo.com/news/ford-taps-lululemon-exec-lead-104600608.html"
            },
            {
                "headline": "A recent report from the Energy Futures Institute raises concerns about government-mandated electric vehicle (EV) sales targets in British Columbia and Canada, suggesting these policies could disrupt markets and limit consumer choice. The report argues that such mandates may lead to financial strain for automakers, increase vehicle prices, and disproportionately impact lower-income consumers. Additionally, it highlights that current EV sales are heavily reliant on government subsidies, and...",
                "publication_date": "2025-03-31T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.2732",
                "source": "Simply Wall St.",
                "ticker": "F",
                "title": "Electric Vehicles Update - Reevaluating EV Sales Targets To Balance Markets And Consumer Choice",
                "url": "https://finance.yahoo.com/news/electric-vehicles-reevaluating-ev-sales-101129203.html"
            },
            {
                "headline": "And so the dip-buying in markets continues.",
                "publication_date": "2025-03-31T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Yahoo Finance",
                "ticker": "F",
                "title": "Commentary: Why are investors buying the dip in stocks?",
                "url": "https://finance.yahoo.com/news/commentary-why-are-investors-buying-the-dip-in-stocks-123013662.html"
            },
            {
                "headline": "Tariffs will raise prices, dent sales, and raise the age of the American auto fleet. Cuba redux?",
                "publication_date": "2025-03-31T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Yahoo Finance",
                "ticker": "F",
                "title": "Commentary: Trump risks the 'Cubanization' of the US auto fleet",
                "url": "https://finance.yahoo.com/news/commentary-trump-risks-the-cubanization-of-the-us-auto-fleet-161417721.html"
            },
            {
                "headline": "And so the dip-buying in markets continues.",
                "publication_date": "2025-03-31T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Yahoo Finance",
                "ticker": "F",
                "title": "Commentary: Why are investors buying the dip in stocks?",
                "url": "https://finance.yahoo.com/news/commentary-why-are-investors-buying-the-dip-in-stocks-123013662.html"
            },
            {
                "headline": "A recent report from the Energy Futures Institute raises concerns about government-mandated electric vehicle (EV) sales targets in British Columbia and Canada, suggesting these policies could disrupt markets and limit consumer choice. The report argues that such mandates may lead to financial strain for automakers, increase vehicle prices, and disproportionately impact lower-income consumers. Additionally, it highlights that current EV sales are heavily reliant on government subsidies, and...",
                "publication_date": "2025-03-31T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.2732",
                "source": "Simply Wall St.",
                "ticker": "F",
                "title": "Electric Vehicles Update - Reevaluating EV Sales Targets To Balance Markets And Consumer Choice",
                "url": "https://finance.yahoo.com/news/electric-vehicles-reevaluating-ev-sales-101129203.html"
            }
        ],
        "avgScore": 0.26880000000000004
    },
    "3 28 2025": {
        "importantArticles": [
            {
                "headline": "Shares of automotive manufacturer Ford (NYSE:F) fell 5.3% in the pre-market session after President Trump announced 25% tariffs on all cars imported into the United States. Stocks of automakers that don't source materials and make all vehicles in the United States appeared to have been hit the hardest. The prospect of higher tariffs raises concerns about reduced profit margins, disrupted operations, and a potential slowdown in future growth. For these automakers, the new policy also introduces f",
                "publication_date": "2025-03-28T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.926",
                "source": "StockStory",
                "ticker": "F",
                "title": "Why Ford (F) Stock Is Down Today",
                "url": "https://finance.yahoo.com/news/why-ford-f-stock-down-190002330.html"
            },
            {
                "headline": "Investing.com -- On Wednesday, the Trump administration confirmed a sweeping 25% tariff on all imported completed vehicles and certain auto parts not made in the United States, effective April 2, 2025. This move is seen by Deutsche Bank as a permanent policy aimed at incentivizing the reshoring of automotive production to the US, rather than a temporary negotiating tactic. Deutsche Bank analyst Edison Yu said, \"We sense the administration is fundamentally supportive of some level of incremental",
                "publication_date": "2025-03-28T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8481",
                "source": "Investing.com",
                "ticker": "F",
                "title": "Deutsche Bank sees auto tariffs as more than negotiation tactic",
                "url": "https://finance.yahoo.com/news/deutsche-bank-sees-auto-tariffs-174607690.html"
            },
            {
                "headline": "Both European and American automakers are seeing their shares take a hit from President Trump's decision to put a 25% levy on vehicles and some auto parts imported into the US. There are a couple of auto stocks moving higher though. Both Tesla and Rivian are trading higher given how much of their production is in the United States. Stay up to date on the latest market action, minute-by-minute, with Yahoo Finance's Market Minute.",
                "publication_date": "2025-03-28T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.6124",
                "source": "Yahoo Finance Video",
                "ticker": "F",
                "title": "Auto stocks feel the impact of Trump's latest tariff: Market Minute",
                "url": "https://finance.yahoo.com/video/auto-stocks-feel-impact-trumps-152124933.html"
            },
            {
                "headline": "(Bloomberg) -- Donald Trump’s planned tariffs on auto imports will hurt carmakers around the world and push up prices for US consumers. Among the many losers, one winner stands out: Elon Musk’s Tesla Inc.Most Read from BloombergWhy Did the Government Declare War on My Adorable Tiny Truck?How SUVs Are Making Traffic WorseTrump Slashed International Aid. Geneva Is Feeling the Impact.These US Bridges Face High Risk of Catastrophic Ship StrikesAffordable Housing Developers Stalled by Blocked Federal",
                "publication_date": "2025-03-28T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.9062",
                "source": "Bloomberg",
                "ticker": "F",
                "title": "Musk’s Tesla One of the Only Winners From Trump Car Tariffs",
                "url": "https://finance.yahoo.com/news/musk-tesla-one-only-winners-145123898.html"
            },
            {
                "headline": "Morning Brief hosts Brad Smith and Madison Mills highlight three stories to watch for. President Trump's push for a 25% tariff on autos is sending shockwaves through the European and American auto industries, with European stocks falling and automakers like Mercedes-Benz (MBGYY) facing potential major losses. American car stocks are mixed today, with General Motors (GM) and Ford (FORD) lower while Tesla (TSLA) trades higher. Additionally, President Trump threatens larger tariffs on the EU and Canada, and US stock futures (ES=F, NQ=F, YM=F) point to a lower open as investors digest the news of Trump's tariffs. To watch more expert insights and analysis on the latest market action, check out more Morning Brief&nbsp;here.",
                "publication_date": "2025-03-28T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.6597",
                "source": "Yahoo Finance Video",
                "ticker": "F",
                "title": "Auto tariffs, trade talks, stock futures: 3 Things",
                "url": "https://finance.yahoo.com/video/auto-tariffs-trade-talks-stock-131832976.html"
            },
            {
                "headline": "While Wall Street frets about potential volatility from President Trump's April 2 tariff 'Liberation Day' plans, another part of America is also bracing for more chaos: US ports.",
                "publication_date": "2025-03-28T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.6115",
                "source": "Yahoo Finance",
                "ticker": "F",
                "title": "How the rollout of Trump's reciprocal tariffs could become an 'absolute nightmare' at US ports",
                "url": "https://finance.yahoo.com/news/how-the-rollout-of-trumps-reciprocal-tariffs-could-become-an-absolute-nightmare-at-us-ports-080042120.html"
            }
        ],
        "avgScore": 0.023169565217391355
    },
    "3 27 2025": {
        "importantArticles": [
            {
                "headline": "A new report from Clean Energy Canada highlights a crucial opportunity to advance Electric Vehicle (EV) adoption by ensuring new condo developments in Canada include EV charging infrastructure. As Canada plans to build four million new homes over the next decade, the report emphasizes the importance of installing EV chargers in new constructions, as it is significantly more cost-effective than retrofitting existing buildings. Currently, only a few provinces, like Quebec, have EV readiness...",
                "publication_date": "2025-03-27T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9136",
                "source": "Simply Wall St.",
                "ticker": "F",
                "title": "This Week In Electric Vehicles - Boosting Condo EV Charging Access for Canada's Green Future",
                "url": "https://finance.yahoo.com/news/week-electric-vehicles-boosting-condo-120717101.html"
            },
            {
                "headline": "President Donald Trump is set to announce the details of his plan for auto tariffs later this afternoon. Detroit Free Press automotive reporter Jamie Lareau joins Market Domination to discuss what people are expecting. To watch more expert insights and analysis on the latest market action, check out more Market Domination here.",
                "publication_date": "2025-03-27T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.4404",
                "source": "Yahoo Finance Video",
                "ticker": "F",
                "title": "Trump to announce auto tariffs",
                "url": "https://finance.yahoo.com/video/trump-announce-auto-tariffs-191022966.html"
            },
            {
                "headline": "In the Oval Office on Wednesday, President Trump announced a 25% tariff on imported vehicles. Hear what he had to say in the video above. For more expert insight and the latest market action, click here.",
                "publication_date": "2025-03-27T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Yahoo Finance Video",
                "ticker": "F",
                "title": "Trump announces a 25% tariff on imported vehicles",
                "url": "https://finance.yahoo.com/video/trump-announces-25-tariff-imported-214426119.html"
            },
            {
                "headline": "We recently published a list of Jim Cramer Recently Talked About These 12 Companies. In this article, we are going to take a look at where Ford Motor Company (NYSE:F) stands against other stocks that Jim Cramer discussed recently. Jim Cramer, host of Mad Money, warned investors on Friday that until there is more clarity […]",
                "publication_date": "2025-03-27T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.3197",
                "source": "Insider Monkey",
                "ticker": "F",
                "title": "Jim Cramer On Ford Motor Company (F) – “A Black Hole for Earnings? I’m Not Blessing That”",
                "url": "https://finance.yahoo.com/news/jim-cramer-ford-motor-company-143757903.html"
            },
            {
                "headline": "Auto stocks fell Wednesday afterhours as the White House unveiled new automotive tariffs. President Trump said he would impose 25% tariffs on global automotive imports to the U.S., making good on pledge to impose duties on cars and trucks from other nations.",
                "publication_date": "2025-03-27T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.128",
                "source": "The Wall Street Journal",
                "ticker": "F",
                "title": "Auto Industry Stocks Drop on Tariff News",
                "url": "https://finance.yahoo.com/m/0cf1bed9-22f5-3bcf-8b17-1db014eda445/auto-industry-stocks-drop-on.html"
            },
            {
                "headline": "Investing.com -- President Donald Trump is set to hold a press conference later on Wednesday to announcement new tariffs on auto imports.",
                "publication_date": "2025-03-27T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Investing.com",
                "ticker": "F",
                "title": "Trump to announce auto tariffs at 4pm ET",
                "url": "https://finance.yahoo.com/news/trump-announce-auto-tariffs-4pm-175642403.html"
            }
        ],
        "avgScore": 0.15105
    },
    "3 26 2025": {
        "importantArticles": [
            {
                "headline": "F is under investigation for nearly 1.3 million F-150 trucks in the United States due to reports of sudden gear downshifts that can temporarily lock the rear wheels.",
                "publication_date": "2025-03-26T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.4215",
                "source": "Zacks",
                "ticker": "F",
                "title": "Ford's 1.3M F-150 Trucks Under Scrutiny in US Due to a Defect in Gear",
                "url": "https://finance.yahoo.com/news/fords-1-3m-f-150-173100772.html"
            },
            {
                "headline": "In 1913, Henry Ford introduced the assembly line in his automobile factory, turning Detroit into the Motor City and forever changing the way that industry looked at production. Today, we’re looking at several coming changes in the automotive industry, with the potential to be just as disruptive as Ford’s factory: viable electric vehicles, self-driving technology, connected smart tech, and who knows what else. The challenge for investors in today’s automotive environment is finding the stocks tha",
                "publication_date": "2025-03-26T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.1779",
                "source": "TipRanks",
                "ticker": "F",
                "title": "Tesla or Ford: Piper Sandler Selects the Superior Stock to Buy",
                "url": "https://finance.yahoo.com/news/tesla-ford-piper-sandler-selects-120211757.html"
            },
            {
                "headline": "Mike O’Brien kept a meticulous log of mixed metaphors and malaprops uttered in meetings over a decade; ‘too many cooks in the soup’",
                "publication_date": "2025-03-26T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "The Wall Street Journal",
                "ticker": "F",
                "title": "The Ford Executive Who Kept Score of Colleagues’ Verbal Flubs",
                "url": "https://finance.yahoo.com/m/48779ba7-f2d4-325f-a522-b22097b650d3/the-ford-executive-who-kept.html"
            },
            {
                "headline": "Hyundai (HYMTF) is set to announce a $20B investment in U.S. onshoring that includes a $5B steel plant in Louisiana, people familiar with the plans told CNBC’s Seema Mody. The new steel plant will produce next-generation steel that will be used by Hyundai’s two U.S. auto plants to manufacture electric vehicles, the report noted. The investment is expected to be announced Monday at the White House by President Donald Trump, Hyundai Chairman Euisun Chung and Louisiana Gov. Jeff Landry, CNBC added.",
                "publication_date": "2025-03-26T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "TipRanks",
                "ticker": "F",
                "title": "Hyundai to announce $20B investment in U.S., CNBC reports",
                "url": "https://finance.yahoo.com/news/hyundai-announce-20b-investment-u-124636477.html"
            },
            {
                "headline": "In the latest trading session, Ford Motor Company (F) closed at $10.29, marking a +0.39% move from the previous day.",
                "publication_date": "2025-03-26T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Zacks",
                "ticker": "F",
                "title": "Ford Motor Company (F) Surpasses Market Returns: Some Facts Worth Knowing",
                "url": "https://finance.yahoo.com/news/ford-motor-company-f-surpasses-214516560.html"
            },
            {
                "headline": "Earnings results often indicate what direction a company will take in the months ahead. With Q4 behind us, let’s have a look at Tesla (NASDAQ:TSLA) and its peers.",
                "publication_date": "2025-03-26T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "StockStory",
                "ticker": "F",
                "title": "Q4 Earnings Highs And Lows: Tesla (NASDAQ:TSLA) Vs The Rest Of The Automobile Manufacturing Stocks",
                "url": "https://finance.yahoo.com/news/q4-earnings-highs-lows-tesla-090146697.html"
            }
        ],
        "avgScore": 0.09989999999999999
    },
    "3 25 2025": {
        "importantArticles": [
            {
                "headline": "We recently published a list of 12 Best Battery Stocks to Buy According to Billionaires. In this article, we are going to take a look at where Ford Motor Company (NYSE:F) stands against other best battery stocks to buy according to billionaires. Batteries are essential to our global energy landscape, especially nowadays, as they contribute […]",
                "publication_date": "2025-03-25T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8885",
                "source": "Insider Monkey",
                "ticker": "F",
                "title": "Is Ford Motor Company (F) The Best Battery Stock to Buy According to Billionaires?",
                "url": "https://finance.yahoo.com/news/ford-motor-company-f-best-183159939.html"
            },
            {
                "headline": "The National Highway Traffic Safety Administration is looking into unexpected gear downshifting in 1.3 million F-150 trucks.",
                "publication_date": "2025-03-25T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.4215",
                "source": "Barrons.com",
                "ticker": "F",
                "title": "Ford F-150 Trucks Are Under Investigation. What to Know.",
                "url": "https://finance.yahoo.com/m/b6061b5f-01a6-3723-bd23-43c12782ec9f/ford-f-150-trucks-are-under.html"
            },
            {
                "headline": "Auto stocks including Ford (F), General Motors (GM), and Stellantis (STLA) are trading in the green amid reports of President Trump's targeted tariffs. Threadneedle Ventures Founder Ann Berry joins Catalysts host Madison Mills to break down the impact of tariffs on the auto industry. To watch more expert insights and analysis on the latest market action, check out more Catalysts here.",
                "publication_date": "2025-03-25T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Yahoo Finance Video",
                "ticker": "F",
                "title": "Auto stocks rise on narrowed tariff plan",
                "url": "https://finance.yahoo.com/video/auto-stocks-rise-narrowed-tariff-152546936.html"
            },
            {
                "headline": "Federal regulators have opened an investigation into nearly 1.3 million Ford F-150 trucks after consumers complained the vehicle unexpectedly downshifted while traveling at high speeds, causing it to rapidly slow down and increasing the risk of a crash.",
                "publication_date": "2025-03-25T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.7579",
                "source": "Investopedia",
                "ticker": "F",
                "title": "Ford Faces Investigation of 1.3M F-150 Trucks Over Potential Safety Issue",
                "url": "https://finance.yahoo.com/news/ford-faces-investigation-1-3m-142245686.html"
            },
            {
                "headline": "We recently compiled a list of the 12 Most Widely Held Stocks by Individuals in 2025. In this article, we are going to take a look at where Ford Motor Company (NYSE:F) stands against the other stocks widely held by individuals in 2025. Individual investors, often called retail investors, typically invest their personal capital directly […]",
                "publication_date": "2025-03-25T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Insider Monkey",
                "ticker": "F",
                "title": "Is Ford Motor Company (F) Widely Held by Individuals in 2025?",
                "url": "https://finance.yahoo.com/news/ford-motor-company-f-widely-130537049.html"
            },
            {
                "headline": "Auto stocks including Ford (F), General Motors (GM), and Stellantis (STLA) are trading in the green amid reports of President Trump's targeted tariffs. Threadneedle Ventures Founder Ann Berry joins Catalysts host Madison Mills to break down the impact of tariffs on the auto industry. To watch more expert insights and analysis on the latest market action, check out more Catalysts here.",
                "publication_date": "2025-03-25T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Yahoo Finance Video",
                "ticker": "F",
                "title": "Auto stocks rise on narrowed tariff plan",
                "url": "https://finance.yahoo.com/video/auto-stocks-rise-narrowed-tariff-152546936.html"
            }
        ],
        "avgScore": 0.11042
    },
    "3 24 2025": {
        "importantArticles": [
            {
                "headline": "The National Highway Traffic Safety Administration is investigating nearly 1.3 million Ford F-150 pickup trucks in the United States over reports of an unexpected gear downshift accompanied by a temporary rear wheel lock-up.  NHTSA said Monday it is opening a preliminary evaluation into some Ford F-150 pickup trucks from the 2015 to 2017 model years after receiving complaints from 138 consumers.  A Ford spokesperson said Monday the automaker is \"working with NHTSA to support its investigation\" and said it is related to vehicles with six-speed transmissions.",
                "publication_date": "2025-03-24T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.6808",
                "source": "Reuters",
                "ticker": "F",
                "title": "US opens probe into nearly 1.3 million Ford F-150 trucks over unexpected gear shift",
                "url": "https://finance.yahoo.com/news/us-opens-probe-nearly-1-092254595.html"
            },
            {
                "headline": "Tesla, Ford, General Motors and Alphabet's have been highlighted in this Investment Ideas article.",
                "publication_date": "2025-03-24T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Zacks",
                "ticker": "F",
                "title": "Zacks Investment Ideas feature highlights Tesla, Ford, General Motors and Alphabet's",
                "url": "https://finance.yahoo.com/news/zacks-investment-ideas-feature-highlights-075300554.html"
            },
            {
                "headline": "Not at  Ford Motor  where it probably means the dividend needs to be slashed.  Ford has said President Trump’s new import tariffs, if sustained, would cause its earnings to tumble.  A dividend cut would appear likely, based on Ford’s latest profitability guidance.",
                "publication_date": "2025-03-24T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.2263",
                "source": "The Wall Street Journal",
                "ticker": "F",
                "title": "Ford’s Fat Dividend Could Be a Casualty of Tariffs",
                "url": "https://finance.yahoo.com/m/c53672e2-1f4f-3db2-9f78-aca2a6a20ed0/ford%E2%80%99s-fat-dividend-could-be.html"
            },
            {
                "headline": "Analysts are turning more cautious on U.S. corporate earnings for the first quarter of this year, with the Trump administration's policies threatening to trigger a global trade war that could undermine economic growth.  Apple, Tesla and Ford Motor are among companies contributing the most to recently lowered estimates for the quarter, along with some insurers, whose projections have been hurt by fires in California early this year, according to Tajinder Dhillon, senior research analyst at LSEG.  S&P 500 forecasts for the first quarter of 2025 have fallen by 4.5 percentage points since January 1, the largest downward revision since the fourth quarter of 2023, he said.",
                "publication_date": "2025-03-24T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.9355",
                "source": "Reuters",
                "ticker": "F",
                "title": "First-quarter US earnings outlook looks less rosy with tariff worries in focus",
                "url": "https://finance.yahoo.com/news/first-quarter-us-earnings-outlook-100242843.html"
            },
            {
                "headline": "Not at  Ford Motor  where it probably means the dividend needs to be slashed.  Ford has said President Trump’s new import tariffs, if sustained, would cause its earnings to tumble.  A dividend cut would appear likely, based on Ford’s latest profitability guidance.",
                "publication_date": "2025-03-24T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.2263",
                "source": "The Wall Street Journal",
                "ticker": "F",
                "title": "Ford’s Fat Dividend Could Be a Casualty of Tariffs",
                "url": "https://finance.yahoo.com/m/c53672e2-1f4f-3db2-9f78-aca2a6a20ed0/ford%E2%80%99s-fat-dividend-could-be.html"
            },
            {
                "headline": "Tesla, Ford, General Motors and Alphabet's have been highlighted in this Investment Ideas article.",
                "publication_date": "2025-03-24T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Zacks",
                "ticker": "F",
                "title": "Zacks Investment Ideas feature highlights Tesla, Ford, General Motors and Alphabet's",
                "url": "https://finance.yahoo.com/news/zacks-investment-ideas-feature-highlights-075300554.html"
            }
        ],
        "avgScore": -0.12025000000000001
    },
    "3 21 2025": {
        "importantArticles": [
            {
                "headline": "Xcel Energy, in partnership with Itron, Inc. and Tesla, is set to deploy an advanced virtual power plant (VPP) in Colorado. The initiative integrates Itron’s IntelliFLEX Aggregator Distributed Energy Resource Management System (DERMS) and Tesla home batteries to enhance grid management, flexibility, and control. This collaboration is part of Xcel Energy's Renewable Battery Connect program, utilizing distributed energy resources (DERs) like residential battery storage and solar panels to...",
                "publication_date": "2025-03-21T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8807",
                "source": "Simply Wall St.",
                "ticker": "F",
                "title": "This Week In Electric Vehicles - Xcel Energy Advances Renewable Energy with Virtual Power Plant",
                "url": "https://finance.yahoo.com/news/week-electric-vehicles-xcel-energy-100939948.html"
            },
            {
                "headline": "Tesla’s reputational troubles and Stellantis’s falling sales are the latest examples of the obstacles facing transnational auto manufacturers.",
                "publication_date": "2025-03-21T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.7351",
                "source": "The Wall Street Journal",
                "ticker": "F",
                "title": "From Ford to Musk, the Perils of Trying to Build a Global Auto Empire",
                "url": "https://finance.yahoo.com/m/f45db4b8-b169-39a6-9512-a2b595641dcf/from-ford-to-musk-the-perils.html"
            },
            {
                "headline": "Tesla’s reputational troubles and Stellantis’s falling sales are the latest examples of the obstacles facing transnational auto manufacturers.",
                "publication_date": "2025-03-21T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.7351",
                "source": "The Wall Street Journal",
                "ticker": "F",
                "title": "From Ford to Musk, the Perils of Trying to Build a Global Auto Empire",
                "url": "https://finance.yahoo.com/m/f45db4b8-b169-39a6-9512-a2b595641dcf/from-ford-to-musk-the-perils.html"
            },
            {
                "headline": "Xcel Energy, in partnership with Itron, Inc. and Tesla, is set to deploy an advanced virtual power plant (VPP) in Colorado. The initiative integrates Itron’s IntelliFLEX Aggregator Distributed Energy Resource Management System (DERMS) and Tesla home batteries to enhance grid management, flexibility, and control. This collaboration is part of Xcel Energy's Renewable Battery Connect program, utilizing distributed energy resources (DERs) like residential battery storage and solar panels to...",
                "publication_date": "2025-03-21T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8807",
                "source": "Simply Wall St.",
                "ticker": "F",
                "title": "This Week In Electric Vehicles - Xcel Energy Advances Renewable Energy with Virtual Power Plant",
                "url": "https://finance.yahoo.com/news/week-electric-vehicles-xcel-energy-100939948.html"
            }
        ],
        "avgScore": 0.07280000000000003
    },
    "coef": 0.2270676691729323,
    "avgCoef": -0.01918645602166226,
    "similar": {
        "NKE": 0.4240601503759398,
        "HTZ": 0.3578947368421052,
        "RIOT": 0.35639097744360904,
        "SNAP": 0.34736842105263155
    }
}