{
    "Important Articles": [
        {
            "headline": "Freeport-McMoRan (NYSE:FCX) recently affirmed a cash dividend of $0.15 per share, which may have played a role in its share price increase of 16% over the past month. This dividend announcement, with its structured payout comprising both a base and a performance-based variable component, coincided with a broader market characterized by declines in major technology stocks and a generally volatile landscape. While the tech sector saw a notable downturn, FCX's strong movement suggests investor...",
            "publication_date": "2025-03-26T17:29:56.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.886",
            "source": "Simply Wall St.",
            "ticker": "FCX",
            "title": "Freeport-McMoRan (NYSE:FCX) Declares US$0.15 Dividend As Shares Jump 8%",
            "url": "https://finance.yahoo.com/news/freeport-mcmoran-nyse-fcx-declares-172956961.html"
        },
        {
            "headline": "Freeport-McMoRan (NYSE:FCX) recently affirmed a cash dividend of $0.15 per share, integrating a base and variable payout structure that aligns with its performance-based framework. This move highlights the company's commitment to returning value to shareholders against a backdrop of market volatility. Over the last month, FCX shares rose 3%, possibly buoyed by the dividend announcement. Despite broader market fluctuations, with major indexes like the S&P 500 recovering from steep losses...",
            "publication_date": "2025-04-02T17:36:55.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.872",
            "source": "Simply Wall St.",
            "ticker": "FCX",
            "title": "Freeport-McMoRan (NYSE:FCX) Affirms US$0.15 Dividend Amidst Price Rise (3% Over Last Month)",
            "url": "https://finance.yahoo.com/news/freeport-mcmoran-nyse-fcx-affirms-173655240.html"
        },
        {
            "headline": "We recently published a list of the 10 Best Copper Stocks to Buy According to Wall Street Analysts. In this article, we are going to take a look at where Freeport-McMoRan Inc. (NYSE:FCX) stands against other best copper stocks to buy according to Wall Street analysts. The U.S. stock market has changed rapidly since the […]",
            "publication_date": "2025-04-04T23:08:36.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.8555",
            "source": "Insider Monkey",
            "ticker": "FCX",
            "title": "Is Freeport-McMoRan Inc. (FCX) the Best Copper Stock to Buy According to Wall Street Analysts?",
            "url": "https://finance.yahoo.com/news/freeport-mcmoran-inc-fcx-best-230836591.html"
        },
        {
            "headline": "(Bloomberg) -- Copper prices plunged below $9,000 a ton in the biggest drop since March 2020 as worries over the impact of a worsening trade war sparked a heavy selloff in metals and mining equities.Most Read from BloombergHousing Agency Aims to Relocate Its DC HeadquartersMetro-North Is Faster Than Acela on NYC-New Haven Route After Signal UpdatesLocal Governments Vie for Fired Federal WorkersWhat Would ‘Transportation Abundance’ Look Like?London Clears Final Hurdle for More High-Speed Trains t",
            "publication_date": "2025-04-04T17:04:11.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.9337",
            "source": "Bloomberg",
            "ticker": "FCX",
            "title": "Copper Plunges Most in 5 Years as Tariffs Slam Metals and Miners",
            "url": "https://finance.yahoo.com/news/copper-plunges-more-5-tariffs-112616302.html"
        },
        {
            "headline": "We recently published a list of Jim Cramer Discusses These 10 Stocks & Says “Traders Are Dumb As Wood.” In this article, we are going to take a look at where Freeport-McMoRan Inc. (NYSE:FCX) stands against other stocks that Jim Cramer discussed. In his latest appearance on CNBC’s Squawk on the Street, Jim Cramer commented […]",
            "publication_date": "2025-03-27T16:12:55.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.5106",
            "source": "Insider Monkey",
            "ticker": "FCX",
            "title": "Jim Cramer on Freeport-McMoRan (FCX): “Gold’s A Good by Product of Freeport. And Gold Is Hitting Another High”",
            "url": "https://finance.yahoo.com/news/jim-cramer-freeport-mcmoran-fcx-161255159.html"
        },
        {
            "headline": "(Bloomberg) -- Carved into a mountain range in Arizona’s Sonoran Desert, where temperatures often reach 118F (48C), a vast mining complex more than a century old is on the front lines of a race to unlock millions of tons of copper.Most Read from BloombergWhat Frank Lloyd Wright Learned From the DesertLondon Clears Final Hurdle for More High-Speed Trains to EuropeMetro-North Is Faster Than Acela on NYC-New Haven Route After Signal UpdatesLocal Governments Vie for Fired Federal WorkersBank Regulat",
            "publication_date": "2025-04-02T10:00:11.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.4939",
            "source": "Bloomberg",
            "ticker": "FCX",
            "title": "An American Mine Still Has Millions of Tons of Copper, If Companies Can Get to It",
            "url": "https://finance.yahoo.com/news/american-mine-still-millions-tons-100011532.html"
        }
    ],
    "Avg Score": 0.15094500000000002
}