{
    "Important Articles": [
        {
            "headline": "Whether you're a value, growth, or momentum investor, finding strong stocks becomes easier with the Zacks Style Scores, a top feature of the Zacks Premium research service.",
            "publication_date": "2025-04-02T13:50:07.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.8979",
            "source": "Zacks",
            "ticker": "GM",
            "title": "Here's Why General Motors (GM) is a Strong Momentum Stock",
            "url": "https://finance.yahoo.com/news/heres-why-general-motors-gm-135007183.html"
        },
        {
            "headline": "General Motors (NYSE:GM) recently announced a partnership with GM Energy and EnergyHub to integrate electric vehicles and energy storage solutions into utility programs across the U.S., providing financial incentives to eligible EV owners. Despite these efforts towards innovation and energy management, General Motors saw a 4% decline in its share price over the last month. This decline occurred amidst broader market volatility driven by uncertainty surrounding potential tariffs announced by...",
            "publication_date": "2025-04-02T17:54:49.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.8658",
            "source": "Simply Wall St.",
            "ticker": "GM",
            "title": "General Motors (NYSE:GM) Partners With EnergyHub For U.S. Grid Incentives Amid 10% Share Dip",
            "url": "https://finance.yahoo.com/news/general-motors-nyse-gm-partners-175449173.html"
        },
        {
            "headline": "President Trump made good on his tariff promise for foreign made autos, slapping 25% tariffs across the board on foreign-made automobiles.",
            "publication_date": "2025-04-02T21:01:56.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.6369",
            "source": "Yahoo Finance",
            "ticker": "GM",
            "title": "Trump makes good on auto tariff threat with 25% levy on foreign-made cars",
            "url": "https://finance.yahoo.com/news/trump-makes-good-on-auto-tariff-threat-with-25-levy-on-foreign-made-cars-210156415.html"
        },
        {
            "headline": "GM sells 442,000 vehicles in China in Q1, almost flat year over year but down sequentially. With rising local competition, GM faces a tough battle ahead.",
            "publication_date": "2025-04-04T16:39:00.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.631",
            "source": "Zacks",
            "ticker": "GM",
            "title": "How's General Motors Faring in China Amid Fierce Competition?",
            "url": "https://finance.yahoo.com/news/hows-general-motors-faring-china-163900735.html"
        },
        {
            "headline": "Trump's tariffs have thrown the auto industry into turmoil, with Canada hitting back. Consumers and automakers now brace up for rising costs and disruptions.",
            "publication_date": "2025-04-04T13:58:00.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.5994",
            "source": "Zacks",
            "ticker": "GM",
            "title": "Canada's Retaliatory Tariffs Fuel Trump's Trade War, Roil Auto Sector",
            "url": "https://finance.yahoo.com/news/canadas-retaliatory-tariffs-fuel-trumps-135800328.html"
        },
        {
            "headline": "(Bloomberg) -- Supply Lines is a daily newsletter that tracks global trade. Sign up here.Most Read from BloombergHousing Agency Aims to Relocate Its DC HeadquartersMetro-North Is Faster Than Acela on NYC-New Haven Route After Signal UpdatesLocal Governments Vie for Fired Federal WorkersLondon Clears Final Hurdle for More High-Speed Trains to EuropeWhat Would ‘Transportation Abundance’ Look Like?Just hours after taking effect, President Donald Trump’s 25% tariffs on imported cars are already reve",
            "publication_date": "2025-04-03T18:57:40.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.5106",
            "source": "Bloomberg",
            "ticker": "GM",
            "title": "Carmakers Idle Plants, Rethink Prices as Trump’s Tariffs Hit",
            "url": "https://finance.yahoo.com/news/trump-25-us-auto-import-105245329.html"
        }
    ],
    "Avg Score": 0.1372
}