{
    "4 17 2025": {
        "importantArticles": [
            {
                "headline": "We recently published a list of the 10 Best Machine Learning Stocks to Buy Now. In this article, we are going to take a look at where Alphabet Inc. (NASDAQ:GOOGL) stands against other machine-learning stocks. Grand View Research reported that the global machine-learning market was valued at $36.73 billion in 2022. It’s now expected to […]",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8779",
                "source": "Insider Monkey",
                "ticker": "GOOGL",
                "title": "Is Alphabet Inc. (NASDAQ:GOOGL) the Best Machine Learning Stock to Buy Now?",
                "url": "https://finance.yahoo.com/news/alphabet-inc-nasdaq-googl-best-170024335.html"
            },
            {
                "headline": "CIBC lowered the firm’s price target on Celestica (CLS) to $120 from $150 and keeps an Outperformer rating on the shares following quarterly results. The firm says that while it is encouraged by Google (GOOGL) and Amazon’s (AMZN) 2025 Gen-AI related capex plans for datacenter buildouts that should benefit hardware suppliers including Celestica, what is less clear is the impact from U.S. export tariffs of 36% on Thailand, which is home to Celestica’s second-largest manufacturing location. This is",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.818",
                "source": "TipRanks",
                "ticker": "GOOGL",
                "title": "Celestica price target lowered to $120 from $150 at CIBC",
                "url": "https://finance.yahoo.com/news/celestica-price-target-lowered-120-150545221.html"
            },
            {
                "headline": "Well-known investor Josh Brown disclosed on CNBC recently that he had sold all of his shares of Alphabet (GOOG,GOOGL). Brown, the CEO of Ritholtz Wealth Management, stated that he was concerned about the impact of ChatGPT on Alphabet’s core internet search business. Details About Brown’s Decision and His Motivation After selling half of his GOOG […]",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7783",
                "source": "Insider Monkey",
                "ticker": "GOOGL",
                "title": "Prominent Investor Unloads His GOOG Stock",
                "url": "https://finance.yahoo.com/news/prominent-investor-unloads-goog-stock-171959265.html"
            },
            {
                "headline": "Middle Coast Investing, an investment advisor firm, released its first-quarter investor letter. A copy of the letter can be downloaded here. Middle Coast Investing had a difficult but manageable first quarter, but everyone has suffered since the Liberation Day crash at the beginning of the second quarter. To manage the volatility, the firm decided to […]",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.8625",
                "source": "Insider Monkey",
                "ticker": "GOOGL",
                "title": "What Makes Alphabet (GOOG) a Better Stock Compared to its Peers?",
                "url": "https://finance.yahoo.com/news/makes-alphabet-goog-better-stock-150444264.html"
            },
            {
                "headline": "LONDON (Reuters) -Alphabet's Google is being sued in Britain for potential damages of up to 5 billion pounds ($6.6 billion) in a class action alleging the company abused its dominant market position in the online search industry.  The class action, filed at the Competition Appeal Tribunal on Tuesday, argues that Google's actions enabled it to charge higher prices for the advertisements that appear in search inquiries than it otherwise could in a competitive market.  It said the U.S. tech giant contracted phone makers to pre-install Google Search and the Chrome browser on Android devices and paid Apple to make it the default search engine on iPhones, with the intention of shutting out competition.",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.7964",
                "source": "Reuters",
                "ticker": "GOOGL",
                "title": "Google faces 5 billion pound UK lawsuit for abusing dominance in online search",
                "url": "https://finance.yahoo.com/news/google-faces-5-billion-pound-090629934.html"
            },
            {
                "headline": "Investing.com -- Alphabet Inc’s (NASDAQ:GOOGL) Google is facing a class action lawsuit in the U.K., where it’s being sued for potential damages exceeding £5 billion ($6.6 billion).",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5859",
                "source": "Investing.com",
                "ticker": "GOOGL",
                "title": "Google faces £5 billion lawsuit in U.K. over alleged market abuse",
                "url": "https://finance.yahoo.com/news/google-faces-5-billion-lawsuit-102205564.html"
            }
        ],
        "avgScore": 0.12435714285714283
    },
    "4 16 2025": {
        "importantArticles": [
            {
                "headline": "Which of the \"Magnificent Seven\" stocks has the most generative artificial intelligence (AI) patents?  You might think it's a company like Microsoft, which has developed extensive generative AI capabilities for its popular products, or Nvidia, which develops the chips that make AI technology possible.  Based on The Motley Fool's latest research, Alphabet has 631 different generative AI patents -- second most among U.S. companies and a far greater number than any of its big-tech counterparts.",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9367",
                "source": "Motley Fool",
                "ticker": "GOOGL",
                "title": "This Artificial Intelligence (AI) Company Is a Leader in Generative AI Patents. Investors, Take Note.",
                "url": "https://finance.yahoo.com/news/artificial-intelligence-ai-company-most-103700920.html"
            },
            {
                "headline": "Alphabet (NASDAQ: GOOGL) (NASDAQ: GOOG) stock reached an all-time high price of $207.05 on Feb. 4, riding a wave of strong growth and earnings momentum from 2024.  At the time of writing on April 11, shares of Alphabet are down 24% from that record high.  Innovations in areas like machine learning, automation, and generative AI are rapidly transforming the global economy.",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.875",
                "source": "Motley Fool",
                "ticker": "GOOGL",
                "title": "4 Reasons Alphabet Could Be the Best Artificial Intelligence (AI) Stock to Buy Right Now",
                "url": "https://finance.yahoo.com/news/4-reasons-alphabet-could-best-171700547.html"
            },
            {
                "headline": "The live TV streaming business is one of this year's biggest winners, but the best could be yet to come.",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8338",
                "source": "Motley Fool",
                "ticker": "GOOGL",
                "title": "3 Reasons to Buy Fubo Stock Like There's No Tomorrow",
                "url": "https://finance.yahoo.com/news/3-reasons-buy-fubo-stock-100000999.html"
            },
            {
                "headline": "BRUSSELS (Reuters) -A German media company has complained to EU antitrust regulators following Alphabet unit Google's crackdown against companies gaming its search algorithm to push up rankings for other sites.  In its complaint to the European Commission, Hamburg-based ActMeraki, until recently called Meraki Group GmbH, urged immediate action against the policy, saying it penalises websites.  Launched in March last year, Google's site reputation abuse policy targets the practice of publishing third-party pages on a site in an attempt to abuse search rankings by taking advantage of the host site's ranking signals, commonly referred to as parasite SEO.",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.8957",
                "source": "Reuters",
                "ticker": "GOOGL",
                "title": "Google's spam policy hit by EU antitrust complaint from German media company",
                "url": "https://finance.yahoo.com/news/googles-spam-policy-hit-eu-164252261.html"
            },
            {
                "headline": "(Bloomberg) -- Japan’s Fair Trade Commission ordered Alphabet Inc.’s Google to stop alleged abuse of its market power over local smartphone manufacturers, just ahead of high-stakes trade negotiations with the US this week.Most Read from BloombergHow Did This Suburb Figure Out Mass Transit?Even Oslo Has an Air Quality ProblemNYC Tourist Helicopter Crashes in Hudson River, Killing Six$15 Million Fund Bets Leadership Training Can Improve Chicago PolicingLA County Floats Leaner Budget Burdened by Fi",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.8519",
                "source": "Bloomberg",
                "ticker": "GOOGL",
                "title": "Japan Orders Google to Stop Forcing Phone Makers to Use Apps",
                "url": "https://finance.yahoo.com/news/japan-orders-google-stop-forcing-103019112.html"
            },
            {
                "headline": "It's not an easy matter to make predictions about the stock market, since no one really knows what it will do from day to day or even year to year.  First off, why am I focusing on Costco?  Costco's forward-looking price-to-earnings (P/E) ratio, for example, was recently 50, well above its five-year average of 39.",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.3777",
                "source": "Motley Fool",
                "ticker": "GOOGL",
                "title": "Prediction: 3 Stocks That'll Be Worth More Than Costco 10 Years From Now",
                "url": "https://finance.yahoo.com/news/prediction-3-stocks-thatll-worth-134500902.html"
            }
        ],
        "avgScore": 0.15630666666666668
    },
    "4 15 2025": {
        "importantArticles": [
            {
                "headline": "We recently published a list of 30 Best AI Stocks to Buy According to Billionaires. In this article, we are going to take a look at where Alphabet Inc. (NASDAQ:GOOG) stands against other best AI stocks to buy according to billionaires. The optimism around the United States economy over the past few months, largely due […]",
                "publication_date": "2025-04-15T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9403",
                "source": "Insider Monkey",
                "ticker": "GOOGL",
                "title": "Alphabet (GOOG) Unveils Gemini 2.5, Plans $75B AI Push in 2025",
                "url": "https://finance.yahoo.com/news/alphabet-goog-unveils-gemini-2-132521603.html"
            },
            {
                "headline": "Google's AI research lab, Google DeepMind, says that it has created an AI model that can help decipher dolphin vocalizations, supporting research efforts to better understand how dolphins communicate. The model, called DolphinGemma, was trained using data from the Wild Dolphin Project (WDP), a nonprofit that studies Atlantic spotted dolphins and their behaviors. Built on Google's open Gemma series of models, DolphinGemma, which can generate \"dolphin-like\" sound sequences, is efficient enough to",
                "publication_date": "2025-04-15T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9062",
                "source": "TechCrunch",
                "ticker": "GOOGL",
                "title": "Google's newest AI model is designed to help study dolphin 'speech'",
                "url": "https://finance.yahoo.com/news/googles-newest-ai-model-designed-162655313.html"
            },
            {
                "headline": "We recently published a list of 10 Best Bargain Stocks to Buy in May. In this article, we are going to take a look at where Alphabet Inc. (NASDAQ:GOOGL) stands against other best bargain stocks to buy in May. While increasing tariffs and a hard sell-off have resulted in uncertainty, Neuberger Berman, an investment manager, expects […]",
                "publication_date": "2025-04-15T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8481",
                "source": "Insider Monkey",
                "ticker": "GOOGL",
                "title": "Is  Alphabet Inc. (GOOGL)the Best Bargain Stock to Buy in May?",
                "url": "https://finance.yahoo.com/news/alphabet-inc-googl-best-bargain-192959255.html"
            },
            {
                "headline": "Investing.com -- Citi has trimmed target prices (TPs) and earnings projections for several U.S. internet stocks amid the negative effects of recently imposed tariffs, more limited macro visibility, and a weakening outlook for online advertising.",
                "publication_date": "2025-04-15T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.8173",
                "source": "Investing.com",
                "ticker": "GOOGL",
                "title": "Citi cuts internet stock targets amid tariffs and softer macro",
                "url": "https://finance.yahoo.com/news/citi-cuts-internet-stock-targets-125235785.html"
            },
            {
                "headline": "The stock of Alphabet (NASDAQ: GOOG) (NASDAQ: GOOGL) has fallen off in recent months because of tariff-related economic uncertainty.  The overriding concern with Alphabet is that generative AI could eat into its main cash cow, Google Search.  Meanwhile, Alphabet has several other high-growth businesses under its corporate umbrella, including YouTube, the leading streaming service in the world, and Google Cloud, which saw accelerating growth last year.",
                "publication_date": "2025-04-15T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.3182",
                "source": "Motley Fool",
                "ticker": "GOOGL",
                "title": "Waymo Is Taking Off Fast in Austin, Texas. Here's Why That's Great News for Alphabet -- and Even Better News for Uber.",
                "url": "https://finance.yahoo.com/news/waymo-taking-off-fast-austin-100000919.html"
            },
            {
                "headline": "The funding round was led by San Francisco-based venture capital firm Greenoaks Capital Partners.",
                "publication_date": "2025-04-15T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Verdict",
                "ticker": "GOOGL",
                "title": "Alphabet and Nvidia invest in AI startup SSI at $32bn",
                "url": "https://finance.yahoo.com/news/alphabet-nvidia-invest-ai-startup-102359815.html"
            }
        ],
        "avgScore": 0.28336
    },
    "4 14 2025": {
        "importantArticles": [
            {
                "headline": "The U.S. stock market has been extremely volatile since President Donald Trump rolled out hefty tariffs on goods from virtually every country this month, and that wild ride has continued in the wake of his move Wednesday to temporarily hold those new import taxes at 10% for all countries except China, for which he increased them to 145%.  While no investment is a sure thing, here are three reasons why buying Alphabet (NASDAQ: GOOGL) (NASDAQ: GOOG) stock now could look like a great decision in years to come.  While other companies with exposure to the artificial intelligence (AI) trend might get more attention, Alphabet has a strong position in AI through its cloud infrastructure services and its Gemini chatbot.",
                "publication_date": "2025-04-14T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9349",
                "source": "Motley Fool",
                "ticker": "GOOGL",
                "title": "3 Reasons to Buy Alphabet Stock Like There's No Tomorrow",
                "url": "https://finance.yahoo.com/news/3-reasons-buy-alphabet-stock-080500357.html"
            },
            {
                "headline": "We recently published a list of 10 Best Kid-Friendly Stocks to Buy According to Billionaires. In this article, we are going to take a look at where Alphabet Inc. (NASDAQ:GOOGL) stands against other best kid-friendly stocks to buy according to billionaires. The market has been undergoing a volatile spell these past few days. Economic data […]",
                "publication_date": "2025-04-14T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8555",
                "source": "Insider Monkey",
                "ticker": "GOOGL",
                "title": "Is Alphabet Inc. (GOOGL) the Best Kid-Friendly Stock to Buy According to Billionaires?",
                "url": "https://finance.yahoo.com/news/alphabet-inc-googl-best-kid-182254753.html"
            },
            {
                "headline": "While Microsoft has backed off some leases recently with its data center buildout, both Amazon (NASDAQ: AMZN) and Alphabet (NASDAQ: GOOGL) (NASDAQ: GOOG) look prepared to go full steam ahead.  Microsoft still plans to spend around $80 billion on infrastructure capital expenditures (capex) for artificial intelligence (AI) this fiscal year, but its fiscal year ends in June, only a couple of months from now.  For its part, OpenAI is looking to build out its own capacity; it's part of Project Stargate, which plans to spend $500 billion on AI data centers over the next few years.",
                "publication_date": "2025-04-14T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.4404",
                "source": "Motley Fool",
                "ticker": "GOOGL",
                "title": "Amazon and Alphabet Bet Big on AI. Why History Says It's Time to Buy Both Stocks",
                "url": "https://finance.yahoo.com/news/amazon-alphabet-bet-big-ai-224500163.html"
            },
            {
                "headline": "Two that look like screaming buys right now are Taiwan Semiconductor Manufacturing (NYSE: TSM) and Alphabet (NASDAQ: GOOG) (NASDAQ: GOOGL).  Each of these stocks is so cheap right now that investors cannot afford to miss out on the deals the market is offering.  At first glance, Taiwan Semiconductor appears to be an odd pick.",
                "publication_date": "2025-04-14T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.2396",
                "source": "Motley Fool",
                "ticker": "GOOGL",
                "title": "2 Dirt Cheap Stocks Investors Can't Afford to Miss Out on During the Stock Market Chaos",
                "url": "https://finance.yahoo.com/news/2-dirt-cheap-stocks-investors-123000570.html"
            },
            {
                "headline": "A small amount of money can go a long way when it's invested in industry leaders with well-defined catalysts.",
                "publication_date": "2025-04-14T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Motley Fool",
                "ticker": "GOOGL",
                "title": "Nasdaq Bear Market: 3 Unstoppable Stocks You Can Buy With $300 Right Now",
                "url": "https://finance.yahoo.com/news/nasdaq-bear-market-3-unstoppable-070600305.html"
            },
            {
                "headline": "Agentic AI is the engine behind Google Workspace Flows.",
                "publication_date": "2025-04-14T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Verdict",
                "ticker": "GOOGL",
                "title": "Google Workspace momentum at Google Cloud Next ‘25",
                "url": "https://finance.yahoo.com/news/google-workspace-momentum-google-cloud-071116371.html"
            }
        ],
        "avgScore": 0.3360571428571429
    },
    "4 11 2025": {
        "importantArticles": [
            {
                "headline": "Alphabet Inc's Google unit is partnering with the largest electrical grid operator in North America, PJM Interconnection, to roll out artificial intelligence technologies aimed at getting new power supplies connected faster, the company said on Thursday.  Electricity demand has been rising as Big Tech builds more data centers to train and deploy artificial intelligence.  \"The industry has been talking about building smarter grids for well over a decade, and now with AI, we have a real opportunity to turn discussion into action,\" Amanda Peterson Corio, Google's data center energy lead, said at a press conference.",
                "publication_date": "2025-04-11T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9287",
                "source": "Reuters",
                "ticker": "GOOGL",
                "title": "Google deploys AI to speed up connections at PJM, largest US power grid",
                "url": "https://finance.yahoo.com/news/google-deploys-ai-speed-connections-090627379.html"
            },
            {
                "headline": "The \"Magnificent Seven\" has long since dominated markets (^GSPC,&nbsp;^IXIC,&nbsp;^DJI) and investor focus, but that dominance may not last forever. Northwestern Mutual Wealth Management Company chief investment officer Brent Schutte joins Morning Brief to discuss the importance of diversifying investments and the likelihood that new leaders will emerge in the market in the coming years. To watch more expert insights and analysis on the latest market action, check out more Morning Brief&nbsp;here.",
                "publication_date": "2025-04-11T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9042",
                "source": "Yahoo Finance Video",
                "ticker": "GOOGL",
                "title": "Get diversified: 'Mag 7 will no longer be the Mag 7' in 5 years",
                "url": "https://finance.yahoo.com/video/diversified-mag-7-no-longer-153000531.html"
            },
            {
                "headline": "For those who can afford it without blowing their budget, it's actually a great idea to pick up shares of top companies on the dip during a correction.  With that in mind, here are two excellent growth-oriented companies to buy in the ongoing market meltdown: tech giant Alphabet (NASDAQ: GOOG) (NASDAQ: GOOGL) and medical device maker DexCom (NASDAQ: DXCM).",
                "publication_date": "2025-04-11T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8957",
                "source": "Motley Fool",
                "ticker": "GOOGL",
                "title": "2 Growth Stocks to Buy in the Tariff-Fueled Market Correction",
                "url": "https://finance.yahoo.com/news/2-growth-stocks-buy-tariff-141500336.html"
            },
            {
                "headline": "We recently published a list of 10 AI Stocks to Watch Now. In this article, we are going to take a look at where Alphabet Inc. (NASDAQ:GOOGL) stands against other AI stocks to watch now. The trade war between two of the world’s biggest economies, China and the US, is deepening even further. In a […]",
                "publication_date": "2025-04-11T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5994",
                "source": "Insider Monkey",
                "ticker": "GOOGL",
                "title": "Alphabet’s (GOOGL) Ironwood AI Chip Drops – 9,000+ Chip Clusters Powering Gemini Models",
                "url": "https://finance.yahoo.com/news/alphabet-googl-ironwood-ai-chip-213112569.html"
            },
            {
                "headline": "We recently published a list of Jim Cramer Calls Market Decline ‘Man-Made’ and Breaks Down 15 Stocks. In this article, we are going to take a look at where Alphabet Inc. (NASDAQ:GOOGL) stands against other stocks that Jim Cramer discusses. On Monday, April 7th, Jim Cramer opened the Mad Money episode with a message of […]",
                "publication_date": "2025-04-11T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.4939",
                "source": "Insider Monkey",
                "ticker": "GOOGL",
                "title": "Alphabet Inc. (GOOGL): Jim Cramer Says Generative AI Poses ‘Existential Threat’ to Google Search",
                "url": "https://finance.yahoo.com/news/alphabet-inc-googl-jim-cramer-162857189.html"
            },
            {
                "headline": "Google pushes forward with $75B capex for data centers and AI compute as trade pressure on China escalates",
                "publication_date": "2025-04-11T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.296",
                "source": "GuruFocus.com",
                "ticker": "GOOGL",
                "title": "Google to Spend $75 Billion on AI Infrastructure Despite Tariff Tensions",
                "url": "https://finance.yahoo.com/news/google-spend-75-billion-ai-134816774.html"
            }
        ],
        "avgScore": 0.39235555555555546
    },
    "4 10 2025": {
        "importantArticles": [
            {
                "headline": "Alphabet (NasdaqGS:GOOGL) experienced a 5% rise last week, in alignment with broader market trends marked by a sharp rebound. The company's recent collaborations, such as Shirofune's integration with Google's DV360 and Bentley Systems' use of Google Maps for asset analytics, could enhance Alphabet's advertising and geospatial offerings. Meanwhile, the tech-heavy Nasdaq saw a substantial 12% increase amid tariff-related news, providing a favorable environment for heavyweight tech firms...",
                "publication_date": "2025-04-10T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8271",
                "source": "Simply Wall St.",
                "ticker": "GOOGL",
                "title": "Alphabet (NasdaqGS:GOOGL) Expands Advertising and Infrastructure Solutions With New Partnerships",
                "url": "https://finance.yahoo.com/news/alphabet-nasdaqgs-googl-expands-advertising-054136822.html"
            },
            {
                "headline": "Alphabet's self-driving unit Waymo said on Thursday it will start collecting data in Tokyo with test rides operated by human drivers next week, marking the first time the company will be using its cars on public roads outside the United States.  The California-based autonomous driving company will deploy 25 driver-operated electric Jaguar I-PACE to map key areas of the Japanese capital and gain insights into local infrastructure and driving patterns.  \"It's important for us to understand the difference in driving environment, what makes the driving here unique,\" Nicole Gavel, Waymo's head of business development and strategic partnerships, told reporters at an event in Tokyo.",
                "publication_date": "2025-04-10T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7906",
                "source": "Reuters",
                "ticker": "GOOGL",
                "title": "Waymo to begin data collection in Tokyo with driver-operated test rides",
                "url": "https://finance.yahoo.com/news/waymo-begin-data-collection-tokyo-054632914.html"
            },
            {
                "headline": "Just a few weeks after OpenAI said it would adopt rival Anthropic’s standard for connecting AI models to the systems where data resides, Google is following suit. In a post on X on Wednesday, Google DeepMind CEO Demis Hassabis said Google would add support for Anthropic’s Model Context Protocol, or MCP, to its Gemini models and SDK. He did not specify a timeline for when this would be done. \"MCP is a good protocol and it's rapidly becoming an open standard for the AI agentic era,\" wrote Hassabis",
                "publication_date": "2025-04-10T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.743",
                "source": "TechCrunch",
                "ticker": "GOOGL",
                "title": "Google to embrace Anthropic’s standard for connecting AI models to data",
                "url": "https://finance.yahoo.com/news/google-says-itll-embrace-anthropic-231842524.html"
            },
            {
                "headline": "President Trump threw out what appeared to be a lifeline to tech companies Wednesday by suspending onerous tariffs that had sent their stocks spiraling downward.  The uncertainty over trade barriers is still rattling Big Tech and the global economy.  Trump’s reprieve pushed  Nvidia’s  stock above where it was before he imposed tariffs last week, but the trade war with China is escalating, not easing, and huge uncertainty remains.",
                "publication_date": "2025-04-10T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.9307",
                "source": "The Wall Street Journal",
                "ticker": "GOOGL",
                "title": "Tariffs Are Still Coming for the AI Boom",
                "url": "https://finance.yahoo.com/m/24eb806e-1e5d-3b58-917b-390720595b5d/tariffs-are-still-coming-for.html"
            },
            {
                "headline": "President Trump's announcement of tariffs on imports from countries worldwide has rocked the stock market -- and the tech-heavy Nasdaq Composite (NASDAQINDEX: ^IXIC) has led the decline, crashing more than 20% from its most recent high.  Why are tech stocks being hit so hard?  All this has prompted investors to worry about tech earnings ahead, fleeing shares of these companies.",
                "publication_date": "2025-04-10T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.3749",
                "source": "Motley Fool",
                "ticker": "GOOGL",
                "title": "The Stock Market Has Crashed: My Top 5 Dirt Cheap Tech Stocks to Buy Now",
                "url": "https://finance.yahoo.com/news/stock-market-crashed-top-5-221000917.html"
            },
            {
                "headline": "Just a few weeks after OpenAI said it would adopt rival Anthropic’s standard for connecting AI models to the systems where data resides, Google is following suit. In a post on X on Wednesday, Google DeepMind CEO Demis Hassabis said Google would add support for Anthropic’s Model Context Protocol, or MCP, to its Gemini models and SDK. He did not specify a timeline for when this would be done. \"MCP is a good protocol and it's rapidly becoming an open standard for the AI agentic era,\" wrote Hassabis",
                "publication_date": "2025-04-10T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.743",
                "source": "TechCrunch",
                "ticker": "GOOGL",
                "title": "Google to embrace Anthropic’s standard for connecting AI models to data",
                "url": "https://finance.yahoo.com/news/google-says-itll-embrace-anthropic-231842524.html"
            }
        ],
        "avgScore": 0.21101999999999999
    },
    "coef": 0.3714285714285715,
    "avgCoef": 0.009294366513035278,
    "similar": {
        "RF": 0.7714285714285715,
        "PTON": 0.7714285714285715,
        "MU": 0.6571428571428573,
        "TSLA": 0.6
    }
}