{
    "4 22 2025": {
        "importantArticles": [
            {
                "headline": "WASHINGTON (Reuters) -Alphabet's Google needs strong measures imposed on it to prevent it from using its artificial intelligence products to extend its dominance in online search, a U.S. Department of Justice attorney said as a trial in the historic antitrust case began on Monday.  The outcome of the case could fundamentally reshape the internet by unseating Google as the go-to portal for information online.  The Justice Department is seeking an order that would require Google to sell its Chrome browser and take other measures to end what a judge found was its monopoly in online search.",
                "publication_date": "2025-04-22T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9382",
                "source": "Reuters",
                "ticker": "GOOGL",
                "title": "Google could use AI to extend search monopoly, DOJ says as trial begins",
                "url": "https://finance.yahoo.com/news/google-faces-trial-us-bid-101354412.html"
            },
            {
                "headline": "Explore these capable videoconferencing freebies that offer more than Zoom’s free tier.",
                "publication_date": "2025-04-22T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8387",
                "source": "FastCompany",
                "ticker": "GOOGL",
                "title": "Set your meetings free with these no-cost Zoom alternatives",
                "url": "https://finance.yahoo.com/news/set-meetings-free-no-cost-043000898.html"
            },
            {
                "headline": "When it comes to designing semiconductor chips used to power artificial intelligence (AI) workloads, two companies stand head and shoulders above the rest: Nvidia (NASDAQ: NVDA) and Broadcom (NASDAQ: AVGO).  Nvidia has been the biggest early winner in AI chips, but Broadcom has been gaining momentum.  Nvidia and Broadcom are taking two very different approaches to the AI chip market.",
                "publication_date": "2025-04-22T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7992",
                "source": "Motley Fool",
                "ticker": "GOOGL",
                "title": "Better AI Chip Stock: Nvidia vs. Broadcom",
                "url": "https://finance.yahoo.com/news/better-ai-chip-stock-nvidia-220000502.html"
            },
            {
                "headline": "Alphabet (GOOG, GOOGL) fights a breakup of its businesses, as Monday marked the first day of the remedies phase of the antitrust trial. Yahoo Finance Senior Legal Reporter Alexis Keenan breaks down the arguments from the Google parent company and US antitrust regulators. To watch more expert insights and analysis on the latest market action, check out more Market Domination Overtime here.",
                "publication_date": "2025-04-22T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.6573",
                "source": "Yahoo Finance Video",
                "ticker": "GOOGL",
                "title": "Google's antitrust breakup trial: What to know",
                "url": "https://finance.yahoo.com/video/googles-antitrust-breakup-trial-know-210843962.html"
            },
            {
                "headline": "The judge who found that the tech company maintained an illegal monopoly is asked to force it to sell its Chrome web browser.",
                "publication_date": "2025-04-22T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5574",
                "source": "The Wall Street Journal",
                "ticker": "GOOGL",
                "title": "Justice Department Urges Tough Action to Break Google’s Search Dominance",
                "url": "https://finance.yahoo.com/m/02169725-77b8-3dd3-b254-6486d0c7700d/justice-department-urges.html"
            },
            {
                "headline": "Tech stocks were lower late Monday afternoon, with the Technology Select Sector SPDR Fund (XLK) drop",
                "publication_date": "2025-04-22T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5106",
                "source": "MT Newswires",
                "ticker": "GOOGL",
                "title": "Sector Update: Tech Stocks Slump Late Afternoon",
                "url": "https://finance.yahoo.com/news/sector-tech-stocks-slump-afternoon-194733385.html"
            }
        ],
        "avgScore": 0.04330256410256409,
        "pctChange": 0.017328241262885395
    },
    "4 21 2025": {
        "importantArticles": [
            {
                "headline": "Tesla and Google parent Alphabet are due to report earnings this week, setting the tone for what could be a rough quarter for Big Tech as the first members of the Magnificent 7 to report this earnings season.",
                "publication_date": "2025-04-21T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.5994",
                "source": "Investopedia",
                "ticker": "GOOGL",
                "title": "Tesla and Alphabet Report This Week. They'll Set the Tone for Big Tech Earnings",
                "url": "https://finance.yahoo.com/news/tesla-alphabet-report-week-theyll-090000391.html"
            },
            {
                "headline": "As Big Tech kicks off its quarterly earnings season this week, the industry's bellwether companies have been thrust into a cauldron of uncertainty and turmoil that they didn't anticipate when Donald Trump re-entered the White House nearly 100 days ago.  Since President Trump's Jan. 20 inauguration, Big Tech stocks have been on a see-sawing ride that has eviscerated trillions of dollars in shareholder wealth amid an onslaught of tariffs and other potentially detrimental actions.  It's the polar opposite of what Apple CEO Tim Cook, Tesla CEO Elon Musk, Google CEO Sundar Pichai, Facebook founder Mark Zuckerberg and Amazon founder Jeff Bezos hoped for when they assembled behind Trump as he was sworn in.",
                "publication_date": "2025-04-21T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.3818",
                "source": "Associated Press Finance",
                "ticker": "GOOGL",
                "title": "Big Tech's 'Magnificent Seven' heads into earnings season reeling from Trump turbulence",
                "url": "https://finance.yahoo.com/news/big-techs-magnificent-seven-heads-003039234.html"
            },
            {
                "headline": "(Bloomberg) -- Hyundai Motor America, Nvidia Corp. and Target Corp. made seven-figure donations to fund President Donald Trump’s record-breaking haul for his second inauguration, according to filings with the Federal Election Commission.Most Read from BloombergDOGE Visits National Gallery of Art to Discuss Museum’s Legal StatusTrump Administration Takes Over New York Penn Station RevampDOGE Places Entire Staff of Federal Homelessness Agency on LeaveNashville’s $3 Billion Transit Plan Brings a Ca",
                "publication_date": "2025-04-21T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.128",
                "source": "Bloomberg",
                "ticker": "GOOGL",
                "title": "Trump Raised Record $239 Million for Inaugural Festivities",
                "url": "https://finance.yahoo.com/news/trump-raised-record-239-million-031032600.html"
            },
            {
                "headline": "Google is confronting an existential threat as the U.S. government tries to break up the company as punishment for turning its revolutionary search engine into an illegal monopoly.  In its opening arguments, federal antitrust enforcers also urged the court to impose forward-looking remedies to prevent Google from using artificial intelligence to further its dominance.  “This is a moment in time, we’re at an inflection point, will we abandon the search market and surrender them to control of the monopolists or will we let competition prevail and give choice to future generations,” said Justice Department attorney David Dahlquist.",
                "publication_date": "2025-04-21T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.8807",
                "source": "Associated Press Finance",
                "ticker": "GOOGL",
                "title": "Google faces off with US government in attempt to break up company in search monopoly case",
                "url": "https://finance.yahoo.com/news/google-face-off-us-government-002008266.html"
            },
            {
                "headline": "The court's documents say that in a video published on YouTube, information on the losses in Ukraine of Russian servicemen, as well as their personal data, were disclosed, TASS reported.  Russia has for several years ordered foreign technology platforms to remove content it deems illegal, such as what it calls \"fakes\" about the war in Ukraine, issuing small but persistent fines when it sees failures to comply.",
                "publication_date": "2025-04-21T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.8422",
                "source": "Reuters",
                "ticker": "GOOGL",
                "title": "Moscow court finds Google guilty of disclosing Russian war casualties, TASS says",
                "url": "https://finance.yahoo.com/news/moscow-court-finds-google-guilty-033727206.html"
            },
            {
                "headline": "Shaken by geopolitical shocks, the S&P 500 was flat last week and the Nasdaq nosed just into the red — but the Dow Jones Industrial Average finished significantly lower, weighed down by a double blow from UnitedHealth (UNH) and Nvidia (NVDA).",
                "publication_date": "2025-04-21T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5789",
                "source": "Quartz",
                "ticker": "GOOGL",
                "title": "Google, Tesla, and IBM earnings lead a make-or-break week for stocks",
                "url": "https://finance.yahoo.com/news/google-tesla-ibm-earnings-lead-110000181.html"
            }
        ],
        "avgScore": -0.1834888888888889,
        "pctChange": 0.02573307441509094
    },
    "4 17 2025": {
        "importantArticles": [
            {
                "headline": "We recently published a list of the 10 Best Machine Learning Stocks to Buy Now. In this article, we are going to take a look at where Alphabet Inc. (NASDAQ:GOOGL) stands against other machine-learning stocks. Grand View Research reported that the global machine-learning market was valued at $36.73 billion in 2022. It’s now expected to […]",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8779",
                "source": "Insider Monkey",
                "ticker": "GOOGL",
                "title": "Is Alphabet Inc. (NASDAQ:GOOGL) the Best Machine Learning Stock to Buy Now?",
                "url": "https://finance.yahoo.com/news/alphabet-inc-nasdaq-googl-best-170024335.html"
            },
            {
                "headline": "CIBC lowered the firm’s price target on Celestica (CLS) to $120 from $150 and keeps an Outperformer rating on the shares following quarterly results. The firm says that while it is encouraged by Google (GOOGL) and Amazon’s (AMZN) 2025 Gen-AI related capex plans for datacenter buildouts that should benefit hardware suppliers including Celestica, what is less clear is the impact from U.S. export tariffs of 36% on Thailand, which is home to Celestica’s second-largest manufacturing location. This is",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.818",
                "source": "TipRanks",
                "ticker": "GOOGL",
                "title": "Celestica price target lowered to $120 from $150 at CIBC",
                "url": "https://finance.yahoo.com/news/celestica-price-target-lowered-120-150545221.html"
            },
            {
                "headline": "Well-known investor Josh Brown disclosed on CNBC recently that he had sold all of his shares of Alphabet (GOOG,GOOGL). Brown, the CEO of Ritholtz Wealth Management, stated that he was concerned about the impact of ChatGPT on Alphabet’s core internet search business. Details About Brown’s Decision and His Motivation After selling half of his GOOG […]",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7783",
                "source": "Insider Monkey",
                "ticker": "GOOGL",
                "title": "Prominent Investor Unloads His GOOG Stock",
                "url": "https://finance.yahoo.com/news/prominent-investor-unloads-goog-stock-171959265.html"
            },
            {
                "headline": "Middle Coast Investing, an investment advisor firm, released its first-quarter investor letter. A copy of the letter can be downloaded here. Middle Coast Investing had a difficult but manageable first quarter, but everyone has suffered since the Liberation Day crash at the beginning of the second quarter. To manage the volatility, the firm decided to […]",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.8625",
                "source": "Insider Monkey",
                "ticker": "GOOGL",
                "title": "What Makes Alphabet (GOOG) a Better Stock Compared to its Peers?",
                "url": "https://finance.yahoo.com/news/makes-alphabet-goog-better-stock-150444264.html"
            },
            {
                "headline": "LONDON (Reuters) -Alphabet's Google is being sued in Britain for potential damages of up to 5 billion pounds ($6.6 billion) in a class action alleging the company abused its dominant market position in the online search industry.  The class action, filed at the Competition Appeal Tribunal on Tuesday, argues that Google's actions enabled it to charge higher prices for the advertisements that appear in search inquiries than it otherwise could in a competitive market.  It said the U.S. tech giant contracted phone makers to pre-install Google Search and the Chrome browser on Android devices and paid Apple to make it the default search engine on iPhones, with the intention of shutting out competition.",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.7964",
                "source": "Reuters",
                "ticker": "GOOGL",
                "title": "Google faces 5 billion pound UK lawsuit for abusing dominance in online search",
                "url": "https://finance.yahoo.com/news/google-faces-5-billion-pound-090629934.html"
            },
            {
                "headline": "Investing.com -- Alphabet Inc’s (NASDAQ:GOOGL) Google is facing a class action lawsuit in the U.K., where it’s being sued for potential damages exceeding £5 billion ($6.6 billion).",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5859",
                "source": "Investing.com",
                "ticker": "GOOGL",
                "title": "Google faces £5 billion lawsuit in U.K. over alleged market abuse",
                "url": "https://finance.yahoo.com/news/google-faces-5-billion-lawsuit-102205564.html"
            }
        ],
        "avgScore": 0.13626190476190475,
        "pctChange": -0.02308815433059484
    },
    "4 16 2025": {
        "importantArticles": [
            {
                "headline": "Alphabet (NASDAQ: GOOGL) (NASDAQ: GOOG) stock reached an all-time high price of $207.05 on Feb. 4, riding a wave of strong growth and earnings momentum from 2024.  At the time of writing on April 11, shares of Alphabet are down 24% from that record high.  Innovations in areas like machine learning, automation, and generative AI are rapidly transforming the global economy.",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.875",
                "source": "Motley Fool",
                "ticker": "GOOGL",
                "title": "4 Reasons Alphabet Could Be the Best Artificial Intelligence (AI) Stock to Buy Right Now",
                "url": "https://finance.yahoo.com/news/4-reasons-alphabet-could-best-171700547.html"
            },
            {
                "headline": "TechInsights has released preliminary findings from its teardown analysis of NVIDIA's Blackwell HGX B200 platform, highlighting significant developments in cloud AI and high-performance computing. The report identifies SK hynix as the supplier of the high-bandwidth memory (HBM3E) used in the platform's GB100 GPU, which features an advanced packaging design by TSMC. This new architecture, which includes TSMC's CoWoS-L packaging, promises substantial performance improvements and represents...",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8176",
                "source": "Simply Wall St.",
                "ticker": "GOOGL",
                "title": "Latest News In Cloud AI - NVIDIA Blackwell HGX B200 Platform Shaping AI's Future",
                "url": "https://finance.yahoo.com/news/latest-news-cloud-ai-nvidia-123741326.html"
            },
            {
                "headline": "We recently compiled a list of the 14 Best American Tech Stocks To Buy Now. In this article, we are going to take a look at where Alphabet Inc. (NASDAQ:GOOGL) stands against the other American tech stocks. American stocks moved up a bit on Monday, April 14 as investors focused on news about tech companies […]",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7783",
                "source": "Insider Monkey",
                "ticker": "GOOGL",
                "title": "Is Alphabet Inc. (GOOGL) The Best American Tech Stock To Buy Now?",
                "url": "https://finance.yahoo.com/news/alphabet-inc-googl-best-american-205202510.html"
            },
            {
                "headline": "BRUSSELS (Reuters) -A German media company has complained to EU antitrust regulators following Alphabet unit Google's crackdown against companies gaming its search algorithm to push up rankings for other sites.  In its complaint to the European Commission, Hamburg-based ActMeraki, until recently called Meraki Group GmbH, urged immediate action against the policy, saying it penalises websites.  Launched in March last year, Google's site reputation abuse policy targets the practice of publishing third-party pages on a site in an attempt to abuse search rankings by taking advantage of the host site's ranking signals, commonly referred to as parasite SEO.",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.8957",
                "source": "Reuters",
                "ticker": "GOOGL",
                "title": "Google's spam policy hit by EU antitrust complaint from German media company",
                "url": "https://finance.yahoo.com/news/googles-spam-policy-hit-eu-164252261.html"
            },
            {
                "headline": "It's not an easy matter to make predictions about the stock market, since no one really knows what it will do from day to day or even year to year.  First off, why am I focusing on Costco?  Costco's forward-looking price-to-earnings (P/E) ratio, for example, was recently 50, well above its five-year average of 39.",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.3777",
                "source": "Motley Fool",
                "ticker": "GOOGL",
                "title": "Prediction: 3 Stocks That'll Be Worth More Than Costco 10 Years From Now",
                "url": "https://finance.yahoo.com/news/prediction-3-stocks-thatll-worth-134500902.html"
            },
            {
                "headline": "Japan orders Google to stop deals with Android phone makers that limit competition in mobile search services",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.296",
                "source": "GuruFocus.com",
                "ticker": "GOOGL",
                "title": "Japan Targets Google Over Alleged Search Monopoly on Android Devices",
                "url": "https://finance.yahoo.com/news/japan-targets-google-over-alleged-125245840.html"
            }
        ],
        "avgScore": 0.12645555555555563,
        "pctChange": -0.01415246946475815
    },
    "coef": -1.0,
    "avgCoef": 0.027565946495384196,
    "similar": {
        "PSLV": 0.9486832980505139,
        "BTG": 0.7999999999999999,
        "NGD": 0.7999999999999999,
        "GOLD": 0.7999999999999999
    }
}