{
    "4 25 2025": {
        "importantArticles": [
            {
                "headline": "Tesla (NASDAQ: TSLA) stock hit a new record high shortly after President Donald Trump's election win last November because investors thought a friendlier regulatory environment could help the company bring its autonomous robotaxi and humanoid robot to market more quickly.  CEO Elon Musk thinks these product platforms will help Tesla become the world's most valuable company one day.  In fact, Musk believes Tesla could eventually be as valuable as the next five largest companies combined.",
                "publication_date": "2025-04-25T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9583",
                "source": "Motley Fool",
                "ticker": "GOOG",
                "title": "Elon Musk Thinks Tesla Will Become the World's Most Valuable Company. Here's Why Its Stock Could Decline by 50% (or More) Instead",
                "url": "https://finance.yahoo.com/news/elon-musk-thinks-tesla-become-114500733.html"
            },
            {
                "headline": "Alphabet (NasdaqGS:GOOGL) saw a 5% price increase last week, building on strong earnings results with a notable rise in sales and net income for Q1 2025. This performance highlighted a robust trajectory with elevated earnings per share, reinforcing investor confidence. Coupled with an expansive $70 billion buyback program, Alphabet's announcements suggested its commitment to enhancing shareholder value. Meanwhile, broader market activity showed mixed movements, with lingering tariff...",
                "publication_date": "2025-04-25T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9477",
                "source": "Simply Wall St.",
                "ticker": "GOOG",
                "title": "Alphabet (NasdaqGS:GOOGL) Reports Q1 Sales of US$90 Billion and Net Income of US$34 Billion",
                "url": "https://finance.yahoo.com/news/alphabet-nasdaqgs-googl-reports-q1-172344427.html"
            },
            {
                "headline": "LONDON (Reuters) -Britain could gain 400 billion pounds ($533 billion) from AI-driven growth if it trained its workforce, Google said, after a pilot scheme in the UK showed workers could save more than 120 hours a year by using AI in administrative tasks.  Simple steps such as giving workers permission to use AI and a few hours of training to get them started could help double the adoption of the new technology, and in turn boost economic growth, Google said in a report on its pilot scheme, published on Friday.  The U.S. tech giant, which developed the Gemini AI chatbot, said that according to analysis by Public First, its partner in the scheme, two thirds of workers - particularly older women from lower socio-economic backgrounds - had never used generative AI at work.",
                "publication_date": "2025-04-25T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9468",
                "source": "Reuters",
                "ticker": "GOOG",
                "title": "Workers could save 122 hours a year by adopting AI in admin tasks, says Google",
                "url": "https://finance.yahoo.com/news/workers-could-save-122-hours-230523442.html"
            },
            {
                "headline": "Stocks were falling Friday as ongoing trade tensions between China and the U.S. overshadowed a solid set of earnings from Google parent Alphabet.  Investors are still struggling to work out if China and the U.S. will be able to broker a trade deal, after Chinese officials said Friday that Beijing and Washington still aren’t negotiating on tariffs.  The market appeared to be zeroing in on those tensions instead of a solid earnings report from Alphabet.",
                "publication_date": "2025-04-25T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.765",
                "source": "Barrons.com",
                "ticker": "GOOG",
                "title": "Stock Futures Slide as Investors Weigh up Trade Tensions, Google Earnings Beat",
                "url": "https://finance.yahoo.com/m/31cd8b87-f91a-33e8-b69e-73b7d5e310a0/stock-futures-slide-as.html"
            },
            {
                "headline": "Google-parent Alphabet is facing risk on multiple fronts. Its search engine is under attack from AI, while courts are calling the business a monopoly.",
                "publication_date": "2025-04-25T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.6369",
                "source": "Barrons.com",
                "ticker": "GOOG",
                "title": "Google Earnings Beat on Strong Margins. The Stock Is Rising.",
                "url": "https://finance.yahoo.com/m/95bf3b14-46f5-3293-89f3-97f83dcc3357/google-earnings-beat-on.html"
            },
            {
                "headline": "U.S.-China ocean shipments slow dramatically amid trade war, Trump pushes deep-sea mining and drilling on public lands, and other news to start your day.",
                "publication_date": "2025-04-25T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5994",
                "source": "Barrons.com",
                "ticker": "GOOG",
                "title": "Google Gives Stock Markets Hope of a Big Tech Comeback and 5 Other Things to Know Today",
                "url": "https://finance.yahoo.com/m/1e87e5c5-a408-3cc5-970d-4b95aad3cc18/google-gives-stock-markets.html"
            }
        ],
        "avgScore": 0.23191093749999997,
        "pctChange": -0.019449430767744438
    },
    "4 24 2025": {
        "importantArticles": [
            {
                "headline": "Google stock currently stands as a better short opportunity than some of the other Magnificent Seven companies like Apple or Microsoft.",
                "publication_date": "2025-04-24T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9022",
                "source": "Investor's Business Daily",
                "ticker": "GOOG",
                "title": "How Google Provides A Better Short Option Than Other Mag 7 Stocks",
                "url": "https://finance.yahoo.com/m/ab775b4c-c120-3e63-8d81-362b8e1d13b0/how-google-provides-a-better.html"
            },
            {
                "headline": "Leigh Palmer, VP, Technology, Delivery & Operations, Google Public Sector, stated in a blog post: “At Google Public Sector, we are committed to helping our customers execute their missions. Now, we’re expanding this commitment by adding support for Palantir’s (PLTR) FedStart platform, so public sector customers can utilize software and applications on Google Cloud’s accredited infrastructure through the Palantir FedStart platform. Palantir FedStart helps U.S. government agencies achieve complian",
                "publication_date": "2025-04-24T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.891",
                "source": "TipRanks",
                "ticker": "GOOG",
                "title": "Palantir FedStart to launch on Google Cloud",
                "url": "https://finance.yahoo.com/news/palantir-fedstart-launch-google-cloud-145519954.html"
            },
            {
                "headline": "Smart investors should be learning about AI, while also aiming to figure out ways to gain exposure in their portfolios.  A good place to start is to look at two dominant internet enterprises: Alphabet (NASDAQ: GOOGL) (NASDAQ: GOOG) and Meta Platforms (NASDAQ: META).  Alphabet has been working on machine learning and AI capabilities within its various products and services for a long time.",
                "publication_date": "2025-04-24T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8402",
                "source": "Motley Fool",
                "ticker": "GOOG",
                "title": "Better Artificial Intelligence Stock: Alphabet vs. Meta Platforms",
                "url": "https://finance.yahoo.com/news/better-artificial-intelligence-stock-alphabet-090300207.html"
            },
            {
                "headline": "Digital wallets are broadly comparable, although they differ on data, fraud monitoring and liability issues, Consumer Reports found in an evaluation.",
                "publication_date": "2025-04-24T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.6808",
                "source": "Payments Dive",
                "ticker": "GOOG",
                "title": "Apple, Google lag fintechs’ wallets for fraud monitoring: report",
                "url": "https://finance.yahoo.com/news/apple-google-lag-fintechs-wallets-094815577.html"
            },
            {
                "headline": "(Bloomberg) -- Wall Street investors weighing the impacts of Donald Trump’s trade war on Corporate America sent stocks climbing amid bets the Federal Reserve could cut rates sooner than anticipated to prevent a recession.Most Read from BloombergTrump Gives New York ‘One Last Chance’ to End Congestion FeeWhy Car YouTuber Matt Farah Is Fighting for Walkable CitiesBackyard Micro-Flats Aim to Ease South Africa’s Housing CrisisThe Racial Wealth Gap Is Not Just About MoneyTo Fuel Affordable Housing, T",
                "publication_date": "2025-04-24T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.4019",
                "source": "Bloomberg",
                "ticker": "GOOG",
                "title": "Stock Rally Powers On as Alphabet Up in Late Hours: Markets Wrap",
                "url": "https://finance.yahoo.com/news/stock-rally-loses-steam-wavering-024243837.html"
            },
            {
                "headline": "The benchmark US stock measures were trending lower before Thursday's opening bell as recent optimis",
                "publication_date": "2025-04-24T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.296",
                "source": "MT Newswires",
                "ticker": "GOOG",
                "title": "Stocks Down Pre-Bell as China Denies Reports of Trade Talks; Alphabet Earnings on Deck",
                "url": "https://finance.yahoo.com/news/stocks-down-pre-bell-china-114042419.html"
            }
        ],
        "avgScore": 0.2994906976744186,
        "pctChange": 0.01473961023607984
    },
    "4 23 2025": {
        "importantArticles": [
            {
                "headline": "We recently published a list of 20 Best Stocks To Buy According to Marjorie Taylor Greene. In this article, we are going to take a look at where Alphabet Inc. (NASDAQ:GOOG) stands against other best stocks to buy according to Marjorie Taylor Greene. Marjorie Taylor Greene is one of the most active members of the […]",
                "publication_date": "2025-04-23T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.908",
                "source": "Insider Monkey",
                "ticker": "GOOG",
                "title": "Is Alphabet Inc. (GOOG) the Best Stock to Buy According to Marjorie Taylor Greene?",
                "url": "https://finance.yahoo.com/news/alphabet-inc-goog-best-stock-210555015.html"
            },
            {
                "headline": "Although Alphabet (NASDAQ: GOOG)(NASDAQ: GOOGL) is currently undergoing a tough antitrust case, investors pushed the prices of its two share classes higher on the second trading day of the week.  Many were cheered by the prospect of a top name in artificial intelligence (AI) potentially buying one of the company's more high-profile assets.  On the day, Alphabet's stock price rose by almost 3%.",
                "publication_date": "2025-04-23T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9017",
                "source": "Motley Fool",
                "ticker": "GOOG",
                "title": "Why Alphabet Stock Cranked Higher Today",
                "url": "https://finance.yahoo.com/news/why-alphabet-stock-cranked-higher-012424751.html"
            },
            {
                "headline": "We recently published a list of 15 Best Nancy Pelosi Stocks To Invest In Now. In this article, we are going to take a look at where Alphabet Inc. (NASDAQ:GOOG) stands against other best nancy pelosi stocks to invest in now. We are aware that Nancy Pelosi isn’t the only member of the Congress with […]",
                "publication_date": "2025-04-23T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8555",
                "source": "Insider Monkey",
                "ticker": "GOOG",
                "title": "Is Alphabet Inc. (GOOG) the Best Nancy Pelosi Stock To Invest In Now?",
                "url": "https://finance.yahoo.com/news/alphabet-inc-goog-best-nancy-170756897.html"
            },
            {
                "headline": "The rise of LLMs for info-seeking poses a threat to search advertising, even as Feds cry monopoly",
                "publication_date": "2025-04-23T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.7579",
                "source": "Zacks",
                "ticker": "GOOG",
                "title": "Google Jeopardy: Advertising, DOJ Threats Pressure Alphabet Stock",
                "url": "https://finance.yahoo.com/news/google-jeopardy-advertising-doj-threats-173800869.html"
            },
            {
                "headline": "BRUSSELS (Reuters) -Alphabet's Google and Elon Musk's X may be the next to face fines from European regulators, as they stay tough on Big Tech despite concerns of retaliatory U.S. tariffs, according to three sources with direct knowledge of the matter.  EU antitrust regulators on Wednesday imposed the first penalties under landmark EU legislation aimed at curbing the power of Big Tech, doling out total fines of 700 million euros ($797 million) to Apple and Meta for violating the Digital Markets Act (DMA) and orders to stop anti-competitive practices.  U.S. President Donald Trump has taken issue with the new rules, believing they amount to a tariff on U.S. companies.",
                "publication_date": "2025-04-23T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.7269",
                "source": "Reuters",
                "ticker": "GOOG",
                "title": "Analysis-Google, X next targets as Europe stays tough on tech regulation",
                "url": "https://finance.yahoo.com/news/analysis-google-x-next-targets-103944708.html"
            },
            {
                "headline": "Big Tech stocks surged for a second day, with ‘Magnificent Seven’ firms adding $455 billion to their market capitalizations Wednesday as the Trump administration hinted at a deescalation of the US-China trade war.",
                "publication_date": "2025-04-23T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5994",
                "source": "Yahoo Finance",
                "ticker": "GOOG",
                "title": "Big Tech stocks gain over $450 billion as Trump, Bessent signal deescalation of US-China trade war",
                "url": "https://finance.yahoo.com/news/big-tech-stocks-gain-over-450-billion-as-trump-bessent-signal-deescalation-of-us-china-trade-war-143427595.html"
            }
        ],
        "avgScore": 0.23478529411764695,
        "pctChange": 0.023776312268426206
    },
    "4 22 2025": {
        "importantArticles": [
            {
                "headline": "WASHINGTON (Reuters) -OpenAI would be interested in buying Google's Chrome if antitrust enforcers are successful in forcing the Alphabet unit to sell the popular web browser as part of a bid to restore competition in search, an OpenAI executive testified on Tuesday at Google's antitrust trial in Washington.  ChatGPT head of product Nick Turley made the statement while testifying at trial in Washington where U.S. Department of Justice seeks to require Google to undertake far-reaching measures restore competition in online search.  The judge overseeing the trial found last year that Google has a monopoly in online search and related advertising.",
                "publication_date": "2025-04-22T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9442",
                "source": "Reuters",
                "ticker": "GOOG",
                "title": "OpenAI would buy Google's Chrome, exec testifies at trial",
                "url": "https://finance.yahoo.com/news/google-contemplated-exclusive-gemini-ai-142944516.html"
            },
            {
                "headline": "Artificial intelligence (AI) technology is currently in its early phases of growth, but it is expected to gain rapid traction in the coming years thanks to its adoption across multiple industries, including cloud computing, automotive, and advertising.  Search engine giant Alphabet is down almost 20% in 2025 as of this writing.  The stock's decline can be attributed to the broader market sell-off as well as concerns that the company may have fallen behind in the AI race as compared to its rivals.",
                "publication_date": "2025-04-22T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8934",
                "source": "Motley Fool",
                "ticker": "GOOG",
                "title": "No-Brainer Buy Alert: 1 Artificial Intelligence (AI) Stock With Massive Long-Term Potential",
                "url": "https://finance.yahoo.com/news/no-brainer-buy-alert-1-211633145.html"
            },
            {
                "headline": "(Bloomberg) -- OpenAI’s goals of building a “super assistant” app and reaching general artificial intelligence won’t succeed without search technology but Google has declined to work with the startup, the head of its ChatGPT product testified Tuesday in the Google antitrust trial.Most Read from BloombergTrump Gives New York ‘One Last Chance’ to End Congestion FeeDOGE Visits National Gallery of Art to Discuss Museum’s Legal StatusThe Racial Wealth Gap Is Not Just About MoneyOpenAI’s Nick Turley s",
                "publication_date": "2025-04-22T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8625",
                "source": "Bloomberg",
                "ticker": "GOOG",
                "title": "ChatGPT Chief Calls Search Crucial for OpenAI in Google Trial",
                "url": "https://finance.yahoo.com/news/chatgpt-chief-calls-search-crucial-180344015.html"
            },
            {
                "headline": "U.S. stocks looked set to open higher Tuesday, clawing back some ground after a brutal Monday selloff. Nasdaq futures rose 0.8%, with the S&P 500 and Dow also in the green.",
                "publication_date": "2025-04-22T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.6249",
                "source": "Quartz",
                "ticker": "GOOG",
                "title": "Google, Tesla, Verizon, Lockheed Martin: Stocks to watch today",
                "url": "https://finance.yahoo.com/news/google-tesla-verizon-lockheed-martin-125025613.html"
            },
            {
                "headline": "Amazon stock has been hit by fears about tariffs and e-commerce but analysts are warning about cloud risks as well.",
                "publication_date": "2025-04-22T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5647",
                "source": "Investor's Business Daily",
                "ticker": "GOOG",
                "title": "Cloud Infrastructure Growth Could Cool This Year Despite AI Excitement, Analyst Says",
                "url": "https://finance.yahoo.com/m/94e65c5a-4318-347d-b84d-8731823848ae/cloud-infrastructure-growth.html"
            },
            {
                "headline": "Anthony Chavez, vice president of the Google-backed Privacy Sandbox initiative, said in July that Google would introduce a new experience in Chrome to let people make an informed choice that applies across their web browsing.  The announcement comes as Alphabet faces legal pressure, after a U.S. judge recently ruled that Google maintains illegal monopolies in online advertising technology — a decision that could potentially lead to a court-ordered breakup of its ad tech business.  Last year, the tech giant scrapped longstanding plans to remove third-party cookies, the tiny packets of code that track users' activity across the internet, from Chrome after advertisers raised concerns that a removal would limit their ability to collect information for personalizing ads, leaving them dependent on Google's own user databases.",
                "publication_date": "2025-04-22T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.4588",
                "source": "Reuters",
                "ticker": "GOOG",
                "title": "Google opts out of standalone prompt for third-party cookies",
                "url": "https://finance.yahoo.com/news/google-opts-standalone-prompt-third-171850860.html"
            }
        ],
        "avgScore": 0.24713235294117647,
        "pctChange": 0.024821361115765533
    },
    "4 21 2025": {
        "importantArticles": [
            {
                "headline": "ChatGPT search, OpenAI's feature within ChatGPT that allows the chatbot to access and incorporate up-to-date information from the web into its responses, is growing at a fast clip in Europe. A report filed by one of OpenAI's EU corporate divisions, OpenAI Ireland Limited, reveals ChatGPT search had roughly 41.3 million average monthly active \"recipients\" for the six-month period ending March 31. That's up from approximately 11.2 million average monthly active recipients in the six-month period e",
                "publication_date": "2025-04-21T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.6369",
                "source": "TechCrunch",
                "ticker": "GOOG",
                "title": "ChatGPT search is growing quickly in Europe, OpenAI data suggests",
                "url": "https://finance.yahoo.com/news/chatgpt-search-growing-quickly-europe-192135069.html"
            },
            {
                "headline": "The kickoff of a high-profile antitrust case against a peer and an analyst's price target reduction put the hurt on Microsoft (NASDAQ: MSFT) shares Monday.  The U.S. Department of Justice's artificial intelligence (AI)-related suit against the company began.  Alphabet, whose core asset is its familiar search engine Google, has landed in hot legal water before, but the DOJ seems particularly determined this time to cut the company down to size.",
                "publication_date": "2025-04-21T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.517",
                "source": "Motley Fool",
                "ticker": "GOOG",
                "title": "Why Microsoft Stock Was Getting Slammed Today",
                "url": "https://finance.yahoo.com/news/why-microsoft-stock-getting-slammed-193737515.html"
            },
            {
                "headline": "Investors prepared for another week of developments on President Trump's fast-moving tariff policies and for the kickoff of Big Tech earnings reports.",
                "publication_date": "2025-04-21T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.2263",
                "source": "Yahoo Finance",
                "ticker": "GOOG",
                "title": "Stock market today: Dow drops 950 points, S&P 500, Nasdaq tumble as Trump bashes Fed's Powell again",
                "url": "https://finance.yahoo.com/news/live/stock-market-today-dow-drops-950-points-sp-500-nasdaq-tumble-as-trump-bashes-feds-powell-again-200049063.html"
            },
            {
                "headline": "Alphabet (GOOG, GOOGL) fights a breakup of its businesses, as Monday marked the first day of the remedies phase of the antitrust trial. Yahoo Finance Senior Legal Reporter Alexis Keenan breaks down the arguments from the Google parent company and US antitrust regulators. To watch more expert insights and analysis on the latest market action, check out more Market Domination Overtime here.",
                "publication_date": "2025-04-21T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.6573",
                "source": "Yahoo Finance Video",
                "ticker": "GOOG",
                "title": "Google's antitrust breakup trial: What to know",
                "url": "https://finance.yahoo.com/video/googles-antitrust-breakup-trial-know-210843962.html"
            },
            {
                "headline": "The judge who found that the tech company maintained an illegal monopoly is asked to force it to sell its Chrome web browser.",
                "publication_date": "2025-04-21T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5574",
                "source": "The Wall Street Journal",
                "ticker": "GOOG",
                "title": "Justice Department Urges Tough Action to Break Google’s Search Dominance",
                "url": "https://finance.yahoo.com/m/02169725-77b8-3dd3-b254-6486d0c7700d/justice-department-urges.html"
            },
            {
                "headline": "Tech stocks were lower late Monday afternoon, with the Technology Select Sector SPDR Fund (XLK) drop",
                "publication_date": "2025-04-21T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5106",
                "source": "MT Newswires",
                "ticker": "GOOG",
                "title": "Sector Update: Tech Stocks Slump Late Afternoon",
                "url": "https://finance.yahoo.com/news/sector-tech-stocks-slump-afternoon-194733385.html"
            }
        ],
        "avgScore": -0.09208333333333334,
        "pctChange": 0.026958449684229818
    },
    "4 15 2025": {
        "importantArticles": [
            {
                "headline": "Alphabet beat Q1 expectations on strength in Services and Cloud, earning analyst praise despite cautious forward views",
                "publication_date": "2025-04-15T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7962",
                "source": "GuruFocus.com",
                "ticker": "GOOG",
                "title": "Alphabet Stuns Wall Street With Blowout Quarter and Bigger Shareholder Rewards",
                "url": "https://finance.yahoo.com/news/alphabet-stuns-wall-street-blowout-211817545.html"
            },
            {
                "headline": "Alphabet beat Q1 expectations on strength in Services and Cloud, earning analyst praise despite cautious forward views",
                "publication_date": "2025-04-15T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7962",
                "source": "GuruFocus.com",
                "ticker": "GOOG",
                "title": "Alphabet Stuns Wall Street With Blowout Quarter and Bigger Shareholder Rewards",
                "url": "https://finance.yahoo.com/news/alphabet-stuns-wall-street-blowout-211817545.html"
            }
        ],
        "avgScore": 0.7962,
        "pctChange": -0.02004028751298651
    },
    "4 8 2025": {
        "importantArticles": [
            {
                "headline": "The Standard & Poor's 500 index rose 4.6% this week, led by technology stocks amid better-than-expec",
                "publication_date": "2025-03-08T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "MT Newswires",
                "ticker": "GOOG",
                "title": "S&P 500 Climbs Weekly as Tech Sector Leads Amid Positive Earnings",
                "url": "https://finance.yahoo.com/news/p-500-climbs-weekly-tech-204026841.html"
            },
            {
                "headline": "U.S. stocks largely ended the week on a high note after a muted opening Friday, as trade-war pessimism gave way to a fourth day of gains for the S&P 500. Meanwhile, Tesla (TSLA) spiked 9.8% as word spread that CEO Elon Musk would spend less time facilitating mass firings via DOGE.",
                "publication_date": "2025-04-08T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "-0.0258",
                "source": "Quartz",
                "ticker": "GOOG",
                "title": "The S&P 500 ends the week up 4% even as hopes for a quick trade war truce fade",
                "url": "https://finance.yahoo.com/news/google-gives-stock-bulls-reason-123149968.html"
            },
            {
                "headline": "U.S. stocks largely ended the week on a high note after a muted opening Friday, as trade-war pessimism gave way to a fourth day of gains for the S&P 500. Meanwhile, Tesla (TSLA) spiked 9.8% as word spread that CEO Elon Musk would spend less time facilitating mass firings via DOGE.",
                "publication_date": "2025-04-08T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "-0.0258",
                "source": "Quartz",
                "ticker": "GOOG",
                "title": "The S&P 500 ends the week up 4% even as hopes for a quick trade war truce fade",
                "url": "https://finance.yahoo.com/news/google-gives-stock-bulls-reason-123149968.html"
            },
            {
                "headline": "The Standard & Poor's 500 index rose 4.6% this week, led by technology stocks amid better-than-expec",
                "publication_date": "2025-03-08T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "MT Newswires",
                "ticker": "GOOG",
                "title": "S&P 500 Climbs Weekly as Tech Sector Leads Amid Positive Earnings",
                "url": "https://finance.yahoo.com/news/p-500-climbs-weekly-tech-204026841.html"
            }
        ],
        "avgScore": -0.0129,
        "pctChange": 0.09878561568192931
    },
    "coef": -0.7142857142857144,
    "avgCoef": -0.0024490369217380955,
    "similar": {
        "PSLV": 0.10714285714285716,
        "NGD": 0.10714285714285716,
        "KGC": 0.03571428571428572,
        "BTG": 0.0
    }
}