{
    "4 24 2025": {
        "importantArticles": [
            {
                "headline": "Chief Executive Sundar Pichai said search saw continued strong growth, boosted by engagement with its artificial intelligence features.",
                "publication_date": "2025-04-24T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.926",
                "source": "The Wall Street Journal",
                "ticker": "GOOG",
                "title": "Alphabet Profit, Revenue Rise With Growth in Advertising, Cloud",
                "url": "https://finance.yahoo.com/m/9bbf5086-d8e9-33d3-b031-2348ff8ba626/alphabet-profit-revenue-rise.html"
            },
            {
                "headline": "Google stock currently stands as a better short opportunity than some of the other Magnificent Seven companies like Apple or Microsoft.",
                "publication_date": "2025-04-24T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9022",
                "source": "Investor's Business Daily",
                "ticker": "GOOG",
                "title": "How Google Provides A Better Short Option Than Other Mag 7 Stocks",
                "url": "https://finance.yahoo.com/m/ab775b4c-c120-3e63-8d81-362b8e1d13b0/how-google-provides-a-better.html"
            },
            {
                "headline": "Leigh Palmer, VP, Technology, Delivery & Operations, Google Public Sector, stated in a blog post: “At Google Public Sector, we are committed to helping our customers execute their missions. Now, we’re expanding this commitment by adding support for Palantir’s (PLTR) FedStart platform, so public sector customers can utilize software and applications on Google Cloud’s accredited infrastructure through the Palantir FedStart platform. Palantir FedStart helps U.S. government agencies achieve complian",
                "publication_date": "2025-04-24T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.891",
                "source": "TipRanks",
                "ticker": "GOOG",
                "title": "Palantir FedStart to launch on Google Cloud",
                "url": "https://finance.yahoo.com/news/palantir-fedstart-launch-google-cloud-145519954.html"
            },
            {
                "headline": "Digital wallets are broadly comparable, although they differ on data, fraud monitoring and liability issues, Consumer Reports found in an evaluation.",
                "publication_date": "2025-04-24T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.6808",
                "source": "Payments Dive",
                "ticker": "GOOG",
                "title": "Apple, Google lag fintechs’ wallets for fraud monitoring: report",
                "url": "https://finance.yahoo.com/news/apple-google-lag-fintechs-wallets-094815577.html"
            },
            {
                "headline": "(Bloomberg) -- Wall Street investors weighing the impacts of Donald Trump’s trade war on Corporate America sent stocks climbing amid bets the Federal Reserve could cut rates sooner than anticipated to prevent a recession.Most Read from BloombergTrump Gives New York ‘One Last Chance’ to End Congestion FeeWhy Car YouTuber Matt Farah Is Fighting for Walkable CitiesBackyard Micro-Flats Aim to Ease South Africa’s Housing CrisisThe Racial Wealth Gap Is Not Just About MoneyTo Fuel Affordable Housing, T",
                "publication_date": "2025-04-24T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.4019",
                "source": "Bloomberg",
                "ticker": "GOOG",
                "title": "Stock Rally Powers On as Alphabet Up in Late Hours: Markets Wrap",
                "url": "https://finance.yahoo.com/news/stock-rally-loses-steam-wavering-024243837.html"
            },
            {
                "headline": "The benchmark US stock measures were trending lower before Thursday's opening bell as recent optimis",
                "publication_date": "2025-04-24T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.296",
                "source": "MT Newswires",
                "ticker": "GOOG",
                "title": "Stocks Down Pre-Bell as China Denies Reports of Trade Talks; Alphabet Earnings on Deck",
                "url": "https://finance.yahoo.com/news/stocks-down-pre-bell-china-114042419.html"
            }
        ],
        "avgScore": 0.2898375000000001,
        "pctChange": 0.018577558351093947
    },
    "4 23 2025": {
        "importantArticles": [
            {
                "headline": "We recently published a list of 20 Best Stocks To Buy According to Marjorie Taylor Greene. In this article, we are going to take a look at where Alphabet Inc. (NASDAQ:GOOG) stands against other best stocks to buy according to Marjorie Taylor Greene. Marjorie Taylor Greene is one of the most active members of the […]",
                "publication_date": "2025-04-23T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.908",
                "source": "Insider Monkey",
                "ticker": "GOOG",
                "title": "Is Alphabet Inc. (GOOG) the Best Stock to Buy According to Marjorie Taylor Greene?",
                "url": "https://finance.yahoo.com/news/alphabet-inc-goog-best-stock-210555015.html"
            },
            {
                "headline": "Although Alphabet (NASDAQ: GOOG)(NASDAQ: GOOGL) is currently undergoing a tough antitrust case, investors pushed the prices of its two share classes higher on the second trading day of the week.  Many were cheered by the prospect of a top name in artificial intelligence (AI) potentially buying one of the company's more high-profile assets.  On the day, Alphabet's stock price rose by almost 3%.",
                "publication_date": "2025-04-23T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9017",
                "source": "Motley Fool",
                "ticker": "GOOG",
                "title": "Why Alphabet Stock Cranked Higher Today",
                "url": "https://finance.yahoo.com/news/why-alphabet-stock-cranked-higher-012424751.html"
            },
            {
                "headline": "We recently published a list of 15 Best Nancy Pelosi Stocks To Invest In Now. In this article, we are going to take a look at where Alphabet Inc. (NASDAQ:GOOG) stands against other best nancy pelosi stocks to invest in now. We are aware that Nancy Pelosi isn’t the only member of the Congress with […]",
                "publication_date": "2025-04-23T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8555",
                "source": "Insider Monkey",
                "ticker": "GOOG",
                "title": "Is Alphabet Inc. (GOOG) the Best Nancy Pelosi Stock To Invest In Now?",
                "url": "https://finance.yahoo.com/news/alphabet-inc-goog-best-nancy-170756897.html"
            },
            {
                "headline": "The rise of LLMs for info-seeking poses a threat to search advertising, even as Feds cry monopoly",
                "publication_date": "2025-04-23T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.7579",
                "source": "Zacks",
                "ticker": "GOOG",
                "title": "Google Jeopardy: Advertising, DOJ Threats Pressure Alphabet Stock",
                "url": "https://finance.yahoo.com/news/google-jeopardy-advertising-doj-threats-173800869.html"
            },
            {
                "headline": "BRUSSELS (Reuters) -Alphabet's Google and Elon Musk's X may be the next to face fines from European regulators, as they stay tough on Big Tech despite concerns of retaliatory U.S. tariffs, according to three sources with direct knowledge of the matter.  EU antitrust regulators on Wednesday imposed the first penalties under landmark EU legislation aimed at curbing the power of Big Tech, doling out total fines of 700 million euros ($797 million) to Apple and Meta for violating the Digital Markets Act (DMA) and orders to stop anti-competitive practices.  U.S. President Donald Trump has taken issue with the new rules, believing they amount to a tariff on U.S. companies.",
                "publication_date": "2025-04-23T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.7269",
                "source": "Reuters",
                "ticker": "GOOG",
                "title": "Analysis-Google, X next targets as Europe stays tough on tech regulation",
                "url": "https://finance.yahoo.com/news/analysis-google-x-next-targets-103944708.html"
            },
            {
                "headline": "Big Tech stocks surged for a second day, with ‘Magnificent Seven’ firms adding $455 billion to their market capitalizations Wednesday as the Trump administration hinted at a deescalation of the US-China trade war.",
                "publication_date": "2025-04-23T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5994",
                "source": "Yahoo Finance",
                "ticker": "GOOG",
                "title": "Big Tech stocks gain over $450 billion as Trump, Bessent signal deescalation of US-China trade war",
                "url": "https://finance.yahoo.com/news/big-tech-stocks-gain-over-450-billion-as-trump-bessent-signal-deescalation-of-us-china-trade-war-143427595.html"
            }
        ],
        "avgScore": 0.25196285714285704,
        "pctChange": 0.023776312268426206
    },
    "4 22 2025": {
        "importantArticles": [
            {
                "headline": "WASHINGTON (Reuters) -OpenAI would be interested in buying Google's Chrome if antitrust enforcers are successful in forcing the Alphabet unit to sell the popular web browser as part of a bid to restore competition in search, an OpenAI executive testified on Tuesday at Google's antitrust trial in Washington.  ChatGPT head of product Nick Turley made the statement while testifying at trial in Washington where U.S. Department of Justice seeks to require Google to undertake far-reaching measures restore competition in online search.  The judge overseeing the trial found last year that Google has a monopoly in online search and related advertising.",
                "publication_date": "2025-04-22T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9442",
                "source": "Reuters",
                "ticker": "GOOG",
                "title": "OpenAI would buy Google's Chrome, exec testifies at trial",
                "url": "https://finance.yahoo.com/news/google-contemplated-exclusive-gemini-ai-142944516.html"
            },
            {
                "headline": "Artificial intelligence (AI) technology is currently in its early phases of growth, but it is expected to gain rapid traction in the coming years thanks to its adoption across multiple industries, including cloud computing, automotive, and advertising.  Search engine giant Alphabet is down almost 20% in 2025 as of this writing.  The stock's decline can be attributed to the broader market sell-off as well as concerns that the company may have fallen behind in the AI race as compared to its rivals.",
                "publication_date": "2025-04-22T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8934",
                "source": "Motley Fool",
                "ticker": "GOOG",
                "title": "No-Brainer Buy Alert: 1 Artificial Intelligence (AI) Stock With Massive Long-Term Potential",
                "url": "https://finance.yahoo.com/news/no-brainer-buy-alert-1-211633145.html"
            },
            {
                "headline": "(Bloomberg) -- OpenAI’s goals of building a “super assistant” app and reaching general artificial intelligence won’t succeed without search technology but Google has declined to work with the startup, the head of its ChatGPT product testified Tuesday in the Google antitrust trial.Most Read from BloombergTrump Gives New York ‘One Last Chance’ to End Congestion FeeDOGE Visits National Gallery of Art to Discuss Museum’s Legal StatusThe Racial Wealth Gap Is Not Just About MoneyOpenAI’s Nick Turley s",
                "publication_date": "2025-04-22T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8625",
                "source": "Bloomberg",
                "ticker": "GOOG",
                "title": "ChatGPT Chief Calls Search Crucial for OpenAI in Google Trial",
                "url": "https://finance.yahoo.com/news/chatgpt-chief-calls-search-crucial-180344015.html"
            },
            {
                "headline": "U.S. stocks looked set to open higher Tuesday, clawing back some ground after a brutal Monday selloff. Nasdaq futures rose 0.8%, with the S&P 500 and Dow also in the green.",
                "publication_date": "2025-04-22T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.6249",
                "source": "Quartz",
                "ticker": "GOOG",
                "title": "Google, Tesla, Verizon, Lockheed Martin: Stocks to watch today",
                "url": "https://finance.yahoo.com/news/google-tesla-verizon-lockheed-martin-125025613.html"
            },
            {
                "headline": "Amazon stock has been hit by fears about tariffs and e-commerce but analysts are warning about cloud risks as well.",
                "publication_date": "2025-04-22T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5647",
                "source": "Investor's Business Daily",
                "ticker": "GOOG",
                "title": "Cloud Infrastructure Growth Could Cool This Year Despite AI Excitement, Analyst Says",
                "url": "https://finance.yahoo.com/m/94e65c5a-4318-347d-b84d-8731823848ae/cloud-infrastructure-growth.html"
            },
            {
                "headline": "Anthony Chavez, vice president of the Google-backed Privacy Sandbox initiative, said in July that Google would introduce a new experience in Chrome to let people make an informed choice that applies across their web browsing.  The announcement comes as Alphabet faces legal pressure, after a U.S. judge recently ruled that Google maintains illegal monopolies in online advertising technology — a decision that could potentially lead to a court-ordered breakup of its ad tech business.  Last year, the tech giant scrapped longstanding plans to remove third-party cookies, the tiny packets of code that track users' activity across the internet, from Chrome after advertisers raised concerns that a removal would limit their ability to collect information for personalizing ads, leaving them dependent on Google's own user databases.",
                "publication_date": "2025-04-22T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.4588",
                "source": "Reuters",
                "ticker": "GOOG",
                "title": "Google opts out of standalone prompt for third-party cookies",
                "url": "https://finance.yahoo.com/news/google-opts-standalone-prompt-third-171850860.html"
            }
        ],
        "avgScore": 0.23040303030303022,
        "pctChange": 0.024821361115765533
    },
    "4 21 2025": {
        "importantArticles": [
            {
                "headline": "WASHINGTON (Reuters) -Alphabet's Google needs strong measures imposed on it to prevent it from using its artificial intelligence products to extend its dominance in online search, a U.S. Department of Justice attorney said as a trial in the historic antitrust case began on Monday.  The outcome of the case could fundamentally reshape the internet by unseating Google as the go-to portal for information online.  The Justice Department is seeking an order that would require Google to sell its Chrome browser and take other measures to end what a judge found was its monopoly in online search.",
                "publication_date": "2025-04-21T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9382",
                "source": "Reuters",
                "ticker": "GOOG",
                "title": "Google could use AI to extend search monopoly, DOJ says as trial begins",
                "url": "https://finance.yahoo.com/news/google-faces-trial-us-bid-101354412.html"
            },
            {
                "headline": "When it comes to designing semiconductor chips used to power artificial intelligence (AI) workloads, two companies stand head and shoulders above the rest: Nvidia (NASDAQ: NVDA) and Broadcom (NASDAQ: AVGO).  Nvidia has been the biggest early winner in AI chips, but Broadcom has been gaining momentum.  Nvidia and Broadcom are taking two very different approaches to the AI chip market.",
                "publication_date": "2025-04-21T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7992",
                "source": "Motley Fool",
                "ticker": "GOOG",
                "title": "Better AI Chip Stock: Nvidia vs. Broadcom",
                "url": "https://finance.yahoo.com/news/better-ai-chip-stock-nvidia-220000502.html"
            },
            {
                "headline": "Daniela Rus -- author of The Heart and The Chip and The Mind's Mirror -- talks through the nature of developing truly autonomous robots, and how most cutting-edge robotics work gets funded.  To catch full episodes of all The Motley Fool's free podcasts, check out our podcast center.",
                "publication_date": "2025-04-21T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7351",
                "source": "Motley Fool",
                "ticker": "GOOG",
                "title": "Management Weighs in on the Macro",
                "url": "https://finance.yahoo.com/news/management-weighs-macro-172800534.html"
            },
            {
                "headline": "Google is confronting an existential threat as the U.S. government tries to break up the company as punishment for turning its revolutionary search engine into an illegal monopoly.  In its opening arguments, federal antitrust enforcers also urged the court to impose forward-looking remedies to prevent Google from using artificial intelligence to further its dominance.  “This is a moment in time, we’re at an inflection point, will we abandon the search market and surrender them to control of the monopolists or will we let competition prevail and give choice to future generations,” said Justice Department attorney David Dahlquist.",
                "publication_date": "2025-04-21T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.8807",
                "source": "Associated Press Finance",
                "ticker": "GOOG",
                "title": "Google faces off with US government in attempt to break up company in search monopoly case",
                "url": "https://finance.yahoo.com/news/google-face-off-us-government-002008266.html"
            },
            {
                "headline": "The court's documents say that in a video published on YouTube, information on the losses in Ukraine of Russian servicemen, as well as their personal data, were disclosed, TASS reported.  Russia has for several years ordered foreign technology platforms to remove content it deems illegal, such as what it calls \"fakes\" about the war in Ukraine, issuing small but persistent fines when it sees failures to comply.",
                "publication_date": "2025-04-21T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.8422",
                "source": "Reuters",
                "ticker": "GOOG",
                "title": "Moscow court finds Google guilty of disclosing Russian war casualties, TASS says",
                "url": "https://finance.yahoo.com/news/moscow-court-finds-google-guilty-033727206.html"
            },
            {
                "headline": "Alphabet (GOOG, GOOGL) fights a breakup of its businesses, as Monday marked the first day of the remedies phase of the antitrust trial. Yahoo Finance Senior Legal Reporter Alexis Keenan breaks down the arguments from the Google parent company and US antitrust regulators. To watch more expert insights and analysis on the latest market action, check out more Market Domination Overtime here.",
                "publication_date": "2025-04-21T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.6573",
                "source": "Yahoo Finance Video",
                "ticker": "GOOG",
                "title": "Google's antitrust breakup trial: What to know",
                "url": "https://finance.yahoo.com/video/googles-antitrust-breakup-trial-know-210843962.html"
            }
        ],
        "avgScore": -0.013614285714285709,
        "pctChange": 0.026958449684229818
    },
    "4 17 2025": {
        "importantArticles": [
            {
                "headline": "Nvidia fell 3% following a $5.5 billion charge tied to U.S. export controls; AMD shares also declined.",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.296",
                "source": "GuruFocus.com",
                "ticker": "GOOG",
                "title": "S&P 500 Rises, Dow Falls 500 Points as UnitedHealth Tumbles on Earnings Miss",
                "url": "https://finance.yahoo.com/news/p-500-rises-dow-falls-214619879.html"
            },
            {
                "headline": "We recently published a list of 10 AI Stocks You Shouldn’t Overlook Right Now. In this article, we are going to take a look at where Alphabet Inc. (NASDAQ:GOOGL) stands against other AI stocks you shouldn’t overlook right now. According to Adam Thierer, a senior fellow at the center-right think tank R Street Institute, Trump’s […]",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Insider Monkey",
                "ticker": "GOOG",
                "title": "Alphabet (GOOGL) Eyes Grid Optimization with AI Through PJM Partnership",
                "url": "https://finance.yahoo.com/news/alphabet-googl-eyes-grid-optimization-222318074.html"
            },
            {
                "headline": "Several big companies will be reporting earnings results next week. Tesla (TSLA) will be reporting first quarter numbers on Tuesday, April 22, Boeing (BA) will be reporting its first quarter results on Wednesday, April 23, and Alphabet (GOOG, GOOGL) will be posting first quarter earnings results on Thursday, April 24. Asking for a Trend host Josh Lipton breaks down the earnings results to watch next week. To watch more expert insights and analysis on the latest market action, check out more Asking for a Trend here.",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Yahoo Finance Video",
                "ticker": "GOOG",
                "title": "Tesla, Alphabet, Boeing earnings: What to Watch",
                "url": "https://finance.yahoo.com/video/tesla-alphabet-boeing-earnings-watch-220932835.html"
            },
            {
                "headline": "A federal judge ruled that Google (GOOGL, GOOG) holds an illegal monopoly in parts of the online ad tech market, marking the company’s second major antitrust loss in just over a year. Rebecca Haw Allensworth, associate dean for research and professor at Vanderbilt Law School, joins Market Domination to explain what the decision could mean for Google. To watch more expert insights and analysis on the latest market action, check out more Market Domination&nbsp;here.",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.7269",
                "source": "Yahoo Finance Video",
                "ticker": "GOOG",
                "title": "Google monopoly ruling a 'really big win for the government'",
                "url": "https://finance.yahoo.com/video/google-monopoly-ruling-really-big-203331137.html"
            },
            {
                "headline": "A number of stocks jumped in the morning session after a Federal judge ruled that advertising giant Google (owned by Alphabet) monopolized online advertising technology. The affected technologies were the publisher ad servers and exchanges. These platforms are central to how digital ads are bought, sold, and placed across the internet, and they have been major revenue drivers for Alphabet. The decision raised the possibility that Alphabet could be forced to divest these assets, potentially weake",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5423",
                "source": "StockStory",
                "ticker": "GOOG",
                "title": "The Trade Desk and PubMatic Shares Are Soaring, What You Need To Know",
                "url": "https://finance.yahoo.com/news/trade-desk-pubmatic-shares-soaring-204730617.html"
            },
            {
                "headline": "Shares of online advertising giant Alphabet (NASDAQ:GOOGL) fell 3% in the morning session after a federal judge ruled that the company monopolized online advertising technology. The affected technologies were the publisher ad servers and exchanges. These platforms are central to how digital ads are bought, sold, and placed across the internet, and they have been major revenue drivers for Alphabet. The decision raised the possibility that the company could be forced to divest these assets, potent",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.3818",
                "source": "StockStory",
                "ticker": "GOOG",
                "title": "Why Alphabet (GOOGL) Shares Are Falling Today",
                "url": "https://finance.yahoo.com/news/why-alphabet-googl-shares-falling-185301035.html"
            }
        ],
        "avgScore": -0.16486666666666666,
        "pctChange": -0.022822117801711558
    },
    "4 2 2025": {
        "importantArticles": [
            {
                "headline": "Google-parent Alphabet is facing risk on multiple fronts. Its search engine is under attack from AI, while courts are calling the business a monopoly.",
                "publication_date": "2025-04-02T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.6369",
                "source": "Barrons.com",
                "ticker": "GOOG",
                "title": "Google Earnings Beat on Strong Margins. The Stock Is Rising.",
                "url": "https://finance.yahoo.com/m/95bf3b14-46f5-3293-89f3-97f83dcc3357/google-earnings-beat-on.html"
            },
            {
                "headline": "Google-parent Alphabet is facing risk on multiple fronts. Its search engine is under attack from AI, while courts are calling the business a monopoly.",
                "publication_date": "2025-04-02T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.6369",
                "source": "Barrons.com",
                "ticker": "GOOG",
                "title": "Google Earnings Beat on Strong Margins. The Stock Is Rising.",
                "url": "https://finance.yahoo.com/m/95bf3b14-46f5-3293-89f3-97f83dcc3357/google-earnings-beat-on.html"
            }
        ],
        "avgScore": -0.6369,
        "pctChange": -0.03921689351380442
    },
    "coef": 0.4285714285714286,
    "avgCoef": 0.016635469264154122,
    "similar": {
        "LUV": 1.0,
        "RKLB": 1.0,
        "NIO": 0.942857142857143,
        "HOOD": 0.942857142857143
    }
}