{
    "4 24 2025": {
        "importantArticles": [
            {
                "headline": "Computer processor maker Intel (NASDAQ:INTC) reported Q1 CY2025 results beating Wall Street’s revenue expectations, but sales were flat year on year at $12.67 billion. On the other hand, next quarter’s revenue guidance of $11.8 billion was less impressive, coming in 8.4% below analysts’ estimates. Its non-GAAP profit of $0.13 per share was significantly above analysts’ consensus estimates.",
                "publication_date": "2025-04-24T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.932",
                "source": "StockStory",
                "ticker": "INTC",
                "title": "Intel (NASDAQ:INTC) Q1 Sales Beat Estimates But Stock Drops",
                "url": "https://finance.yahoo.com/news/intel-nasdaq-intc-q1-sales-204424459.html"
            },
            {
                "headline": "We recently published a list of 20 Takeover Rumors Hedge Funds Are Buying. In this article, we are going to take a look at where Intel Corporation (NASDAQ:INTC) stands against other takeover rumor stocks hedge funds are buying. Hedge funds tend to pile up on a stock that gains or is expected to gain positive […]",
                "publication_date": "2025-04-24T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8555",
                "source": "Insider Monkey",
                "ticker": "INTC",
                "title": "Intel Corporation (INTC): Among Takeover Rumors Hedge Funds Are Buying",
                "url": "https://finance.yahoo.com/news/intel-corporation-intc-among-takeover-105519481.html"
            },
            {
                "headline": "The most powerful generative AI models from the likes of OpenAI, Alphabet, and Anthropic require costly and power-hungry AI accelerators stuffed into data centers to produce results.  AI models from Chinese start-up DeepSeek released earlier this year turned some assumptions about the AI infrastructure market on their heads.  The assumption that AI models would require ever-increasing quantities of computational horsepower, the foundation of the bull case for Nvidia stock, started to look a lot less like a sure thing.",
                "publication_date": "2025-04-24T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8281",
                "source": "Motley Fool",
                "ticker": "INTC",
                "title": "Microsoft Just Showed the Future of AI, and It's Great News for Intel and AMD",
                "url": "https://finance.yahoo.com/news/microsoft-just-showed-future-ai-101000210.html"
            },
            {
                "headline": "Intel reported better-than-anticipated Q1 earnings, but its Q2 outlook was worse than expected.",
                "publication_date": "2025-04-24T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.631",
                "source": "Yahoo Finance",
                "ticker": "INTC",
                "title": "Intel beats on Q1 expectations, but poor Q2 forecast sends stock sliding",
                "url": "https://finance.yahoo.com/news/intel-beats-on-q1-expectations-but-poor-q2-forecast-sends-stock-sliding-192248720.html"
            },
            {
                "headline": "(Bloomberg) -- Wall Street investors weighing the impacts of Donald Trump’s trade war on Corporate America sent stocks climbing amid bets the Federal Reserve could cut rates sooner than anticipated to prevent a recession.Most Read from BloombergTrump Gives New York ‘One Last Chance’ to End Congestion FeeWhy Car YouTuber Matt Farah Is Fighting for Walkable CitiesBackyard Micro-Flats Aim to Ease South Africa’s Housing CrisisThe Racial Wealth Gap Is Not Just About MoneyTo Fuel Affordable Housing, T",
                "publication_date": "2025-04-24T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.4019",
                "source": "Bloomberg",
                "ticker": "INTC",
                "title": "Stock Rally Powers On as Alphabet Up in Late Hours: Markets Wrap",
                "url": "https://finance.yahoo.com/news/stock-rally-loses-steam-wavering-024243837.html"
            },
            {
                "headline": "Investing.com -- Intel Corporation (NASDAQ:INTC) issued a cautious Q2 forecast on Thursday, citing a “fluid” macro environment and growing trade policy uncertainty, while outlining aggressive cost-cutting and management restructuring plans. The company expects revenue for the second quarter to fall between $11.2 billion and $12.4 billion, a year-over-year decline of up to 12%, as it braces for potential economic fallout from tariffs and inflation.",
                "publication_date": "2025-04-24T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.4019",
                "source": "Investing.com",
                "ticker": "INTC",
                "title": "Intel warns of ’choppy’ outlook amid tariff worries and restructuring push",
                "url": "https://finance.yahoo.com/news/intel-warns-choppy-outlook-amid-225925919.html"
            }
        ],
        "avgScore": 0.14483636363636368,
        "pctChange": 0.021145150544593577
    },
    "4 23 2025": {
        "importantArticles": [
            {
                "headline": "Pat Gelsinger, the former CEO of Intel Corp. (NASDAQ:INTC), expressed admiration for Nvidia Corp. (NASDAQ:NVDA) and its superior performance in the artificial intelligence chip market. What Happened: Gelsinger praised Nvidia’s ability in an interview ...",
                "publication_date": "2025-04-23T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9393",
                "source": "Benzinga",
                "ticker": "INTC",
                "title": "Nvidia CEO Jensen Huang Earns Praise From Former Intel CEO Pat Gelsinger: 'Run Hard To Stay In The Front'",
                "url": "https://finance.yahoo.com/news/nvidia-ceo-jensen-huang-earns-180107979.html"
            },
            {
                "headline": "Despite the fanfare, the artificial intelligence (AI) revolution has just begun.  Companies like Nvidia have already taken advantage of this growth, soaring to multitrillion-dollar market caps.  Over time, however, we could see one of these stocks surpass Nvidia's market cap, leading to huge gains for patient shareholders.",
                "publication_date": "2025-04-23T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9169",
                "source": "Motley Fool",
                "ticker": "INTC",
                "title": "Prediction: 2 Artificial Intelligence (AI) Stocks That Could Be Worth More Than Nvidia by 2030",
                "url": "https://finance.yahoo.com/news/prediction-2-artificial-intelligence-ai-223000088.html"
            },
            {
                "headline": "After sell-offs yesterday, Intel (NASDAQ: INTC) stock rallied in Tuesday's trading.  The semiconductor company's share price gained 2.8% amid a 2.5% gain for the S&P 500 and a 2.7% gain for the Nasdaq Composite.  Bloomberg reported today that U.S. Treasury Secretary Scott Bessent said at an investor conference this morning that the U.S.-China trade war could see significant de-escalation in the near term.",
                "publication_date": "2025-04-23T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8519",
                "source": "Motley Fool",
                "ticker": "INTC",
                "title": "Why Intel Stock Surged Today",
                "url": "https://finance.yahoo.com/news/why-intel-stock-surged-today-014044317.html"
            },
            {
                "headline": "Big Tech is preparing for its first earnings since Trump launched his global trade war.",
                "publication_date": "2025-04-23T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5267",
                "source": "Yahoo Finance",
                "ticker": "INTC",
                "title": "Big Tech earnings kick off as tariff uncertainty continues to roil markets",
                "url": "https://finance.yahoo.com/news/big-tech-earnings-kick-off-as-tariff-uncertainty-continues-to-roil-markets-160016313.html"
            },
            {
                "headline": "Intel shares rose Wednesday, following a report the struggling chipmaker is planning to cut more than 20% of its staff.",
                "publication_date": "2025-04-23T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.4019",
                "source": "Investopedia",
                "ticker": "INTC",
                "title": "Intel Stock Jumps as Chipmaker Reportedly Plans To Cut Over 20% of Staff",
                "url": "https://finance.yahoo.com/news/intel-stock-jumps-chipmaker-reportedly-135054553.html"
            },
            {
                "headline": "Morning Brief hosts Brad Smith and Madison Mills take a look at some of the top trending stories Wednesday morning. Apple (AAPL) and Meta (META) are in focus as the EU hits both companies with a combined $798 million in fines for antitrust violations under new digital market rules. Intel (INTC) is reportedly planning to lay off over 20% of its staff, according to Bloomberg. SAP (SAP.DE) stock surges after the company beat earnings expectations and maintained its full-year guidance. To watch more expert insights and analysis on the latest market action, check out more Morning Brief&nbsp;here.",
                "publication_date": "2025-04-23T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.3818",
                "source": "Yahoo Finance Video",
                "ticker": "INTC",
                "title": "Apple & Meta fined, Intel layoff reports, SAP: Trending Tickers",
                "url": "https://finance.yahoo.com/video/apple-meta-fined-intel-layoff-135420929.html"
            }
        ],
        "avgScore": 0.1006833333333333,
        "pctChange": 0.04371052024577841
    },
    "4 22 2025": {
        "importantArticles": [
            {
                "headline": "We recently published a list of 13 Best Edge Computing Stocks to Buy According to Hedge Funds. In this article, we are going to take a look at where Intel Corporation (NASDAQ:INTC) stands against other best edge computing stocks to buy according to hedge funds. Tech companies have been on a tear in recent years, […]",
                "publication_date": "2025-04-22T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8555",
                "source": "Insider Monkey",
                "ticker": "INTC",
                "title": "Is Intel Corporation (INTC) the Best Edge Computing Stock to Buy According to Hedge Funds?",
                "url": "https://finance.yahoo.com/news/intel-corporation-intc-best-edge-015633680.html"
            },
            {
                "headline": "Bernstein SocGen, a wealth-management firm, lowered its price target on Intel (INTC) to $21 from $25 while keeping a Market Perform rating on the shares. A Tale of Two Halves Intel will benefit from increased purchases of computerized products in the first half of 2025 as consumers and businesses look to stockpile such offerings ahead […]",
                "publication_date": "2025-04-22T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7003",
                "source": "Insider Monkey",
                "ticker": "INTC",
                "title": "Intel (INTC) Price Target Cut to $21 by Wealth Manager",
                "url": "https://finance.yahoo.com/news/intel-intc-price-target-cut-181109278.html"
            },
            {
                "headline": "Why investors should use the Zacks Earnings ESP tool to help find stocks that are poised to top quarterly earnings estimates.",
                "publication_date": "2025-04-22T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.6705",
                "source": "Zacks",
                "ticker": "INTC",
                "title": "These 2 Computer and Technology Stocks Could Beat Earnings: Why They Should Be on Your Radar",
                "url": "https://finance.yahoo.com/news/2-computer-technology-stocks-could-130011762.html"
            },
            {
                "headline": "Intel Rides Tariff Wave, But Underlying Demand Still Weak",
                "publication_date": "2025-04-22T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.6808",
                "source": "GuruFocus.com",
                "ticker": "INTC",
                "title": "Intel May Report Temporary Q1 Lift from Pre-Tariff Chip Rush, But Long-Term Woes Linger",
                "url": "https://finance.yahoo.com/news/intel-may-report-temporary-q1-124141199.html"
            },
            {
                "headline": "Despite solid traction in the AI PC market, fierce competition and Sino-U.S. trade spat are major headwinds for Intel.",
                "publication_date": "2025-04-22T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.1139",
                "source": "Zacks",
                "ticker": "INTC",
                "title": "INTC Stock Before Q1 Earnings: A Smart Buy or Risky Investment?",
                "url": "https://finance.yahoo.com/news/intc-stock-q1-earnings-smart-151800389.html"
            },
            {
                "headline": "The Mag 7 stocks start reporting earnings this week. Will Tesla and Alphabet be market movers?",
                "publication_date": "2025-04-22T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Zacks",
                "ticker": "INTC",
                "title": "Tesla, Alphabet and 3 Other Tech Earnings Charts to Watch This Week",
                "url": "https://finance.yahoo.com/news/tesla-alphabet-3-other-tech-145500690.html"
            }
        ],
        "avgScore": 0.23988888888888893,
        "pctChange": 0.055356223015685324
    },
    "4 21 2025": {
        "importantArticles": [
            {
                "headline": "The semiconductor sector is growing rapidly thanks to the rise of artificial intelligence (AI), making it a great area to invest in.  The industry saw 19% year-over-year revenue growth to $627 billion in 2024, and is forecast to hit $981 billion by 2029.  Two giants of the industry to consider investing in are Intel (NASDAQ: INTC) and Nvidia (NASDAQ: NVDA).",
                "publication_date": "2025-04-21T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9246",
                "source": "Motley Fool",
                "ticker": "INTC",
                "title": "Better Semiconductor Stock: Intel vs. Nvidia",
                "url": "https://finance.yahoo.com/news/better-semiconductor-stock-intel-vs-160000906.html"
            },
            {
                "headline": "You can catch Opening Bid on Apple Podcasts, Spotify, YouTube, or wherever you get your podcasts. There isn’t much Pat Gelsinger hasn’t done in the tech industry. He created cutting-edge technology decades ago at Intel (INTC). Then went off to VMware to reinvent the tech player. He then returned to Intel several years ago to revive the chip giant. But Gelsinger’s tenure at Intel was rocky as the company fell behind rivals like Nvidia (NVDA) and AMD (AMD) with AI chips. The company also made a big decision to start making its own chips, which came at a material cost to the bottom line. With results and the stock price under pressure, Gelsinger and Intel parted ways in December 2024. Yahoo Finance Executive Editor Brian Sozzi talks with Gelsinger now that he has had some time to reflect on his Intel tenure. Gelsinger has emerged as an investor in startups, taking his experience at Intel and seeking to help the next generation of tech leaders. For full episodes of Opening Bid, listen on your favorite podcast platform or watch on our website. Yahoo Finance's Opening Bid is produced by Langston Sessoms",
                "publication_date": "2025-04-21T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8807",
                "source": "Yahoo Finance Video",
                "ticker": "INTC",
                "title": "What Trump tariffs really mean to semiconductors: Former Intel CEO",
                "url": "https://finance.yahoo.com/video/trump-tariffs-really-mean-semiconductors-120019266.html"
            },
            {
                "headline": "It won't be so easy to build US manufacturing if you are Apple, warns Intel's former CEO.",
                "publication_date": "2025-04-21T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.5173",
                "source": "Yahoo Finance",
                "ticker": "INTC",
                "title": "Apple may have a key problem bringing back manufacturing to beat Trump tariffs, former Intel CEO warns",
                "url": "https://finance.yahoo.com/news/apple-may-have-a-key-problem-bringing-back-manufacturing-to-beat-trump-tariffs-former-intel-ceo-warns-132151346.html"
            },
            {
                "headline": "New Intel CEO tackles AI and foundry struggles amid deep losses and market challenges",
                "publication_date": "2025-04-21T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5994",
                "source": "GuruFocus.com",
                "ticker": "INTC",
                "title": "Intel Faces Major Setbacks as CEO Plans Bold Overhaul in AI and Foundry Sectors",
                "url": "https://finance.yahoo.com/news/intel-faces-major-setbacks-ceo-154900033.html"
            },
            {
                "headline": "Closing the gap with the AI chip leader won't be easy.",
                "publication_date": "2025-04-21T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.3412",
                "source": "Yahoo Finance",
                "ticker": "INTC",
                "title": "Former Intel CEO on Nvidia: You have to be 10x better to dethrone the king",
                "url": "https://finance.yahoo.com/news/former-intel-ceo-on-nvidia-you-have-to-be-10x-better-to-dethrone-the-king-171633066.html"
            },
            {
                "headline": "This week will mark the first quarterly financial report for Intel under the leadership of new CEO Lip-Bu Tan.",
                "publication_date": "2025-04-21T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Investopedia",
                "ticker": "INTC",
                "title": "Intel's New CEO Will Make His Earnings Debut This Week",
                "url": "https://finance.yahoo.com/news/intels-ceo-earnings-debut-week-100000655.html"
            }
        ],
        "avgScore": 0.23033333333333336,
        "pctChange": 0.03556263645793618
    },
    "4 17 2025": {
        "importantArticles": [
            {
                "headline": "Buying and holding solid stocks for a long time is a tried-and-tested way of making money in the stock market, as this strategy helps investors capitalize on secular growth opportunities and disruptive trends while also allowing them to benefit from the power of compounding.  This explains why an investment of $1,000 in shares of Advanced Micro Devices (NASDAQ: AMD) a decade ago would now be worth more than $33,500.  AMD has significantly outperformed the Nasdaq Composite index's returns of 235% in the past decade, driven by its market share improvements in central processing units (CPUs), which are deployed in servers and personal computers (PCs).",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9493",
                "source": "Motley Fool",
                "ticker": "INTC",
                "title": "Is AMD Stock Your Ticket to Becoming a Millionaire?",
                "url": "https://finance.yahoo.com/news/amd-stock-ticket-becoming-millionaire-151500201.html"
            },
            {
                "headline": "SAN FRANCISCO (Reuters) -Intel's new CEO, Lip-Bu Tan, is flattening the semiconductor giant's leadership team, with important chip groups reporting directly to him, according to a memo from Tan seen by Reuters.  Intel has also promoted networking chip chief Sachin Katti to be chief technology officer and artificial intelligence chief, according to the memo.  The leadership changes are the first major move under Tan, who took the top job last month, to turn around the venerable Silicon Valley chipmaker after years of problems.",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7003",
                "source": "Reuters",
                "ticker": "INTC",
                "title": "Exclusive-Intel CEO Lip-Bu Tan flattens leadership structure, names new AI chief, memo says",
                "url": "https://finance.yahoo.com/news/exclusive-intel-ceo-lip-bu-233237497.html"
            },
            {
                "headline": "Nike (NYSE: NKE), Intel (NASDAQ: INTC), and Kraft Heinz (NASDAQ: KHC) all seem like they could be good, cheap buys to load up on right now, given their beaten-down prices.  Nike's stock hasn't been this cheap since 2017.  President Trump has paused \"reciprocal tariffs\" on countries (except China) for a period of 90 days, but this is becoming an evolving development, which has led to investors not wanting any part of Nike's stock.",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.4019",
                "source": "Motley Fool",
                "ticker": "INTC",
                "title": "3 Crashing Stocks That Haven't Been This Cheap in Over 5 Years",
                "url": "https://finance.yahoo.com/news/3-crashing-stocks-havent-cheap-082300672.html"
            },
            {
                "headline": "Nvidia stock continued its slide on Thursday, bringing market cap losses since it disclosed new export controls to nearly $270 billion.",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.4019",
                "source": "Yahoo Finance",
                "ticker": "INTC",
                "title": "Nvidia stock falls again, market cap losses near $270 billion after Trump administration's new export controls",
                "url": "https://finance.yahoo.com/news/nvidia-stock-falls-again-market-cap-losses-near-270-billion-after-trump-administrations-new-export-controls-160422973.html"
            },
            {
                "headline": "Big Tech’s risks in China go far beyond Nvidia, Foreign central banks load up on T-bills and sell U.S. Bonds, more news to start your day.",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.2732",
                "source": "Barrons.com",
                "ticker": "INTC",
                "title": "Stock Markets Need a Tariffs Savior. Why Fed’s Powell Won’t Ride to the Rescue and 5 Other Things to Know Today.",
                "url": "https://finance.yahoo.com/m/f0b27173-b913-381c-af02-98f7c48ace42/stock-markets-need-a-tariffs.html"
            },
            {
                "headline": "TSMC Denial, Export Curbs Hammer Intel Stock",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "GuruFocus.com",
                "ticker": "INTC",
                "title": "Intel Shares Tumble After TSMC Dismisses Joint Venture Rumors",
                "url": "https://finance.yahoo.com/news/intel-shares-tumble-tsmc-dismisses-180824556.html"
            }
        ],
        "avgScore": 0.21680000000000002,
        "pctChange": -0.004754366145640424
    },
    "4 16 2025": {
        "importantArticles": [
            {
                "headline": "In recent years, certain GPU makers like Nvidia have seen their share prices soar.  Intel's management team says it has a plan to reinvigorate growth.  A stock split typically occurs when a company's share price is so high that either investors errantly assume it's \"expensive\" or limit their holdings because they can't afford to buy another whole share.",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9337",
                "source": "Motley Fool",
                "ticker": "INTC",
                "title": "Reverse Stock-Split Watch: Is Intel Next?",
                "url": "https://finance.yahoo.com/news/reverse-stock-split-watch-intel-130600394.html"
            },
            {
                "headline": "Hello, Reader. Nvidia Corp. (NVDA) has established itself as the undisputed AI darling of today’s stock market, without a doubt generating life-changing amounts of wealth for many investors. But its soaring popularity and front-page dominance can sometimes lead investors to throw on their rose-colored glasses and see only what they want to see.InvestorPlace - Stock Market News, Stock Advice & Trading Tips Just look at the latest headline Nvidia made… On Monday, the tech giant announced that it p",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8969",
                "source": "InvestorPlace",
                "ticker": "INTC",
                "title": "Nvidia Moves to Manufacture in the U.S. – This Overlooked Company Is Already Doing It",
                "url": "https://finance.yahoo.com/news/nvidia-moves-manufacture-u-overlooked-202536729.html"
            },
            {
                "headline": "President Trump’s tariffs have overshadowed Applied Materials (AMAT) stock, stirring up short-term headaches for the semiconductor equipment titan. Despite a recent rebound, shares trade ~30% below their 52-week highs, with the decline somewhat justified. Indeed, higher costs and global trade tensions could dent the company’s near-term prospects. Still, the effort to restore chip manufacturing to U.S. soil promises a lucrative payoff in the long run. Given this narrative and AMAT’s unmatched rol",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.5452",
                "source": "TipRanks",
                "ticker": "INTC",
                "title": "How the U.S.-China Trade War Benefits Applied Materials Stock (AMAT)",
                "url": "https://finance.yahoo.com/news/u-china-trade-war-benefits-120800147.html"
            },
            {
                "headline": "We recently published a list of Jim Cramer Sounds the Alarm on China Rhetoric and Dollar Panic Then Analyzes 11 Key Stocks. In this article, we are going to take a look at where Intel Corporation (NASDAQ:INTC) stands against other key stocks that Jim Cramer analyzes. In his latest appearance on CNBC’s Squawk on the Street, […]",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.6908",
                "source": "Insider Monkey",
                "ticker": "INTC",
                "title": "Jim Cramer: Intel (INTC) Needs to “Fix the Balance Sheet”—Altera Was “Driven to the Ground”",
                "url": "https://finance.yahoo.com/news/jim-cramer-intel-intc-needs-133256863.html"
            },
            {
                "headline": "The news comes a day after Nvidia warned of a $5.5 billion hit as Washington restricted exports of its AI processor tailored for China.  Intel, under new CEO Lip-Bu Tan, told clients last week that its chips would require a license for exporting to China if they have a total DRam bandwidth of 1,400 gigabytes (GB) per second or more, input-output (I/O) bandwidth of 1,100 GB per second or more, or a total of both of 1,700 GB per second or more, according to the report.  Intel's Gaudi series as well as Nvidia's H20 far exceed these requirements, the report said.",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.3818",
                "source": "Reuters",
                "ticker": "INTC",
                "title": "Intel will need license to export AI chips to Chinese clients, FT reports",
                "url": "https://finance.yahoo.com/news/intel-license-export-ai-chips-203005609.html"
            },
            {
                "headline": "We recently published a list of 10 AI Stocks on the Move. In this article, we are going to take a look at where Intel Corporation (NASDAQ:INTC) stands against other AI stocks on the move. Market uncertainty aside, the AI race is tighter than ever. A report by Stanford University’s Institute for Human-Centered AI (HAI) […]",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.34",
                "source": "Insider Monkey",
                "ticker": "INTC",
                "title": "Intel Corporation (INTC): Sells 51% of Altera for $4.46B to Refocus on AI Strategy",
                "url": "https://finance.yahoo.com/news/intel-corporation-intc-sells-51-034023793.html"
            }
        ],
        "avgScore": 0.1391153846153846,
        "pctChange": -0.015600584721889122
    },
    "4 15 2025": {
        "importantArticles": [
            {
                "headline": "INTC enters into a definitive agreement to sell a majority stake of its Altera business to Silver Lake for an enterprise value of $8.75 billion.",
                "publication_date": "2025-04-15T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.6808",
                "source": "Zacks",
                "ticker": "INTC",
                "title": "Intel to Sell 51% Stake in Altera Business: Will it Benefit the Stock?",
                "url": "https://finance.yahoo.com/news/intel-sell-51-stake-altera-133200062.html"
            },
            {
                "headline": "JP Morgan analyst Harlan Sur reiterated an Underweight rating on Intel Corp (NASDAQ:INTC) on Tuesday, setting a price forecast of $23. On Monday, before the market opened, Intel announced a 51% stake sale of its programmable chip business, Altera, to private equity firm Silver Lake Management for $4.46 billion, valuing Altera at $8.75 billion with a transaction multiple of ~5.7 times calendar 2024 sales. As a reference, Intel bought Altera in 2015 at 9 times calendar 2014 sales and in 2020, and",
                "publication_date": "2025-04-15T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.6037",
                "source": "Benzinga",
                "ticker": "INTC",
                "title": "Intel Growth Challenges Are Not Over Despite Altera Stake Sale: Analyst",
                "url": "https://finance.yahoo.com/news/intel-growth-challenges-not-over-221609444.html"
            },
            {
                "headline": "This transaction values Altera at $8.75bn, with Intel retaining a 49% ownership stake in the unit.",
                "publication_date": "2025-04-15T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.4019",
                "source": "Verdict",
                "ticker": "INTC",
                "title": "Intel to sell majority stake in Altera to Silver Lake",
                "url": "https://finance.yahoo.com/news/intel-sell-majority-stake-altera-090625006.html"
            },
            {
                "headline": "The sale to private equity firm Silver Lake comes as the chipmaker looks to shore up its finances.",
                "publication_date": "2025-04-15T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Manufacturing Dive",
                "ticker": "INTC",
                "title": "Intel to sell majority stake in Altera for $4.46B",
                "url": "https://finance.yahoo.com/news/intel-sell-majority-stake-altera-094100352.html"
            },
            {
                "headline": "Despite a brief recovery, structural issues and high valuations weigh heavily on Intel's outlook",
                "publication_date": "2025-04-15T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "GuruFocus.com",
                "ticker": "INTC",
                "title": "Intel: Overblown Optimism Meets Stark Reality",
                "url": "https://finance.yahoo.com/news/intel-overblown-optimism-meets-stark-095756917.html"
            },
            {
                "headline": "Companies In The Article Are:PLTR, INTC, DELL,GS",
                "publication_date": "2025-04-15T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Zacks",
                "ticker": "INTC",
                "title": "Company News for Apr 15, 2025",
                "url": "https://finance.yahoo.com/news/company-news-apr-15-2025-135800533.html"
            }
        ],
        "avgScore": 0.22402000000000002,
        "pctChange": -0.031234298605463933
    },
    "4 14 2025": {
        "importantArticles": [
            {
                "headline": "On Monday, Intel Corp (NASDAQ:INTC) announced plans to sell 51% of its Altera business to Silver Lake at a valuation of $8.75 billion. Intel will own the remaining 49% of the Altera business, enabling it to participate in Altera’s future success while focusing on its core business. Intel also announced that Raghib Hussain will succeed Sandra Rivera as CEO of Altera, effective May 5. Also Read: Taiwan Semiconductor Clocks Massive Q1 Revenue Growth Despite US Tensions The transaction will likely c",
                "publication_date": "2025-04-14T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9307",
                "source": "Benzinga",
                "ticker": "INTC",
                "title": "Intel To Offload 51% Of Altera Business To PE Firm Silver Lake",
                "url": "https://finance.yahoo.com/news/intel-offload-51-altera-business-150600693.html"
            },
            {
                "headline": "VAST Data has been recognized on the Forbes AI 50 list for 2025, which highlights the most promising private AI companies globally. This listing underscores VAST’s significant role in AI infrastructure, evidenced by its platform being utilized by numerous organizations for AI training and inference operations. The company has been noted for its strong innovation and sustained growth in the competitive AI market. VAST Data’s distributed, internet-scale platform has become integral to...",
                "publication_date": "2025-04-14T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9184",
                "source": "Simply Wall St.",
                "ticker": "INTC",
                "title": "AI Chips Update - VAST Data Shines on Forbes AI 50 List 2025",
                "url": "https://finance.yahoo.com/news/ai-chips-vast-data-shines-113724303.html"
            },
            {
                "headline": "Intel announced Monday that it was selling the majority of its Altera chip business to technology investor Silver Lake in a deal valued at $8.75 billion.  Silver Lake will own 51% of Altera, which Intel acquired in 2015 for $16.7 billion in an effort to expand its business into chip markets focused on wireless, automobiles and other products.  At the time, it was the biggest deal in Intel Corp.'s history.",
                "publication_date": "2025-04-14T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7783",
                "source": "Associated Press Finance",
                "ticker": "INTC",
                "title": "Intel sells majority stake in Altera to Silver Lake investors in a deal valued at $8.75 billion",
                "url": "https://finance.yahoo.com/news/intel-sells-majority-stake-altera-140131721.html"
            },
            {
                "headline": "(Reuters) -Intel has agreed to sell a 51% stake in its Altera programmable chip business to buyout firm Silver Lake for $4.46 billion, in the first major move by new CEO Lip-Bu Tan to revive the struggling American chipmaker.  Monday's deal values Altera at just $8.75 billion compared to the nearly $17 billion Intel paid in 2015, but the sale will provide the company much-needed cash after hefty bets on contract manufacturing by former CEO Pat Gelsinger strained its finances.  Shedding assets, including Intel's stake in Altera, is at the center of Tan's strategy to streamline the chipmaker after predecessors failed to diversify beyond its mainstay PC and server chip business for years.",
                "publication_date": "2025-04-14T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.6956",
                "source": "Reuters",
                "ticker": "INTC",
                "title": "Intel to sell majority stake in Altera for $4.46 billion to fund revival effort",
                "url": "https://finance.yahoo.com/news/intel-sell-51-stake-altera-123710271.html"
            },
            {
                "headline": "Brad Smith and Madison Mills take a closer look at some of today's trending tickers. Pfizer (PFE) discontinued its obesity drug after the pill was tied to a potentially drug-induced liver injury. Nvidia (NVDA) says it will make it the first artificial intelligence (AI) supercomputer in the US, marking heavy investment in the US while President Trump imposes hefty tariffs on foreign imports. Intel (INTC) sells its controlling stake in Altera to Silver Lake. To watch more expert insights and analysis on the latest market action, check out more Morning Brief here.",
                "publication_date": "2025-04-14T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "-0.0258",
                "source": "Yahoo Finance Video",
                "ticker": "INTC",
                "title": "Pfizer, Nvidia, Intel: Stocks in 30",
                "url": "https://finance.yahoo.com/video/pfizer-nvidia-intel-stocks-30-143753704.html"
            },
            {
                "headline": "The latest investor updates on stocks that are trending on Monday.",
                "publication_date": "2025-04-14T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Yahoo Finance UK",
                "ticker": "INTC",
                "title": "Trending tickers: Apple, Alibaba, ASML, Barclays and Wood Group",
                "url": "https://finance.yahoo.com/news/apple-alibaba-asml-barclays-wood-group-trending-tickers-095841216.html"
            }
        ],
        "avgScore": 0.34230000000000005,
        "pctChange": -0.022648896926069532
    },
    "4 11 2025": {
        "importantArticles": [
            {
                "headline": "Brad Smith examines the trending stories on today's Market Minute. Gold (GC=F) climbs, reaching new highs. US chipmakers (SMH) like Intel (INTC) and Texas Instruments (TXN) fall as China hits the US with a 125% tariff based on manufacturing origin. Morgan Stanley (MS) earnings beat expectations, boosted by Elon Musk selling X, according to Bloomberg. Stay up to date on the latest market action, minute-by-minute, with Yahoo Finance's Market Minute.",
                "publication_date": "2025-04-11T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7003",
                "source": "Yahoo Finance Video",
                "ticker": "INTC",
                "title": "Gold, US chipmakers, Morgan Stanley & Elon Musk: Market Minute",
                "url": "https://finance.yahoo.com/video/gold-us-chipmakers-morgan-stanley-161704927.html"
            },
            {
                "headline": "AMD has introduced the 5th Gen AMD EPYC processors, which are now powering Google Cloud's new C4D and H4D virtual machines (VMs). These VMs offer significant enhancements in performance, scalability, and efficiency, specifically tailored for demanding cloud workloads including AI and high-performance computing (HPC). The C4D instances, fueled by AMD's \"Zen 5\" architecture, show up to 80% higher throughput per vCPU, catering to general-purpose and AI inferencing tasks, while the H4D instances...",
                "publication_date": "2025-04-11T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.34",
                "source": "Simply Wall St.",
                "ticker": "INTC",
                "title": "AI Chips Update - AMD Powers Google Cloud With 5th Gen EPYC Processors",
                "url": "https://finance.yahoo.com/news/ai-chips-amd-powers-google-113737152.html"
            },
            {
                "headline": "The chipmaking giant has a new CEO, but it still faces existential challenges.",
                "publication_date": "2025-04-11T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.1154",
                "source": "Motley Fool",
                "ticker": "INTC",
                "title": "Where Will Intel Stock Be in 3 Years?",
                "url": "https://finance.yahoo.com/news/where-intel-stock-3-years-081400654.html"
            },
            {
                "headline": "Julie Hyman and Josh Lipton take a closer look at some of today's trending tickers. Recursion Pharma (RXRX) stock surges after the Food and Drug Administration (FDA) announced plans to phase out some animal testing requirements. Intel (INTC) stock falls as tensions in the US-China trade war intensify. Five Below (FIVE) stock declines as China tariffs impact orders. To watch more expert insights and analysis on the latest market action, check out more Market Domination here.",
                "publication_date": "2025-04-11T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.7951",
                "source": "Yahoo Finance Video",
                "ticker": "INTC",
                "title": "Recursion Pharma rises, Intel & Five Below fall: Trending Tickers",
                "url": "https://finance.yahoo.com/video/recursion-pharma-rises-intel-five-194742139.html"
            },
            {
                "headline": "Though the stock market is still historically pricey, a few phenomenal bargains have cropped up.",
                "publication_date": "2025-04-11T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Motley Fool",
                "ticker": "INTC",
                "title": "6 Stocks With Clear Price Dislocations That I Purchased During Wall Street's Historic Volatility",
                "url": "https://finance.yahoo.com/news/6-stocks-clear-price-dislocations-070600692.html"
            },
            {
                "headline": "The latest investor updates on stocks that are trending on Friday.",
                "publication_date": "2025-04-11T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Yahoo Finance UK",
                "ticker": "INTC",
                "title": "Trending tickers: Nvidia, Tesla, Ford, Intel and BP",
                "url": "https://finance.yahoo.com/news/nvidia-tesla-ford-intel-bp-trending-tickers-090920052.html"
            }
        ],
        "avgScore": 0.032781818181818176,
        "pctChange": 0.028875364814248492
    },
    "4 10 2025": {
        "importantArticles": [
            {
                "headline": "Intel Corporation (NASDAQ: INTC), has presented UDT with its 2025 \"Partner of the Year for Education\" award, underscoring UDT's long-standing commitment and contributions to technological innovation in America's national education sector.",
                "publication_date": "2025-04-10T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8271",
                "source": "PR Newswire",
                "ticker": "INTC",
                "title": "Intel Corporation Names UDT 2025 Partner of the Year for Education",
                "url": "https://finance.yahoo.com/news/intel-corporation-names-udt-2025-160300426.html"
            },
            {
                "headline": "Intel (NasdaqGS:INTC) experienced an 8% increase in share price over the last quarter. This period witnessed several key developments, including the retirement of Dr. Lavizzo-Mourey from the Board of Directors and a key CEO appointment. Despite reporting significant financial losses for 2024, new product launches such as the Xeon 6 processors provided positive momentum. The share price performance came amidst a challenging market environment, with the Nasdaq declining 6% largely due to a tech...",
                "publication_date": "2025-04-10T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7655",
                "source": "Simply Wall St.",
                "ticker": "INTC",
                "title": "Intel (NasdaqGS:INTC) Announces Retirement Of Dr. Lavizzo-Mourey From Board Of Directors",
                "url": "https://finance.yahoo.com/news/intel-nasdaqgs-intc-announces-retirement-171629190.html"
            },
            {
                "headline": "Nvidia (NVDA) witnessed a jump in share price last session on above-average trading volume. The latest trend in earnings estimate revisions for the stock suggests that there could be more strength down the road.",
                "publication_date": "2025-04-10T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.6901",
                "source": "Zacks",
                "ticker": "INTC",
                "title": "Nvidia (NVDA) Moves 18.7% Higher: Will This Strength Last?",
                "url": "https://finance.yahoo.com/news/nvidia-nvda-moves-18-7-123000466.html"
            },
            {
                "headline": "Shares of Intel (NASDAQ: INTC) are falling on Thursday.  The drop comes as the S&P 500 and Nasdaq Composite both lost more than 5%.  Intel's stock is feeling pressure from the ongoing trade war with China as well as a Reuters report today that revealed its new CEO has extensive business ties in the country, raising concerns of a potential conflict of interest.",
                "publication_date": "2025-04-10T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.6808",
                "source": "Motley Fool",
                "ticker": "INTC",
                "title": "Why Intel Stock Is Plummeting Today",
                "url": "https://finance.yahoo.com/news/why-intel-stock-plummeting-today-164300535.html"
            },
            {
                "headline": "We recently published a list of 10 Stocks on Jim Cramer’s Radar Recently. In this article, we are going to take a look at where Intel Corporation (NASDAQ:INTC) stands against other stocks on Jim Cramer’s radar. On Tuesday, Jim Cramer, host of Mad Money, discussed the impact of tariff-induced market volatility and he also discussed […]",
                "publication_date": "2025-04-10T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.4939",
                "source": "Insider Monkey",
                "ticker": "INTC",
                "title": "“Fix the Balance Sheet First – Then We’ll Take a Hard Look” – Jim Cramer on Intel (INTC)",
                "url": "https://finance.yahoo.com/news/fix-balance-sheet-first-then-171655298.html"
            },
            {
                "headline": "Intel (INTC) chief executive officer Lip-Bu Tan has backed hundreds of Chinese tech ventures, includ",
                "publication_date": "2025-04-10T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0258",
                "source": "MT Newswires",
                "ticker": "INTC",
                "title": "Market Chatter: Intel CEO's Past China Investments Raise Security Concerns",
                "url": "https://finance.yahoo.com/news/market-chatter-intel-ceo-apos-111640466.html"
            }
        ],
        "avgScore": 0.33845833333333347,
        "pctChange": -0.0070422231166250675
    },
    "4 9 2025": {
        "importantArticles": [
            {
                "headline": "LPL Financial Holdings Inc. has appointed Vaughn Harvey as the executive vice president and chief data and artificial intelligence (AI) officer, marking a significant move in its AI strategy. With over 25 years of experience in AI-driven digital transformations, Harvey will spearhead LPL’s data and AI initiatives, enhancing digital transformation across the organization. This appointment comes as LPL Financial aims to advance its offerings in artificial intelligence through programs like AI...",
                "publication_date": "2025-04-09T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8591",
                "source": "Simply Wall St.",
                "ticker": "INTC",
                "title": "This Week In AI Chips - LPL Financial Enhances AI Strategy With Key Executive Appointment",
                "url": "https://finance.yahoo.com/news/week-ai-chips-lpl-financial-113802366.html"
            },
            {
                "headline": "Nvidia (NASDAQ: NVDA) held its GPU Technology Conference (GTC) 2025 last month in San Jose, California.  Great information was shared during all these events, particularly Huang's keynote.  It was chock-full of promising new product launches and partnerships, reinforcing my bullish view of Nvidia stock as a long-term investment.",
                "publication_date": "2025-04-09T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8481",
                "source": "Motley Fool",
                "ticker": "INTC",
                "title": "Is Nvidia's Artificial Intelligence (AI) Business Recession-Resistant?",
                "url": "https://finance.yahoo.com/news/nvidias-artificial-intelligence-ai-business-120000539.html"
            },
            {
                "headline": "Conditions continue to work in favor of Taiwan Semiconductor Manufacturing (TSMC) (NYSE: TSM).  Unfortunately, the healthy state of TSMC's business did not prevent a 35% drop in the stock price since January.  Other than TSMC's equipment maker ASML, few other AI stocks are in a stronger position.",
                "publication_date": "2025-04-09T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7461",
                "source": "Motley Fool",
                "ticker": "INTC",
                "title": "Taiwan Semiconductor Manufacturing Is Down 35%. Here's Why Now Could Be the Best Time to Buy the AI Stock.",
                "url": "https://finance.yahoo.com/news/taiwan-semiconductor-manufacturing-down-35-100000106.html"
            },
            {
                "headline": "Intel Sees 7% Decline as Semiconductor Sector Faces Pressure",
                "publication_date": "2025-04-09T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.296",
                "source": "GuruFocus.com",
                "ticker": "INTC",
                "title": "Intel (INTC) Shares Hit 16-Year Low as Tariffs Spark Massive Selloff",
                "url": "https://finance.yahoo.com/news/intel-intc-shares-hit-16-123754734.html"
            },
            {
                "headline": "Semiconductor giant Intel (NASDAQ: INTC) has a new CEO ready to shake up the company after years of disappointing results.  Intel has been losing market share to AMD in its core CPU businesses, struggling to gain a foothold in the AI accelerator market, and pouring billions into new factories and manufacturing technology.  Intel is making progress on the foundry front.",
                "publication_date": "2025-04-09T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.1531",
                "source": "Motley Fool",
                "ticker": "INTC",
                "title": "Will Intel Stock Be a Trade War Winner?",
                "url": "https://finance.yahoo.com/news/intel-stock-trade-war-winner-102000970.html"
            },
            {
                "headline": "The most talked about and market moving research calls around Wall Street are now in one place. Here are today’s research calls that investors need to know, as compiled by The Fly. Top 5 Upgrades: Melius Research upgraded Dollar General (DG) to Buy from Hold with a $110 price target. While the company had its own “self-inflicted” challenges and competitive challenges over the last 12 months, the firm believes it likely will benefit from a worsening macro environment and a lack of tariff exposure",
                "publication_date": "2025-04-09T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.2023",
                "source": "TipRanks",
                "ticker": "INTC",
                "title": "AMD downgraded, Dollar General upgraded: Wall Street’s top analyst calls",
                "url": "https://finance.yahoo.com/news/amd-downgraded-dollar-general-upgraded-133520598.html"
            }
        ],
        "avgScore": 0.45105,
        "pctChange": -0.07663731877641596
    },
    "4 8 2025": {
        "importantArticles": [
            {
                "headline": "A number of stocks fell in the afternoon session after markets gave up early gains with optimism over progress in US-China trade talks quickly fading as the Trump administration announced plans to raise tariffs on all Chinese imports to well above 100%.",
                "publication_date": "2025-04-08T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8779",
                "source": "StockStory",
                "ticker": "INTC",
                "title": "Etsy (ETSY) and Snap (SNAP), Lyft (LYFT), Intel (INTC), Target (TGT) Stocks Trade Down, What You Need To Know",
                "url": "https://finance.yahoo.com/news/etsy-etsy-snap-snap-lyft-215228650.html"
            },
            {
                "headline": "Intel CEO Promises 'Startup Culture' in Bid to Regain Market Share",
                "publication_date": "2025-04-08T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.5859",
                "source": "GuruFocus.com",
                "ticker": "INTC",
                "title": "Intel's New CEO Talks Culture Shift and AI Comeback in Bold Turnaround Pitch",
                "url": "https://finance.yahoo.com/news/intels-ceo-talks-culture-shift-191417391.html"
            },
            {
                "headline": "We came across a bullish thesis on Intel Corporation (INTC) on Substack by DeepValue Capital. In this article, we will summarize the bulls’ thesis on INTC. Intel Corporation (INTC)’s share was trading at $19.57 as of April 7th. INTC’s trailing and forward P/E were 88.08 and 43.67 respectively according to Yahoo Finance. Intel (INTC), once the undisputed […]",
                "publication_date": "2025-04-08T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.5574",
                "source": "Insider Monkey",
                "ticker": "INTC",
                "title": "Intel Corporation (INTC): A Bull Case Theory",
                "url": "https://finance.yahoo.com/news/intel-corporation-intc-bull-case-131021124.html"
            },
            {
                "headline": "KeyBanc recently cut its rating on AMD (AMD) to Sector Weight from Overweight, Schwab Network reported today. As reasons for the downgrade, the bank cited tough competition and worries about AMD’s China business. Intense Competition KeyBanc is concerned that AMD will fall further behind Nvidia (NVDA) and lose ground to Intel (INTC). As a result, […]",
                "publication_date": "2025-04-08T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.8519",
                "source": "Insider Monkey",
                "ticker": "INTC",
                "title": "AMD Downgraded on Competition, China Worries",
                "url": "https://finance.yahoo.com/news/amd-downgraded-competition-china-worries-152044409.html"
            },
            {
                "headline": "(Bloomberg) -- Another volatile day on Wall Street pushed the S&P 500 Index back to the brink of a bear market as the Trump administration doubled down on its plans to enact hefty tariffs that threaten to send the American economy into a recession.Most Read from BloombergThe Irish Hot Press Is the Low-Tech Laundry Trick the World NeedsTrump Order on CDFI Fund Risks Aid for Small Businesses, HousingThis Skinny Mexico City Tower Is Just 14 Feet Wide on One SideIn Chicago, a Former Steel Mill Looks",
                "publication_date": "2025-04-08T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5994",
                "source": "Bloomberg",
                "ticker": "INTC",
                "title": "US Stocks Tumble Again With Tariffs Set to Roil Global Economy",
                "url": "https://finance.yahoo.com/news/us-stock-futures-soar-dip-122149874.html"
            },
            {
                "headline": "AMD stock catches a downgrade as Trump tariff fears spread throughout markets.",
                "publication_date": "2025-04-08T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.4215",
                "source": "Yahoo Finance",
                "ticker": "INTC",
                "title": "AMD stock catches a downgrade as concerns about China and tariffs heat up",
                "url": "https://finance.yahoo.com/news/amd-stock-catches-a-downgrade-as-concerns-about-china-and-tariffs-heat-up-150108550.html"
            }
        ],
        "avgScore": 0.002022222222222197,
        "pctChange": 0.1875345660928945
    },
    "4 7 2025": {
        "importantArticles": [
            {
                "headline": "Articul8 has introduced A8-SupplyChain, a groundbreaking domain-specific Generative AI model designed to optimize supply chain, manufacturing, and industrial process operations. Leveraging autonomous reasoning and real-time decision-making capabilities, A8-SupplyChain surpasses the limitations of general-purpose language models by effectively handling complex industrial systems and translating technical documentation into actionable procedures. This innovation is incorporated into Articul8's...",
                "publication_date": "2025-04-07T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8271",
                "source": "Simply Wall St.",
                "ticker": "INTC",
                "title": "AI Chips Today - Articul8 Transforms Supply Chains With AI-Powered Industrial Solutions",
                "url": "https://finance.yahoo.com/news/ai-chips-today-articul8-transforms-110732232.html"
            },
            {
                "headline": "Zacks.com users have recently been watching Intel (INTC) quite a bit. Thus, it is worth knowing the facts that could determine the stock's prospects.",
                "publication_date": "2025-04-07T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.4767",
                "source": "Zacks",
                "ticker": "INTC",
                "title": "Investors Heavily Search Intel Corporation (INTC): Here is What You Need to Know",
                "url": "https://finance.yahoo.com/news/investors-heavily-search-intel-corporation-130016541.html"
            },
            {
                "headline": "With Lip-Bu Tan as the new CEO, Intel stock might become a top buy this year with a potential turnaround.",
                "publication_date": "2025-04-07T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.2023",
                "source": "Zacks",
                "ticker": "INTC",
                "title": "Can Intel Be the Turnaround Stock of 2025? Is the Time to Buy Now?",
                "url": "https://finance.yahoo.com/news/intel-turnaround-stock-2025-time-190000248.html"
            },
            {
                "headline": "China's move to impose 34% tariffs on all U.S. goods in a tit-for-tat blow against U.S. President Donald Trump is set to roil industries from aviation to agriculture.  China's retaliatory tariffs are set to hit Boeing hard, making its planes far more expensive than those of rivals Airbus and Commercial Aircraft Corporation of China (COMAC).  While Beijing did not impose tariffs on Boeing during Trump's first trade war with China, its sales and deliveries to China plummeted after 2019 following two fatal crashes of MAX 8 jets and amid intensifying tensions between Washington and Beijing over issues ranging from technology to national security.",
                "publication_date": "2025-04-07T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.91",
                "source": "Reuters",
                "ticker": "INTC",
                "title": "Factbox-US companies most vulnerable to China's retaliatory import tariffs",
                "url": "https://finance.yahoo.com/news/factbox-us-companies-most-vulnerable-060518500.html"
            },
            {
                "headline": "With Lip-Bu Tan as the new CEO, Intel stock might become a top buy this year with a potential turnaround.",
                "publication_date": "2025-04-07T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.2023",
                "source": "Zacks",
                "ticker": "INTC",
                "title": "Can Intel Be the Turnaround Stock of 2025? Is the Time to Buy Now?",
                "url": "https://finance.yahoo.com/news/intel-turnaround-stock-2025-time-190000248.html"
            },
            {
                "headline": "Zacks.com users have recently been watching Intel (INTC) quite a bit. Thus, it is worth knowing the facts that could determine the stock's prospects.",
                "publication_date": "2025-04-07T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.4767",
                "source": "Zacks",
                "ticker": "INTC",
                "title": "Investors Heavily Search Intel Corporation (INTC): Here is What You Need to Know",
                "url": "https://finance.yahoo.com/news/investors-heavily-search-intel-corporation-130016541.html"
            }
        ],
        "avgScore": 0.14902499999999994,
        "pctChange": -0.07358204172269159
    },
    "4 4 2025": {
        "importantArticles": [
            {
                "headline": "In a strategic partnership, Navitas Semiconductor and Great Wall have developed a next-generation 400V-DC power architecture specifically designed for AI data centers. Leveraging Navitas’ GaNSense technology, the collaboration has resulted in an ultra-high power density DC-DC converter delivering 2.5kW of power—marking a significant leap in power efficiency and density. This innovative power solution supports evolving data center requirements by accommodating more GPUs while promoting energy...",
                "publication_date": "2025-04-04T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9506",
                "source": "Simply Wall St.",
                "ticker": "INTC",
                "title": "AI Chips Today - Pioneering Power Efficiency In Next-Gen Data Centers",
                "url": "https://finance.yahoo.com/news/ai-chips-today-pioneering-power-110730132.html"
            },
            {
                "headline": "The tech-heavy Nasdaq Composite (^IXIC) is set to enter a bear market. Futurum Group CEO Daniel Newman joins Catalysts with Madison Mills and Lumida Wealth Management CEO Ram Ahluwalia to discuss what President Donald Trump's new tariffs mean for tech CEOs and their artificial intelligence (AI) spending. To watch more expert insights and analysis on the latest market action, check out more Catalysts here.",
                "publication_date": "2025-04-04T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.743",
                "source": "Yahoo Finance Video",
                "ticker": "INTC",
                "title": "Tariff-fueled downturn shouldn't impact Big Tech's AI spending",
                "url": "https://finance.yahoo.com/video/tariff-fueled-downturn-shouldnt-impact-170000182.html"
            },
            {
                "headline": "Intel stock was dropping after China said it would retaliate against U.S. tariffs, outweighing hopes of a joint venture with Taiwan Semiconductor Manufacturing.",
                "publication_date": "2025-04-04T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.4215",
                "source": "Barrons.com",
                "ticker": "INTC",
                "title": "Intel Stock Falls. Trade War Fears Overshadow Report of TSMC Joint Venture.",
                "url": "https://finance.yahoo.com/m/0b8f8438-5a18-3153-a8d3-11fed2b2f47a/intel-stock-falls-trade-war.html"
            },
            {
                "headline": "Investing.com -- Citi analysts are skeptical about reports that Intel (NASDAQ:INTC) and TSMC are considering a joint venture, arguing that such a move would not be successful given fundamental differences in operations.",
                "publication_date": "2025-04-04T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.8112",
                "source": "Investing.com",
                "ticker": "INTC",
                "title": "Citi says reported Intel-TSMC JV would be 'the wrong move'",
                "url": "https://finance.yahoo.com/news/citi-says-reported-intel-tsmc-141910028.html"
            },
            {
                "headline": "(Bloomberg) -- There’s virtually nowhere to hide for many US technology companies under President Donald Trump’s new tariff regime, the harshest in a century.Most Read from BloombergHousing Agency Aims to Relocate Its DC HeadquartersMetro-North Is Faster Than Acela on NYC-New Haven Route After Signal UpdatesLocal Governments Vie for Fired Federal WorkersLondon Clears Final Hurdle for More High-Speed Trains to EuropeWhat Would ‘Transportation Abundance’ Look Like?After Thursday’s slump wiped $1.4",
                "publication_date": "2025-04-04T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.7705",
                "source": "Bloomberg",
                "ticker": "INTC",
                "title": "‘Worst-Case Scenario’ for Tech Wipes $1.4 Trillion from Nasdaq",
                "url": "https://finance.yahoo.com/news/worst-case-scenario-tech-wipes-081406416.html"
            },
            {
                "headline": "As part of today's Market Minute, Madison Mills outlines the top stories of the trading day. Intel (INTC) stock plunges as US–China trade war tensions intensify. Dell Technologies (DELL) stock extends losses as Morgan Stanley (MS) analysts raise concerns about tariff impacts. Chinese tech stocks, like Alibaba (BABA), PDD Holdings (PDD), and JD.com (JD), tumble as China retaliates against Trump's new tariffs. Stay up to date on the latest market action, minute-by-minute, with Yahoo Finance's Market Minute.",
                "publication_date": "2025-04-04T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.6705",
                "source": "Yahoo Finance Video",
                "ticker": "INTC",
                "title": "Intel, Dell, Chinese tech stocks fall: Market Minute",
                "url": "https://finance.yahoo.com/video/intel-dell-chinese-tech-stocks-151645306.html"
            }
        ],
        "avgScore": 0.08037058823529414,
        "pctChange": -0.014105827771514435
    },
    "4 3 2025": {
        "importantArticles": [
            {
                "headline": "Intel (NASDAQ: INTC) stock posted gains despite big sell-offs for the broader market Thursday.  The semiconductor company's share price closed out the day up 2.1% and had been up as much as 8.7% earlier in trading.  Meanwhile, the S&P 500 fell 4.9% in the session, and the Nasdaq Composite ended the day down 6%.",
                "publication_date": "2025-04-03T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.5574",
                "source": "Motley Fool",
                "ticker": "INTC",
                "title": "Why Intel Stock Jumped in a Brutal Day for the Market",
                "url": "https://finance.yahoo.com/news/why-intel-stock-jumped-brutal-211930981.html"
            },
            {
                "headline": "Shares of Intel (INTC) rose late Thursday following a report from The Information that the chip giant has reached a tentative deal with TSMC (TSM) to form a joint venture. Learn the details of the report in the video above.&nbsp; To watch more expert insights and analysis on the latest market action, check out more Asking for a Trend here.",
                "publication_date": "2025-04-03T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.3818",
                "source": "Yahoo Finance Video",
                "ticker": "INTC",
                "title": "Intel stock rises on report of TSMC deal",
                "url": "https://finance.yahoo.com/video/intel-stock-rises-report-tsmc-210339062.html"
            },
            {
                "headline": "Intel and TSMC have tentatively agreed to form a joint venture that would run the U.S. company’s foundry business, The Information reported Thursday.",
                "publication_date": "2025-04-03T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.2732",
                "source": "Investopedia",
                "ticker": "INTC",
                "title": "Intel, TSMC Set To Form Chipmaking Joint Venture in the US, Report Says",
                "url": "https://finance.yahoo.com/news/intel-tsmc-set-form-chipmaking-203855803.html"
            },
            {
                "headline": "Intel and TSMC have tentatively agreed to form a joint venture that would run the U.S. company’s foundry business, The Information reported Thursday.",
                "publication_date": "2025-04-03T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.2732",
                "source": "Investopedia",
                "ticker": "INTC",
                "title": "Intel, TSMC Set To Form Chipmaking Joint Venture in the US, Report Says",
                "url": "https://finance.yahoo.com/news/intel-tsmc-set-form-chipmaking-203855803.html"
            },
            {
                "headline": "Shares of Intel (INTC) rose late Thursday following a report from The Information that the chip giant has reached a tentative deal with TSMC (TSM) to form a joint venture. Learn the details of the report in the video above.&nbsp; To watch more expert insights and analysis on the latest market action, check out more Asking for a Trend here.",
                "publication_date": "2025-04-03T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.3818",
                "source": "Yahoo Finance Video",
                "ticker": "INTC",
                "title": "Intel stock rises on report of TSMC deal",
                "url": "https://finance.yahoo.com/video/intel-stock-rises-report-tsmc-210339062.html"
            },
            {
                "headline": "Intel (NASDAQ: INTC) stock posted gains despite big sell-offs for the broader market Thursday.  The semiconductor company's share price closed out the day up 2.1% and had been up as much as 8.7% earlier in trading.  Meanwhile, the S&P 500 fell 4.9% in the session, and the Nasdaq Composite ended the day down 6%.",
                "publication_date": "2025-04-03T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.5574",
                "source": "Motley Fool",
                "ticker": "INTC",
                "title": "Why Intel Stock Jumped in a Brutal Day for the Market",
                "url": "https://finance.yahoo.com/news/why-intel-stock-jumped-brutal-211930981.html"
            }
        ],
        "avgScore": 0.4041333333333334,
        "pctChange": -0.1150245157647507
    },
    "coef": -0.5428571428571428,
    "avgCoef": 0.012205902058537239,
    "similar": {
        "TAL": 0.15714285714285714,
        "PSLV": -0.024999999999999998,
        "NGD": -0.03214285714285714,
        "HL": -0.06071428571428571
    }
}