{
    "4 14 2025": {
        "importantArticles": [
            {
                "headline": "On Monday, Intel Corp (NASDAQ:INTC) announced plans to sell 51% of its Altera business to Silver Lake at a valuation of $8.75 billion. Intel will own the remaining 49% of the Altera business, enabling it to participate in Altera’s future success while focusing on its core business. Intel also announced that Raghib Hussain will succeed Sandra Rivera as CEO of Altera, effective May 5. Also Read: Taiwan Semiconductor Clocks Massive Q1 Revenue Growth Despite US Tensions The transaction will likely c",
                "publication_date": "2025-04-14T15:06:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9307",
                "source": "Benzinga",
                "ticker": "INTC",
                "title": "Intel To Offload 51% Of Altera Business To PE Firm Silver Lake",
                "url": "https://finance.yahoo.com/news/intel-offload-51-altera-business-150600693.html"
            },
            {
                "headline": "VAST Data has been recognized on the Forbes AI 50 list for 2025, which highlights the most promising private AI companies globally. This listing underscores VAST’s significant role in AI infrastructure, evidenced by its platform being utilized by numerous organizations for AI training and inference operations. The company has been noted for its strong innovation and sustained growth in the competitive AI market. VAST Data’s distributed, internet-scale platform has become integral to...",
                "publication_date": "2025-04-14T11:37:24.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9184",
                "source": "Simply Wall St.",
                "ticker": "INTC",
                "title": "AI Chips Update - VAST Data Shines on Forbes AI 50 List 2025",
                "url": "https://finance.yahoo.com/news/ai-chips-vast-data-shines-113724303.html"
            },
            {
                "headline": "Intel announced Monday that it was selling the majority of its Altera chip business to technology investor Silver Lake in a deal valued at $8.75 billion.  Silver Lake will own 51% of Altera, which Intel acquired in 2015 for $16.7 billion in an effort to expand its business into chip markets focused on wireless, automobiles and other products.  At the time, it was the biggest deal in Intel Corp.'s history.",
                "publication_date": "2025-04-14T14:01:31.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7783",
                "source": "Associated Press Finance",
                "ticker": "INTC",
                "title": "Intel sells majority stake in Altera to Silver Lake investors in a deal valued at $8.75 billion",
                "url": "https://finance.yahoo.com/news/intel-sells-majority-stake-altera-140131721.html"
            },
            {
                "headline": "(Reuters) -Intel has agreed to sell a 51% stake in its Altera programmable chip business to buyout firm Silver Lake for $4.46 billion, in the first major move by new CEO Lip-Bu Tan to revive the struggling American chipmaker.  Monday's deal values Altera at just $8.75 billion compared to the nearly $17 billion Intel paid in 2015, but the sale will provide the company much-needed cash after hefty bets on contract manufacturing by former CEO Pat Gelsinger strained its finances.  Shedding assets, including Intel's stake in Altera, is at the center of Tan's strategy to streamline the chipmaker after predecessors failed to diversify beyond its mainstay PC and server chip business for years.",
                "publication_date": "2025-04-14T12:37:10.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.6956",
                "source": "Reuters",
                "ticker": "INTC",
                "title": "Intel to sell majority stake in Altera for $4.46 billion to fund revival effort",
                "url": "https://finance.yahoo.com/news/intel-sell-51-stake-altera-123710271.html"
            },
            {
                "headline": "Brad Smith and Madison Mills take a closer look at some of today's trending tickers. Pfizer (PFE) discontinued its obesity drug after the pill was tied to a potentially drug-induced liver injury. Nvidia (NVDA) says it will make it the first artificial intelligence (AI) supercomputer in the US, marking heavy investment in the US while President Trump imposes hefty tariffs on foreign imports. Intel (INTC) sells its controlling stake in Altera to Silver Lake. To watch more expert insights and analysis on the latest market action, check out more Morning Brief here.",
                "publication_date": "2025-04-14T14:37:53.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "-0.0258",
                "source": "Yahoo Finance Video",
                "ticker": "INTC",
                "title": "Pfizer, Nvidia, Intel: Stocks in 30",
                "url": "https://finance.yahoo.com/video/pfizer-nvidia-intel-stocks-30-143753704.html"
            },
            {
                "headline": "Intel is selling 51% of Altera for $8.75 billion to private-equity firm Silver Lake. Intel bought it a decade ago for $16.7 billion.",
                "publication_date": "2025-04-14T14:02:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Barrons.com",
                "ticker": "INTC",
                "title": "Intel Stock Is Rising on Altera Sale Deal. What It Needs to Do Next.",
                "url": "https://finance.yahoo.com/m/cd3c0fd9-b0da-3860-b895-34617af8c071/intel-stock-is-rising-on.html"
            }
        ],
        "avgScore": 0.39517500000000005
    },
    "4 11 2025": {
        "importantArticles": [
            {
                "headline": "Brad Smith examines the trending stories on today's Market Minute. Gold (GC=F) climbs, reaching new highs. US chipmakers (SMH) like Intel (INTC) and Texas Instruments (TXN) fall as China hits the US with a 125% tariff based on manufacturing origin. Morgan Stanley (MS) earnings beat expectations, boosted by Elon Musk selling X, according to Bloomberg. Stay up to date on the latest market action, minute-by-minute, with Yahoo Finance's Market Minute.",
                "publication_date": "2025-04-11T16:17:04.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7003",
                "source": "Yahoo Finance Video",
                "ticker": "INTC",
                "title": "Gold, US chipmakers, Morgan Stanley & Elon Musk: Market Minute",
                "url": "https://finance.yahoo.com/video/gold-us-chipmakers-morgan-stanley-161704927.html"
            },
            {
                "headline": "AMD has introduced the 5th Gen AMD EPYC processors, which are now powering Google Cloud's new C4D and H4D virtual machines (VMs). These VMs offer significant enhancements in performance, scalability, and efficiency, specifically tailored for demanding cloud workloads including AI and high-performance computing (HPC). The C4D instances, fueled by AMD's \"Zen 5\" architecture, show up to 80% higher throughput per vCPU, catering to general-purpose and AI inferencing tasks, while the H4D instances...",
                "publication_date": "2025-04-11T11:37:37.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.34",
                "source": "Simply Wall St.",
                "ticker": "INTC",
                "title": "AI Chips Update - AMD Powers Google Cloud With 5th Gen EPYC Processors",
                "url": "https://finance.yahoo.com/news/ai-chips-amd-powers-google-113737152.html"
            },
            {
                "headline": "The chipmaking giant has a new CEO, but it still faces existential challenges.",
                "publication_date": "2025-04-11T08:14:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.1154",
                "source": "Motley Fool",
                "ticker": "INTC",
                "title": "Where Will Intel Stock Be in 3 Years?",
                "url": "https://finance.yahoo.com/news/where-intel-stock-3-years-081400654.html"
            },
            {
                "headline": "Julie Hyman and Josh Lipton take a closer look at some of today's trending tickers. Recursion Pharma (RXRX) stock surges after the Food and Drug Administration (FDA) announced plans to phase out some animal testing requirements. Intel (INTC) stock falls as tensions in the US-China trade war intensify. Five Below (FIVE) stock declines as China tariffs impact orders. To watch more expert insights and analysis on the latest market action, check out more Market Domination here.",
                "publication_date": "2025-04-11T19:47:42.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.7951",
                "source": "Yahoo Finance Video",
                "ticker": "INTC",
                "title": "Recursion Pharma rises, Intel & Five Below fall: Trending Tickers",
                "url": "https://finance.yahoo.com/video/recursion-pharma-rises-intel-five-194742139.html"
            },
            {
                "headline": "The latest trading day saw Intel (INTC) settling at $19.74, representing a -0.7% change from its previous close.",
                "publication_date": "2025-04-11T21:45:15.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Zacks",
                "ticker": "INTC",
                "title": "Intel (INTC) Stock Slides as Market Rises: Facts to Know Before You Trade",
                "url": "https://finance.yahoo.com/news/intel-intc-stock-slides-market-214515557.html"
            },
            {
                "headline": "Chipmakers on Edge as China's Tariff Response Zeroes In on U.S. Foundries",
                "publication_date": "2025-04-11T21:12:32.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "GuruFocus.com",
                "ticker": "INTC",
                "title": "Intel Faces Fresh Pressure as China Targets U.S.-Made Chips in Trade Salvo",
                "url": "https://finance.yahoo.com/news/intel-faces-fresh-pressure-china-211232269.html"
            }
        ],
        "avgScore": 0.036059999999999995
    },
    "4 10 2025": {
        "importantArticles": [
            {
                "headline": "Intel Corporation (NASDAQ: INTC), has presented UDT with its 2025 \"Partner of the Year for Education\" award, underscoring UDT's long-standing commitment and contributions to technological innovation in America's national education sector.",
                "publication_date": "2025-04-10T16:03:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8271",
                "source": "PR Newswire",
                "ticker": "INTC",
                "title": "Intel Corporation Names UDT 2025 Partner of the Year for Education",
                "url": "https://finance.yahoo.com/news/intel-corporation-names-udt-2025-160300426.html"
            },
            {
                "headline": "Intel (NasdaqGS:INTC) experienced an 8% increase in share price over the last quarter. This period witnessed several key developments, including the retirement of Dr. Lavizzo-Mourey from the Board of Directors and a key CEO appointment. Despite reporting significant financial losses for 2024, new product launches such as the Xeon 6 processors provided positive momentum. The share price performance came amidst a challenging market environment, with the Nasdaq declining 6% largely due to a tech...",
                "publication_date": "2025-04-10T17:16:29.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7655",
                "source": "Simply Wall St.",
                "ticker": "INTC",
                "title": "Intel (NasdaqGS:INTC) Announces Retirement Of Dr. Lavizzo-Mourey From Board Of Directors",
                "url": "https://finance.yahoo.com/news/intel-nasdaqgs-intc-announces-retirement-171629190.html"
            },
            {
                "headline": "Nvidia (NVDA) witnessed a jump in share price last session on above-average trading volume. The latest trend in earnings estimate revisions for the stock suggests that there could be more strength down the road.",
                "publication_date": "2025-04-10T12:30:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.6901",
                "source": "Zacks",
                "ticker": "INTC",
                "title": "Nvidia (NVDA) Moves 18.7% Higher: Will This Strength Last?",
                "url": "https://finance.yahoo.com/news/nvidia-nvda-moves-18-7-123000466.html"
            },
            {
                "headline": "Shares of Intel (NASDAQ: INTC) are falling on Thursday.  The drop comes as the S&P 500 and Nasdaq Composite both lost more than 5%.  Intel's stock is feeling pressure from the ongoing trade war with China as well as a Reuters report today that revealed its new CEO has extensive business ties in the country, raising concerns of a potential conflict of interest.",
                "publication_date": "2025-04-10T16:43:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.6808",
                "source": "Motley Fool",
                "ticker": "INTC",
                "title": "Why Intel Stock Is Plummeting Today",
                "url": "https://finance.yahoo.com/news/why-intel-stock-plummeting-today-164300535.html"
            },
            {
                "headline": "We recently published a list of 10 Stocks on Jim Cramer’s Radar Recently. In this article, we are going to take a look at where Intel Corporation (NASDAQ:INTC) stands against other stocks on Jim Cramer’s radar. On Tuesday, Jim Cramer, host of Mad Money, discussed the impact of tariff-induced market volatility and he also discussed […]",
                "publication_date": "2025-04-10T17:16:55.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.4939",
                "source": "Insider Monkey",
                "ticker": "INTC",
                "title": "“Fix the Balance Sheet First – Then We’ll Take a Hard Look” – Jim Cramer on Intel (INTC)",
                "url": "https://finance.yahoo.com/news/fix-balance-sheet-first-then-171655298.html"
            },
            {
                "headline": "Lip-Bu Tan, the man chosen to lead Intel, the U.S.'s largest chip maker, has invested in hundreds of Chinese tech firms, including at least eight with links to the People's Liberation Army, according to a Reuters review of Chinese and U.S. corporate filings.  The appointment last month of Tan, one of Silicon Valley's longest-running investors in Chinese tech, as CEO of a company that manufactures cutting-edge chips for the U.S. Department of Defense raised questions among some investors about the extent of his ongoing involvement with businesses in China.  Reuters' review found that Tan controls more than 40 Chinese companies and funds as well as minority stakes in over 600 via investment firms he manages or owns.",
                "publication_date": "2025-04-10T10:02:35.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.3818",
                "source": "Reuters",
                "ticker": "INTC",
                "title": "Intel CEO invested in hundreds of Chinese companies, some with military ties",
                "url": "https://finance.yahoo.com/news/intel-ceo-invested-hundreds-chinese-100235547.html"
            }
        ],
        "avgScore": 0.3668818181818183
    },
    "4 9 2025": {
        "importantArticles": [
            {
                "headline": "LPL Financial Holdings Inc. has appointed Vaughn Harvey as the executive vice president and chief data and artificial intelligence (AI) officer, marking a significant move in its AI strategy. With over 25 years of experience in AI-driven digital transformations, Harvey will spearhead LPL’s data and AI initiatives, enhancing digital transformation across the organization. This appointment comes as LPL Financial aims to advance its offerings in artificial intelligence through programs like AI...",
                "publication_date": "2025-04-09T11:38:02.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8591",
                "source": "Simply Wall St.",
                "ticker": "INTC",
                "title": "This Week In AI Chips - LPL Financial Enhances AI Strategy With Key Executive Appointment",
                "url": "https://finance.yahoo.com/news/week-ai-chips-lpl-financial-113802366.html"
            },
            {
                "headline": "Nvidia (NASDAQ: NVDA) held its GPU Technology Conference (GTC) 2025 last month in San Jose, California.  Great information was shared during all these events, particularly Huang's keynote.  It was chock-full of promising new product launches and partnerships, reinforcing my bullish view of Nvidia stock as a long-term investment.",
                "publication_date": "2025-04-09T12:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8481",
                "source": "Motley Fool",
                "ticker": "INTC",
                "title": "Is Nvidia's Artificial Intelligence (AI) Business Recession-Resistant?",
                "url": "https://finance.yahoo.com/news/nvidias-artificial-intelligence-ai-business-120000539.html"
            },
            {
                "headline": "Conditions continue to work in favor of Taiwan Semiconductor Manufacturing (TSMC) (NYSE: TSM).  Unfortunately, the healthy state of TSMC's business did not prevent a 35% drop in the stock price since January.  Other than TSMC's equipment maker ASML, few other AI stocks are in a stronger position.",
                "publication_date": "2025-04-09T10:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7461",
                "source": "Motley Fool",
                "ticker": "INTC",
                "title": "Taiwan Semiconductor Manufacturing Is Down 35%. Here's Why Now Could Be the Best Time to Buy the AI Stock.",
                "url": "https://finance.yahoo.com/news/taiwan-semiconductor-manufacturing-down-35-100000106.html"
            },
            {
                "headline": "Intel Sees 7% Decline as Semiconductor Sector Faces Pressure",
                "publication_date": "2025-04-09T12:37:54.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.296",
                "source": "GuruFocus.com",
                "ticker": "INTC",
                "title": "Intel (INTC) Shares Hit 16-Year Low as Tariffs Spark Massive Selloff",
                "url": "https://finance.yahoo.com/news/intel-intc-shares-hit-16-123754734.html"
            },
            {
                "headline": "Semiconductor giant Intel (NASDAQ: INTC) has a new CEO ready to shake up the company after years of disappointing results.  Intel has been losing market share to AMD in its core CPU businesses, struggling to gain a foothold in the AI accelerator market, and pouring billions into new factories and manufacturing technology.  Intel is making progress on the foundry front.",
                "publication_date": "2025-04-09T10:20:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.1531",
                "source": "Motley Fool",
                "ticker": "INTC",
                "title": "Will Intel Stock Be a Trade War Winner?",
                "url": "https://finance.yahoo.com/news/intel-stock-trade-war-winner-102000970.html"
            },
            {
                "headline": "The most talked about and market moving research calls around Wall Street are now in one place. Here are today’s research calls that investors need to know, as compiled by The Fly. Top 5 Upgrades: Melius Research upgraded Dollar General (DG) to Buy from Hold with a $110 price target. While the company had its own “self-inflicted” challenges and competitive challenges over the last 12 months, the firm believes it likely will benefit from a worsening macro environment and a lack of tariff exposure",
                "publication_date": "2025-04-09T13:35:20.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.2023",
                "source": "TipRanks",
                "ticker": "INTC",
                "title": "AMD downgraded, Dollar General upgraded: Wall Street’s top analyst calls",
                "url": "https://finance.yahoo.com/news/amd-downgraded-dollar-general-upgraded-133520598.html"
            }
        ],
        "avgScore": 0.45105
    },
    "4 8 2025": {
        "importantArticles": [
            {
                "headline": "A number of stocks fell in the afternoon session after markets gave up early gains with optimism over progress in US-China trade talks quickly fading as the Trump administration announced plans to raise tariffs on all Chinese imports to well above 100%.",
                "publication_date": "2025-04-08T21:52:28.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8779",
                "source": "StockStory",
                "ticker": "INTC",
                "title": "Etsy (ETSY) and Snap (SNAP), Lyft (LYFT), Intel (INTC), Target (TGT) Stocks Trade Down, What You Need To Know",
                "url": "https://finance.yahoo.com/news/etsy-etsy-snap-snap-lyft-215228650.html"
            },
            {
                "headline": "Intel CEO Promises 'Startup Culture' in Bid to Regain Market Share",
                "publication_date": "2025-04-08T19:14:17.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.5859",
                "source": "GuruFocus.com",
                "ticker": "INTC",
                "title": "Intel's New CEO Talks Culture Shift and AI Comeback in Bold Turnaround Pitch",
                "url": "https://finance.yahoo.com/news/intels-ceo-talks-culture-shift-191417391.html"
            },
            {
                "headline": "We came across a bullish thesis on Intel Corporation (INTC) on Substack by DeepValue Capital. In this article, we will summarize the bulls’ thesis on INTC. Intel Corporation (INTC)’s share was trading at $19.57 as of April 7th. INTC’s trailing and forward P/E were 88.08 and 43.67 respectively according to Yahoo Finance. Intel (INTC), once the undisputed […]",
                "publication_date": "2025-04-08T13:10:21.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.5574",
                "source": "Insider Monkey",
                "ticker": "INTC",
                "title": "Intel Corporation (INTC): A Bull Case Theory",
                "url": "https://finance.yahoo.com/news/intel-corporation-intc-bull-case-131021124.html"
            },
            {
                "headline": "KeyBanc recently cut its rating on AMD (AMD) to Sector Weight from Overweight, Schwab Network reported today. As reasons for the downgrade, the bank cited tough competition and worries about AMD’s China business. Intense Competition KeyBanc is concerned that AMD will fall further behind Nvidia (NVDA) and lose ground to Intel (INTC). As a result, […]",
                "publication_date": "2025-04-08T15:20:44.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.8519",
                "source": "Insider Monkey",
                "ticker": "INTC",
                "title": "AMD Downgraded on Competition, China Worries",
                "url": "https://finance.yahoo.com/news/amd-downgraded-competition-china-worries-152044409.html"
            },
            {
                "headline": "(Bloomberg) -- Another volatile day on Wall Street pushed the S&P 500 Index back to the brink of a bear market as the Trump administration doubled down on its plans to enact hefty tariffs that threaten to send the American economy into a recession.Most Read from BloombergThe Irish Hot Press Is the Low-Tech Laundry Trick the World NeedsTrump Order on CDFI Fund Risks Aid for Small Businesses, HousingThis Skinny Mexico City Tower Is Just 14 Feet Wide on One SideIn Chicago, a Former Steel Mill Looks",
                "publication_date": "2025-04-08T20:06:53.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5994",
                "source": "Bloomberg",
                "ticker": "INTC",
                "title": "US Stocks Tumble Again With Tariffs Set to Roil Global Economy",
                "url": "https://finance.yahoo.com/news/us-stock-futures-soar-dip-122149874.html"
            },
            {
                "headline": "AMD stock catches a downgrade as Trump tariff fears spread throughout markets.",
                "publication_date": "2025-04-08T15:01:08.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.4215",
                "source": "Yahoo Finance",
                "ticker": "INTC",
                "title": "AMD stock catches a downgrade as concerns about China and tariffs heat up",
                "url": "https://finance.yahoo.com/news/amd-stock-catches-a-downgrade-as-concerns-about-china-and-tariffs-heat-up-150108550.html"
            }
        ],
        "avgScore": -0.028975
    },
    "coef": 0.7,
    "avgCoef": 0.21975541953018246
}