{
    "importantArticles": [
        {
            "headline": "IonQ (IONQ) has been selected for the first stage of the Defense Advanced Research Projects Agency Quantum Benchmarking Initiative. This program is designed to assess and validate the feasibility of developing industrially useful quantum computers ahead of conventional projections. With a demonstrated track record of innovation and real-world quantum applications, IonQ will help inform industry standards. As a participant in the first stage of DARPA’s QBI, IonQ will play a role in defining what",
            "publication_date": "2025-04-04T15:35:26.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.9274",
            "source": "TipRanks",
            "ticker": "IONQ",
            "title": "IonQ selected by DARPA for Quantum Benchmarking Intitiative",
            "url": "https://finance.yahoo.com/news/ionq-selected-darpa-quantum-benchmarking-153526150.html"
        },
        {
            "headline": "COLLEGE PARK, Md., April 03, 2025--IonQ (NYSE: IONQ), a leader in the quantum computing and networking industries, today announced that it has been selected for the first stage of the Defense Advanced Research Projects Agency (DARPA) Quantum Benchmarking Initiative (QBI). This program is designed to assess and validate the feasibility of developing industrially useful quantum computers ahead of conventional projections. With a demonstrated track record of innovation and real-world quantum applic",
            "publication_date": "2025-04-03T15:26:00.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.8591",
            "source": "Business Wire",
            "ticker": "IONQ",
            "title": "IonQ Selected by DARPA for Quantum Benchmarking Initiative (QBI) to Advance Quantum Computing",
            "url": "https://finance.yahoo.com/news/ionq-selected-darpa-quantum-benchmarking-152600228.html"
        },
        {
            "headline": "One of the leaders was IonQ (NYSE: IONQ) with a massive 237% gain.  IonQ shares are down by 43% year to date.  IonQ stock was up double-digits before paring some of those gains in late trading Thursday.",
            "publication_date": "2025-03-27T19:06:25.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.7906",
            "source": "Motley Fool",
            "ticker": "IONQ",
            "title": "Why Quantum Computing Stock IonQ Soared This Week",
            "url": "https://finance.yahoo.com/news/why-quantum-computing-stock-ionq-190625088.html"
        },
        {
            "headline": "IonQ (NYSE:IONQ) recently completed significant collaborations and an equity offering, marking milestones such as showcasing quantum computing's capabilities in medical device design with Ansys, and delivering a quantum networking system to the U.S. Air Force. Despite these advancements, the company's stock dropped 7% over the last month, amidst a broader market downturn led by looming tariffs and the Nasdaq's worst monthly performance since 2022. Although IonQ's technological achievements...",
            "publication_date": "2025-03-31T17:52:29.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.5859",
            "source": "Simply Wall St.",
            "ticker": "IONQ",
            "title": "IonQ (NYSE:IONQ) Showcases Quantum Computing In Medical Devices While Stock Drops 7% In Last Month",
            "url": "https://finance.yahoo.com/news/ionq-nyse-ionq-showcases-quantum-175229761.html"
        },
        {
            "headline": "Forte Enterprise offers AQ36 performance and is designed for use in commercial environments such as life sciences and finance.",
            "publication_date": "2025-04-02T15:08:59.000Z",
            "sentiment": "Neutral",
            "sentimentScore": "0.0",
            "source": "GuruFocus.com",
            "ticker": "IONQ",
            "title": "IonQ Launches Forte Enterprise Quantum System Globally Through Amazon Braket",
            "url": "https://finance.yahoo.com/news/ionq-launches-forte-enterprise-quantum-150859356.html"
        },
        {
            "headline": "The program will define benchmarks for utility-scale quantum computers and develop a roadmap through 2033.",
            "publication_date": "2025-04-03T18:45:19.000Z",
            "sentiment": "Neutral",
            "sentimentScore": "0.0",
            "source": "GuruFocus.com",
            "ticker": "IONQ",
            "title": "IonQ Selected for DARPA's Quantum Benchmarking Program",
            "url": "https://finance.yahoo.com/news/ionq-selected-darpas-quantum-benchmarking-184519679.html"
        }
    ],
    "avgScore": 0.4259166666666667,
    "todayPctChange": -0.08798231528158523,
    "vScore": -3.7473134450348513
}