{
    "Important Articles": [
        {
            "headline": "Brazilian payment processor PagBrasil and Paraguayan Bancard announced on Friday a partnership to process transactions on Brazil's widely popular Pix instant payment system, highlighting the growing interest from Latin American fintechs in the market.  The companies said they expect to process $100 million in Pix transactions by Paraguayans in Brazil in 2025, as foreigners embrace the payment method that since 2020 has become the country's most widely used, surpassing cash, credit and debit cards.  Pix, a real-time payment technology developed by the Brazilian central bank, has gained popularity among tourists because it offers more favorable exchange rates than credit cards or cash from exchange offices.",
            "publication_date": "2025-01-31T20:51:50.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.9686",
            "source": "Reuters",
            "ticker": "ITUB",
            "title": "Brazil, Paraguay fintechs aim to process $100 million in Pix transactions in 2025",
            "url": "https://finance.yahoo.com/news/brazil-paraguay-fintechs-aim-process-205150541.html"
        },
        {
            "headline": "SAO PAULO (Reuters) -Brazil's Itau Unibanco, Latin America's largest private lender, on Tuesday posted second-quarter profit that was up 15.2% from a year earlier, boosted by higher revenues and lower cost of credit.  Itau posted a 10.07 billion real net recurring profit ($1.8 billion) for the quarter ended in June, slightly more than the 9.99 billion reais estimated by analysts polled by LSEG.  Although net profit was mostly in line with estimates, analysts welcomed the results.",
            "publication_date": "2024-08-07T00:34:29.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.9186",
            "source": "Reuters",
            "ticker": "ITUB",
            "title": "Lender Itau Unibanco reports higher profit, credit acceleration",
            "url": "https://finance.yahoo.com/news/brazilian-lender-itau-unibancos-net-213423161.html"
        },
        {
            "headline": "Dividends are one of the best benefits to being a shareholder, but finding a great dividend stock is no easy task. Does Banco Itau (ITUB) have what it takes? Let's find out.",
            "publication_date": "2024-09-24T15:45:02.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.9022",
            "source": "Zacks",
            "ticker": "ITUB",
            "title": "Banco Itau (ITUB) Could Be a Great Choice",
            "url": "https://finance.yahoo.com/news/banco-itau-itub-could-great-154502780.html"
        },
        {
            "headline": "We recently published a list of 10 Worst Affordable Stocks to Buy Under $10. In this article, we are going to take a look at where Itaú Unibanco Holding S.A. (NYSE:ITUB) stands against other worst affordable stocks to buy under $10. Will There Be a Small Cap Resurgence in 2025? On February 18, Chris Clark, […]",
            "publication_date": "2025-03-27T01:41:34.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.8481",
            "source": "Insider Monkey",
            "ticker": "ITUB",
            "title": "Is Itaú Unibanco Holding S.A. (NYSE:ITUB) the Worst Affordable Stocks to Buy Under $10?",
            "url": "https://finance.yahoo.com/news/ita-unibanco-holding-nyse-itub-014134286.html"
        },
        {
            "headline": "We recently published a list of 10 Ridiculously Cheap Stocks to Buy Right Now. In this article, we are going to take a look at where Itaú Unibanco Holding S.A. (NYSE:ITUB) stands against other ridiculously cheap stocks to buy right now. The Market is Not Cheap Right Now, Strategist Says The S&P 500 is currently […]",
            "publication_date": "2024-11-26T19:54:30.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.5859",
            "source": "Insider Monkey",
            "ticker": "ITUB",
            "title": "Itaú Unibanco (ITUB): Digital Transformation and Strong Growth Make It a Top Pick",
            "url": "https://finance.yahoo.com/news/ita-unibanco-itub-digital-transformation-195430357.html"
        },
        {
            "headline": "Brazil's federal prosecutors have launched an investigation into alleged fund diversion by a former senior executive at Itau Unibanco, set to take a key role at Spanish bank Santander in coming months.  Latin America's largest bank accused its former Chief Financial Officer, Alexsandro Broedel Lopes, of misappropriating funds while working at the bank, in a filing published in December.  The bank later sued Broedel for damages.",
            "publication_date": "2025-02-27T22:28:16.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.5574",
            "source": "Reuters",
            "ticker": "ITUB",
            "title": "Brazilian prosecutors investigate top Santander executive",
            "url": "https://finance.yahoo.com/news/brazilian-prosecutors-investigate-top-santander-222816877.html"
        }
    ],
    "Avg Score": 0.35214
}