{
    "Important Articles": [
        {
            "headline": "JD.com (NasdaqGS:JD) recently integrated Good Earth Oils' premium canola oil into its supply chain, boosting its e-commerce offerings. This collaboration, alongside JD.com becoming an official partner for the UEFA Champions League, aligns with the company's strategic expansion within consumer goods and experiential services. Additionally, JD.com's strong financial performance, highlighted by robust earnings growth and the allocation of a significant cash dividend, paints a favorable picture...",
            "publication_date": "2025-04-04T18:29:23.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.9633",
            "source": "Simply Wall St.",
            "ticker": "JD",
            "title": "Australian Canola Oil Enters JD.com (NasdaqGS:JD) Market Despite 7% Share Price Dip",
            "url": "https://finance.yahoo.com/news/australian-canola-oil-enters-jd-182923337.html"
        },
        {
            "headline": "JD.com (NasdaqGS:JD) recently became the official e-commerce innovation partner for the UEFA Champions League, a high-profile collaboration that enhances its European market engagement through its brand, ochama. This development, coupled with strong financial results, might have contributed to the company's share price increase of 6.89% over the last quarter. JD.com reported a substantial rise in earnings and net income for the year ending December 31, 2024, signaling robust performance. The...",
            "publication_date": "2025-03-10T17:22:11.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.9584",
            "source": "Simply Wall St.",
            "ticker": "JD",
            "title": "JD.com (NasdaqGS:JD) Becomes UEFA Champion League's Official E-Commerce Innovation Partner",
            "url": "https://finance.yahoo.com/news/jd-com-nasdaqgs-jd-becomes-172211889.html"
        },
        {
            "headline": "In a vibrant turn of events, JD.com (NasdaqGS:JD) recently announced its partnership with the UEFA Champions League as the official e-commerce innovation partner, providing exclusive football-related services to fans. This collaborative venture possibly added to investor confidence, alongside the robust earnings report for the fiscal year ending December 2024. JD.com reported a significant increase in net income to CNY 41,359 million from CNY 24,167 million in 2023, amidst approving an annual...",
            "publication_date": "2025-03-18T18:03:28.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.9565",
            "source": "Simply Wall St.",
            "ticker": "JD",
            "title": "JD.com (NasdaqGS:JD) Sees 21% Stock Surge After Net Income Jumps To ¥41B",
            "url": "https://finance.yahoo.com/news/jd-com-nasdaqgs-jd-sees-180328707.html"
        },
        {
            "headline": "As part of today's Market Minute, Madison Mills outlines the top stories of the trading day. Intel (INTC) stock plunges as US–China trade war tensions intensify. Dell Technologies (DELL) stock extends losses as Morgan Stanley (MS) analysts raise concerns about tariff impacts. Chinese tech stocks, like Alibaba (BABA), PDD Holdings (PDD), and JD.com (JD), tumble as China retaliates against Trump's new tariffs. Stay up to date on the latest market action, minute-by-minute, with Yahoo Finance's Market Minute.",
            "publication_date": "2025-04-04T15:16:45.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.6705",
            "source": "Yahoo Finance Video",
            "ticker": "JD",
            "title": "Intel, Dell, Chinese tech stocks fall: Market Minute",
            "url": "https://finance.yahoo.com/video/intel-dell-chinese-tech-stocks-151645306.html"
        },
        {
            "headline": "David Iben put it well when he said, 'Volatility is not a risk we care about. What we care about is avoiding the...",
            "publication_date": "2025-03-31T11:00:11.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.5778",
            "source": "Simply Wall St.",
            "ticker": "JD",
            "title": "JD.com (NASDAQ:JD) Has A Rock Solid Balance Sheet",
            "url": "https://finance.yahoo.com/news/jd-com-nasdaq-jd-rock-110011688.html"
        },
        {
            "headline": "JD.com (JD) has been one of the stocks most watched by Zacks.com users lately. So, it is worth exploring what lies ahead for the stock.",
            "publication_date": "2025-03-25T13:00:12.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.1621",
            "source": "Zacks",
            "ticker": "JD",
            "title": "JD.com, Inc. (JD) is Attracting Investor Attention: Here is What You Should Know",
            "url": "https://finance.yahoo.com/news/jd-com-inc-jd-attracting-130012154.html"
        }
    ],
    "Avg Score": 0.4195722222222222
}