{
    "Important Articles": [
        {
            "headline": "Shares of Lucid Group (NASDAQ: LCID) are climbing on Wednesday.  The luxury electric vehicle (EV) maker's stock gained 3.3% as of 2:47 p.m. ET and was up as much as 9.9% earlier in the day.  It was reported today that the EV start-up is seeing increased interest from former Tesla owners as its second vehicle enters production.",
            "publication_date": "2025-04-01T19:07:00.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.836",
            "source": "Motley Fool",
            "ticker": "LCID",
            "title": "Why Lucid Group Stock Is Soaring Today",
            "url": "https://finance.yahoo.com/news/why-lucid-group-stock-soaring-190700437.html"
        },
        {
            "headline": "Lucid Group (NasdaqGS:LCID) recently reported that it delivered 3,109 vehicles in the first quarter of 2025, while producing 2,212 vehicles and sending an additional 600 to Saudi Arabia for assembly. This announcement coincided with its preliminary earnings guidance projecting revenue between $232 million and $236 million for the quarter, likely influencing the company's 13.21% share price increase over the past month. This positive movement occurred despite broader market declines prompted...",
            "publication_date": "2025-04-03T17:42:09.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.7964",
            "source": "Simply Wall St.",
            "ticker": "LCID",
            "title": "Lucid Group (NasdaqGS:LCID) Delivers 3,109 Vehicles With Revenue Guidance Of US$232M+",
            "url": "https://finance.yahoo.com/news/lucid-group-nasdaqgs-lcid-delivers-174209072.html"
        },
        {
            "headline": "Lucid boosted its factory incentives in the most recent quarter to an average of $12,877 per vehicle from $10,266 in the year-earlier period, Motor Intelligence said.",
            "publication_date": "2025-04-04T14:31:30.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.7845",
            "source": "Automotive News",
            "ticker": "LCID",
            "title": "Lucid Q1 deliveries rise 58% on higher factory incentives",
            "url": "https://finance.yahoo.com/news/lucid-q1-deliveries-rise-58-143130315.html"
        },
        {
            "headline": "Signs of Tesla's (NASDAQ: TSLA) brand crisis are almost everywhere you look.  Over the weekend, more than 200 \"Tesla Takedown\" protests were held across the country as Americans expressed their ire about CEO Elon Musk's project to downsize federal agencies -- which President Donald Trump refers to as the Department of Government Efficiency (DOGE) -- by targeting his company.  Sales in Europe appear to be plunging; registration data showed Tesla sales were down 42% across most of Europe in the first two months of the year.",
            "publication_date": "2025-04-03T14:36:00.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.5423",
            "source": "Motley Fool",
            "ticker": "LCID",
            "title": "Will Tesla's Pain Be This EV Stock's Gain?",
            "url": "https://finance.yahoo.com/news/teslas-pain-ev-stocks-gain-143600614.html"
        },
        {
            "headline": "A tidal wave of ex-Tesla drivers is fueling Lucid's comeback, but massive challenges still threaten the EV underdog's future.",
            "publication_date": "2025-04-01T18:10:11.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.4497",
            "source": "GuruFocus.com",
            "ticker": "LCID",
            "title": "Tesla Owners Are Jumping Ship -- And Lucid Just Hit the Jackpot",
            "url": "https://finance.yahoo.com/news/tesla-owners-jumping-ship-lucid-181011650.html"
        },
        {
            "headline": "EV maker tops expectations with 3,109 deliveries, but remains down over 20% year to date despite recent gains",
            "publication_date": "2025-04-03T14:34:18.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.1037",
            "source": "GuruFocus.com",
            "ticker": "LCID",
            "title": "Lucid Delivers a Q1 Surprise But Stock Struggles to Recover YTD Losses",
            "url": "https://finance.yahoo.com/news/lucid-delivers-q1-surprise-stock-143418547.html"
        }
    ],
    "Avg Score": 0.24058333333333332
}