{
    "importantArticles": [
        {
            "headline": "MARA Holdings (NasdaqCM:MARA) experienced a significant share price movement, rising 13% over the last week. This increase came on the heels of MARA Holdings announcing the appointment of PricewaterhouseCoopers LLP as its new independent registered public accounting firm, succeeding Marcum LLP. Despite the market's modest 1.8% rise during the same period, MARA's performance seems particularly strong, potentially reflecting investor confidence following recent notable earnings growth. This...",
            "publication_date": "2025-03-25T17:48:13.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.9516",
            "source": "Simply Wall St.",
            "ticker": "MARA",
            "title": "MARA Holdings (NasdaqCM:MARA) Sees 13% Rise Following New Auditor Appointment",
            "url": "https://finance.yahoo.com/news/mara-holdings-nasdaqcm-mara-sees-174813922.html"
        },
        {
            "headline": "We recently published a list of 12 Best Bitcoin Stocks To Buy According To Billionaires. In this article, we are going to take a look at where MARA Holdings, Inc. (NASDAQ:MARA) stands against other best bitcoin stocks to invest in. Bitcoin was the top-performing asset of 2024, driven by the launch of new ETFs and […]",
            "publication_date": "2025-03-19T19:27:38.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.8979",
            "source": "Insider Monkey",
            "ticker": "MARA",
            "title": "MARA Holdings (MARA): One of the Best Bitcoin Stocks to Buy According to Billionaires",
            "url": "https://finance.yahoo.com/news/mara-holdings-mara-one-best-192738062.html"
        },
        {
            "headline": "We recently published a list of 13 Best Cryptocurrency Stocks to Buy Now. In this article, we are going to take a look at where MARA Holdings Inc. (NASDAQ:MARA) stands against other best cryptocurrency stocks to buy now. Cryptocurrency stocks are on the move in the aftermath of US President Donald Trump announcing plans for […]",
            "publication_date": "2025-03-14T15:49:24.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.8555",
            "source": "Insider Monkey",
            "ticker": "MARA",
            "title": "Is MARA Holdings Inc. (MARA) the Best Cryptocurrency Stock to Buy Now?",
            "url": "https://finance.yahoo.com/news/mara-holdings-inc-mara-best-154924638.html"
        },
        {
            "headline": "Yahoo Finance Anchor Seana Smith outlines what investors need to know mid-trading session in today's Market Minute. Tesla (TSLA) stock tumbles on weak European sales data, sending the electric vehicle (EV) maker's market capitalization below $1 trillion and leading the \"Magnificient Seven\" into correction territory. At Apple's (AAPL) annual shareholder meeting, investors voted to maintain the iPhone maker's diversity, equity, and inclusion (DEI) initiatives amid political pressure from the Trump administration. Bitcoin (BTC-USD) hit its lowest point in three months, dragging crypto stocks like Coinbase (COIN), Riot (RIOT), and MARA Holdings (MARA) lower. Stay up to date on the latest market action, minute-by-minute, with Yahoo Finance's Market Minute. This post was written by Naomi Buchanan.",
            "publication_date": "2025-02-25T17:16:50.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.875",
            "source": "Yahoo Finance Video",
            "ticker": "MARA",
            "title": "Tesla, Apple's DEI vote, bitcoin declines: Market Minute",
            "url": "https://finance.yahoo.com/video/tesla-apples-dei-vote-bitcoin-171650837.html"
        },
        {
            "headline": "We recently compiled a list of the 10 Firms Suffer Steep Downfall on Monday. In this article, we are going to take a look at where MARA Holdings, Inc. (NASDAQ:MARA) stands against the other stocks. Ten companies kicked off Monday’s trading in a bloodbath, mirroring the broader market pessimism, with valuations slashed by double digits mostly […]",
            "publication_date": "2025-03-11T18:27:09.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.7845",
            "source": "Insider Monkey",
            "ticker": "MARA",
            "title": "Why MARA Holdings, Inc. (MARA) Crashed on Monday",
            "url": "https://finance.yahoo.com/news/why-mara-holdings-inc-mara-182709450.html"
        },
        {
            "headline": "As bitcoin, ethereum and other cryptocurrencies get increasing attention from investors, Wall Street and its traditional banks continue to adjust to the shift. Catch up on this week’s top stories highlighting the intersection of these old guard and new school areas of finance with this recap compiled by The Fly. BINANCE FOUNDER DENIES REPORT ON TRUMP TALKS: On Thursday, The Wall Street Journal’s Rebecca Ballhaus, Patricia Kowsmann, Angus Berwick, Josh Dawsey and Caitlin Ostroff reported that rep",
            "publication_date": "2025-03-15T13:51:05.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.4084",
            "source": "TipRanks",
            "ticker": "MARA",
            "title": "Crypto Currents: Binance founder denies report on Trump talks",
            "url": "https://finance.yahoo.com/news/crypto-currents-binance-founder-denies-135105365.html"
        }
    ],
    "avgScore": 0.1817421052631579,
    "todayPctChange": 0.022192018696163076,
    "vScore": 0.40332241978800376
}