{
    "importantArticles": [
        {
            "headline": "It wasn't that long ago that Nio (NYSE: NIO) seemed poised to post a breakout fourth quarter.  It had a good third quarter when it improved vehicle margins amid a challenging environment, and it had launched yet another brand, Firefly, that was positioned to drive the top line even higher throughout 2025.  One of the largest reasons to buy into Nio's vision was that the previously mentioned new brands are set to drive deliveries higher and thus generate strong revenue growth.",
            "publication_date": "2025-04-05T12:45:00.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.9501",
            "source": "Motley Fool",
            "ticker": "NIO",
            "title": "What in the World Happened to Nio?",
            "url": "https://finance.yahoo.com/news/world-happened-nio-124500218.html"
        },
        {
            "headline": "NEO Battery Materials Ltd. has entered a collaboration agreement with Elementium Materials Inc. to enhance NEO's silicon battery platform using advanced electrolyte technology. This partnership aims to improve battery stability and electrochemical performance, particularly in ultra-fast charging and discharging, by leveraging Elementium's advanced electrolytes. The collaboration is expected to benefit high-demand markets such as power tools, humanoid robots, drones, and aerospace systems,...",
            "publication_date": "2025-04-02T12:07:11.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.9022",
            "source": "Simply Wall St.",
            "ticker": "NIO",
            "title": "Electric Vehicles Today - Battery Leap: NEO and Elementium's High-Performance Collaboration",
            "url": "https://finance.yahoo.com/news/electric-vehicles-today-battery-leap-120711145.html"
        },
        {
            "headline": "On Monday, Chinese electric vehicle company XPeng Inc (NYSE:XPEV) announced its vehicle delivery results for March and the first quarter of 2025. In March, XPeng delivered 33,205 Smart EVs, implying a 268% growth, surpassing 30,000 units for the fifth consecutive month. For the first quarter of 2025, XPeng delivered 94,008 Smart EVs, a 331% increase over last year. Also Read: Alibaba, BMW Team Up To Bring AI-Powered Smart Assistant In Next-Gen China Cars On March 13, 2025, at its Spring 2025 Lau",
            "publication_date": "2025-04-01T11:21:32.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.9001",
            "source": "Benzinga",
            "ticker": "NIO",
            "title": "China's XPeng Clocks Record Q1 EV Sales, Deliveries Surge 3.6X",
            "url": "https://finance.yahoo.com/news/chinas-xpeng-clocks-record-q1-112132970.html"
        },
        {
            "headline": "Nio (NYSE: NIO) is a fast-growing company looking to capitalize on China's growing electric vehicle (EV) market.  It has carved out a niche in the industry with its battery swap business.  Pricing wars have put pressure on margins, and the ongoing trade tensions in the U.S. and Europe weigh heavily on the business.",
            "publication_date": "2025-03-29T08:19:00.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.7783",
            "source": "Motley Fool",
            "ticker": "NIO",
            "title": "Should You Buy Nio While It's Below $6?",
            "url": "https://finance.yahoo.com/news/buy-nio-while-below-6-081900030.html"
        },
        {
            "headline": "The major averages were sharply lower again near noon, continuing yesterday’s post-tariff slide. China has retaliated with additional tariffs of 34% on all U.S. goods a day after the Trump administration imposed its own sweeping levies. Meanwhile, the latest U.S. jobs data show that nonfarm payrolls rose by a higher-than-forecast 228,000 jobs, though the unemployment rate has ticked higher. Looking to commodities, oil prices are sharply lower due to a planned output increase promised by OPEC+ as",
            "publication_date": "2025-04-05T16:10:32.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.6808",
            "source": "TipRanks",
            "ticker": "NIO",
            "title": "China announces retaliatory tariffs, U.S. unemployment rises: Morning Buzz",
            "url": "https://finance.yahoo.com/news/china-announces-retaliatory-tariffs-u-161032836.html"
        },
        {
            "headline": "Stock index futures are experiencing early declines amid investor apprehension surrounding President Donald Trump’s impending “Liberation Day” tariffs, set to be introduced tomorrow. In the commodities market, gold prices have surged to new record highs as investors seek safe-haven assets amid escalating trade tensions. Spot gold briefly surpassed $3,170 per ounce, highlighting the prevailing market anxiety. ​Meanwhile, oil prices have exhibited modest gains. Investors are closely monitoring dev",
            "publication_date": "2025-04-02T12:56:06.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.5267",
            "source": "TipRanks",
            "ticker": "NIO",
            "title": "Morning Movers: Johnson & Johnson slips after rejection of Talc case settlement",
            "url": "https://finance.yahoo.com/news/morning-movers-johnson-johnson-slips-125606830.html"
        }
    ],
    "avgScore": 0.18291,
    "todayPctChange": -0.030855576928144186,
    "vScore": -0.5643793575926852
}