{
    "Important Articles": [
        {
            "headline": "NIKE (NYSE:NKE) has been actively engaging in share buybacks, indicative of its effort to boost shareholder value by repurchasing 6.5 million shares recently. However, this focus on long-term value didn't prevent the company from experiencing a significant price decline of 15.5% over the past week, amid broader market turmoil stemming from escalating global trade tensions. The imposition of reciprocal tariffs by the Trump administration, particularly affecting manufacturing partners in key...",
            "publication_date": "2025-04-04T17:58:36.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.8786",
            "source": "Simply Wall St.",
            "ticker": "NKE",
            "title": "NIKE (NYSE:NKE) Sees 16% Weekly Dip As Trade Tensions Raise Costs",
            "url": "https://finance.yahoo.com/news/nike-nyse-nke-sees-16-175836391.html"
        },
        {
            "headline": "Nike (NYSE: NKE) stock managed to post gains Friday despite another big sell-off for the broader market.  Stocks sold off again today as investors assessed the unfolding outlook on tariffs, but Nike was able to close the day in the green thanks to what could be a key development on that front.  President Trump said that he had a productive call on tariffs with Vietnam's leaders, and investors are hoping that could open the door for the footwear and apparel giant to see mitigated headwinds.",
            "publication_date": "2025-04-04T22:47:54.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.85",
            "source": "Motley Fool",
            "ticker": "NKE",
            "title": "Why Nike Stock Rose in a Brutal Day for the Market",
            "url": "https://finance.yahoo.com/news/why-nike-stock-rose-brutal-224754451.html"
        },
        {
            "headline": "Shares of Nike (NYSE: NKE), the world's most popular shoe and apparel brand, dropped 15% earlier this week but have recovered some of these losses as of noon ET on Friday, according to data provided by S&P Global Market Intelligence.  Now down 9% across the week, Nike initially declined on Thursday after the president's tariffs targeted three countries responsible for the majority of the company's manufacturing.  Here's what happened earlier this week and why Nike's shares have rallied somewhat today.",
            "publication_date": "2025-04-04T16:58:31.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.84",
            "source": "Motley Fool",
            "ticker": "NKE",
            "title": "Why Nike Stock Plummeted 15% Earlier This Week -- but Is Now Rebounding",
            "url": "https://finance.yahoo.com/news/why-nike-stock-plummeted-15-165831003.html"
        },
        {
            "headline": "(Bloomberg) -- The retail traders who have stormed the markets in recent years were among the only investors buying on Thursday as US stocks had their worst day since June 2020.Most Read from BloombergHousing Agency Aims to Relocate Its DC HeadquartersMetro-North Is Faster Than Acela on NYC-New Haven Route After Signal UpdatesLocal Governments Vie for Fired Federal WorkersLondon Clears Final Hurdle for More High-Speed Trains to EuropeWhat Would ‘Transportation Abundance’ Look Like?Small investor",
            "publication_date": "2025-04-03T20:38:38.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.8126",
            "source": "Bloomberg",
            "ticker": "NKE",
            "title": "Retail Traders Step In to Buy as Others Flee in Tariff Rout",
            "url": "https://finance.yahoo.com/news/retail-traders-step-buy-others-203838411.html"
        },
        {
            "headline": "(Bloomberg) -- Apple Inc. is finding itself squarely in the crosshairs of President Donald Trump’s new tariffs, even after a yearslong effort to insulate the iPhone maker from trade wars and supply chain disruptions.Most Read from BloombergMetro-North Is Faster Than Acela on NYC-New Haven Route After Signal UpdatesHousing Agency Aims to Relocate Its DC HeadquartersLocal Governments Vie for Fired Federal WorkersLondon Clears Final Hurdle for More High-Speed Trains to EuropeWhat Would ‘Transportat",
            "publication_date": "2025-04-03T20:22:03.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.7845",
            "source": "Bloomberg",
            "ticker": "NKE",
            "title": "Apple Production Hubs Hit by Tariffs, Sending Stock Plunging",
            "url": "https://finance.yahoo.com/news/apple-shares-slide-tariffs-threaten-210739852.html"
        },
        {
            "headline": "(Bloomberg) -- Roughly $2.5 trillion was erased from the S&P 500 Index on Thursday amid worries that President Donald Trump’s sweeping new round of tariffs could plunge the economy into a recession.Most Read from BloombergHousing Agency Aims to Relocate Its DC HeadquartersMetro-North Is Faster Than Acela on NYC-New Haven Route After Signal UpdatesLocal Governments Vie for Fired Federal WorkersLondon Clears Final Hurdle for More High-Speed Trains to EuropeWhat Would ‘Transportation Abundance’ Loo",
            "publication_date": "2025-04-03T20:13:46.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.7269",
            "source": "Bloomberg",
            "ticker": "NKE",
            "title": "Trump Tariffs Wipe Out $2.5 Trillion From US Stock Market",
            "url": "https://finance.yahoo.com/news/trump-tariffs-set-wipe-nearly-120038363.html"
        }
    ],
    "Avg Score": 0.026620000000000008
}