{
    "importantArticles": [
        {
            "headline": "President Donald Trump stated in a post to Truth Social: “Just had a very productive call with To Lam, General Secretary of the Communist Party of Vietnam, who told me that Vietnam wants to cut their Tariffs down to ZERO if they are able to make an agreement with the U.S. I thanked him on behalf of our Country, and said I look forward to a meeting in the near future.” Analysts have highlighted that reciprocal tariffs came in “worse than anticipated across-the-board,” with Vietnam most meaningful",
            "publication_date": "2025-04-05T15:10:54.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.8908",
            "source": "TipRanks",
            "ticker": "NKE",
            "title": "Trump says had ‘very productive call’ with Vietnam leadership about tariffs",
            "url": "https://finance.yahoo.com/news/trump-says-had-very-productive-151054225.html"
        },
        {
            "headline": "NIKE (NYSE:NKE) has been actively engaging in share buybacks, indicative of its effort to boost shareholder value by repurchasing 6.5 million shares recently. However, this focus on long-term value didn't prevent the company from experiencing a significant price decline of 15.5% over the past week, amid broader market turmoil stemming from escalating global trade tensions. The imposition of reciprocal tariffs by the Trump administration, particularly affecting manufacturing partners in key...",
            "publication_date": "2025-04-04T17:58:36.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.8786",
            "source": "Simply Wall St.",
            "ticker": "NKE",
            "title": "NIKE (NYSE:NKE) Sees 16% Weekly Dip As Trade Tensions Raise Costs",
            "url": "https://finance.yahoo.com/news/nike-nyse-nke-sees-16-175836391.html"
        },
        {
            "headline": "Nike (NYSE: NKE) stock managed to post gains Friday despite another big sell-off for the broader market.  Stocks sold off again today as investors assessed the unfolding outlook on tariffs, but Nike was able to close the day in the green thanks to what could be a key development on that front.  President Trump said that he had a productive call on tariffs with Vietnam's leaders, and investors are hoping that could open the door for the footwear and apparel giant to see mitigated headwinds.",
            "publication_date": "2025-04-04T22:47:54.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.85",
            "source": "Motley Fool",
            "ticker": "NKE",
            "title": "Why Nike Stock Rose in a Brutal Day for the Market",
            "url": "https://finance.yahoo.com/news/why-nike-stock-rose-brutal-224754451.html"
        },
        {
            "headline": "(Bloomberg) -- The S&P 500 Index declined to the lowest level in 11 months, slashing $5.4 trillion in market value in just two sessions as Federal Reserve Chairman Jerome Powell said the Trump administration’s tariffs “could have a persistent impact on inflation.”Most Read from BloombergHousing Agency Aims to Relocate Its DC HeadquartersLocal Governments Vie for Fired Federal WorkersMetro-North Is Faster Than Acela on NYC-New Haven Route After Signal UpdatesWhat Would ‘Transportation Abundance’",
            "publication_date": "2025-04-04T20:26:32.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.7096",
            "source": "Bloomberg",
            "ticker": "NKE",
            "title": "US Stock Market Wipes Out Over $5 Trillion on Trump’s Tariff War",
            "url": "https://finance.yahoo.com/news/us-stock-market-wipes-over-202632831.html"
        },
        {
            "headline": "Stocks (^GSPC,&nbsp;^IXIC,&nbsp;^DJI)&nbsp; are plummeting as concerns about trade wars grow. The Nasdaq Composite, led by drops in major tech companies like Tesla (TSLA), Nvidia (NVDA), and Apple (AAPL), is nearing bear market territory. Retailers Nike (NKE) and Lululemon (LULU) are seeing their stocks rise after President Trump held discussions with Vietnam about lowering tariffs. Meanwhile, DuPont (DD) is under pressure as China launches an antitrust investigation into the company. Stay up to date on the latest market action, minute-by-minute, with Yahoo Finance's Market Minute.",
            "publication_date": "2025-04-04T17:16:45.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.6486",
            "source": "Yahoo Finance Video",
            "ticker": "NKE",
            "title": "Tech tumbles, retail rises, China's DuPont probe: Market Minute",
            "url": "https://finance.yahoo.com/video/tech-tumbles-retail-rises-chinas-171645876.html"
        },
        {
            "headline": "A global tariff war is heating up, and here's what could be next.",
            "publication_date": "2025-04-04T21:37:00.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.5994",
            "source": "TheStreet",
            "ticker": "NKE",
            "title": "Billionaire Bill Ackman delivers frank 3-word message on tariff war",
            "url": "https://finance.yahoo.com/news/billionaire-bill-ackman-delivers-frank-213700285.html"
        }
    ],
    "avgScore": 0.10951250000000001,
    "todayPctChange": 0.08904109937017579,
    "vScore": 0.9751113394776378
}