{
    "Important Articles": [
        {
            "headline": "Press ReleaseNokia and Amazon sign patent agreement Agreement covers the use of Nokia’s video technologies in Amazon’s streaming services and streaming devices.All patent litigation between the parties resolved. 31 March 2025Espoo, Finland – Nokia today announced it has signed a patent agreement with Amazon covering the use of Nokia’s video technologies in Amazon’s streaming services and devices. The agreement resolves all patent litigation between the parties, in all jurisdictions. The terms –",
            "publication_date": "2025-03-31T09:00:00.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.9607",
            "source": "GlobeNewswire",
            "ticker": "NOK",
            "title": "Nokia and Amazon sign patent agreement",
            "url": "https://finance.yahoo.com/news/nokia-amazon-sign-patent-agreement-090000593.html"
        },
        {
            "headline": "Press Release Nokia recognized as a Visionary in 2025 GartnerÒ Magic Quadrant™ for Data Center Switching Nokia solution recognized for Completeness of Vision and Ability to Execute in new research published by GartnerNokia data center switching solutions are designed to deliver the superior reliability, ease-of-use and adaptability required for modern data center operations 3 April 2025Espoo, Finland – Nokia today announced it has been named by Gartner as a Visionary in the 2025 Magic Quadrant f",
            "publication_date": "2025-04-03T15:05:00.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.9485",
            "source": "GlobeNewswire",
            "ticker": "NOK",
            "title": "Nokia recognized as a Visionary in 2025 GartnerÒ Magic Quadrant™ for Data Center Switching",
            "url": "https://finance.yahoo.com/news/nokia-recognized-visionary-2025-gartner-150500378.html"
        },
        {
            "headline": "Press ReleaseNokia strengthens industrial digitalization with new edge applications Expansion of on-prem edge industrial application portfolio enhances industry automation, efficiency, safety, security, and sustainability of industrial enterprises.Underscores Nokia’s commitment to fostering an open and interoperable industrial edge ecosystem. 27 March 2025 Espoo, Finland – Nokia today announced the expansion of its industrial application ecosystem with the launch of six new Industry 4.0 applicat",
            "publication_date": "2025-03-27T08:00:00.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.9062",
            "source": "GlobeNewswire",
            "ticker": "NOK",
            "title": "Nokia strengthens industrial digitalization with new edge applications",
            "url": "https://finance.yahoo.com/news/nokia-strengthens-industrial-digitalization-edge-080000026.html"
        },
        {
            "headline": "We recently compiled a list of the 10 Best Stocks Under $10 to Buy Now. In this article, we are going to take a look at where Nokia Oyj (NYSE:NOK) stands against the other stocks under $10. On March 28, Friday, US stocks declined as Wall Street continued to struggle with President Trump’s trade war […]",
            "publication_date": "2025-03-31T21:18:28.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.25",
            "source": "Insider Monkey",
            "ticker": "NOK",
            "title": "Is Nokia Oyj (NOK) The Best Stock Under $10 to Buy Now?",
            "url": "https://finance.yahoo.com/news/nokia-oyj-nok-best-stock-211828438.html"
        },
        {
            "headline": "Nokia Corporation Stock Exchange Release20 March 2025 at 18:00 EET Nokia provides recast comparative quarterly financial information reflecting the transfer of Managed Services business from Cloud and Network Services to Mobile NetworksNokia today provided recast comparative financial information for Mobile Networks and Cloud and Network Services segments for Q1-Q4 2024 reflecting the transfer of the Managed Services business. Managed Services business transferred from Cloud and Network Services",
            "publication_date": "2025-03-20T16:00:00.000Z",
            "sentiment": "Neutral",
            "sentimentScore": "0.0",
            "source": "GlobeNewswire",
            "ticker": "NOK",
            "title": "Nokia provides recast comparative quarterly financial information reflecting the transfer of Managed Services business from Cloud and Network Services to Mobile Networks",
            "url": "https://finance.yahoo.com/news/nokia-provides-recast-comparative-quarterly-160000765.html"
        },
        {
            "headline": "NOK expands collaboration with Bharti Airtel to expedite 5G service delivery in key regions of India.",
            "publication_date": "2025-04-03T17:05:00.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.1027",
            "source": "Zacks",
            "ticker": "NOK",
            "title": "Will the Expanded Collaboration With Bharti Airtel Benefit Nokia?",
            "url": "https://finance.yahoo.com/news/expanded-collaboration-bharti-airtel-benefit-170500379.html"
        }
    ],
    "Avg Score": 0.5893600000000002
}