{
    "importantArticles": [
        {
            "headline": "The 9th Annual FinTech Breakthrough Awards have highlighted the ongoing advancements in the FinTech sector, with a strong emphasis on digital payments and related technologies. This year's awards showcase innovations that are shaping the digital payment landscape, such as embedded finance, artificial intelligence, and blockchain. These technologies are driving enhanced user experiences and operational efficiencies, reflecting the industry's rapid evolution. As demand for seamless digital...",
            "publication_date": "2025-03-24T12:07:26.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.926",
            "source": "Simply Wall St.",
            "ticker": "NU",
            "title": "This Week In Digital Payment - FinTech Innovations Shaping Future Financial Services",
            "url": "https://finance.yahoo.com/news/week-digital-payment-fintech-innovations-120726508.html"
        },
        {
            "headline": "Nu Holdings (NYSE:NU) recently reported its full-year 2024 earnings, showcasing significant growth with net interest income increasing by approximately $2.4 billion, and net income more than doubling from the previous year. The company's basic and diluted EPS also saw substantial improvements, reflecting a strong enhancement in shareholder value. Despite a broadly challenging market, with major indices experiencing declines amid geopolitical uncertainties and new tariffs announced on...",
            "publication_date": "2025-03-29T17:25:06.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.9073",
            "source": "Simply Wall St.",
            "ticker": "NU",
            "title": "Nu Holdings (NYSE:NU) Shows Resilience With Net Income Doubling Despite Market Challenges",
            "url": "https://finance.yahoo.com/news/nu-holdings-nyse-nu-shows-172506298.html"
        },
        {
            "headline": "We recently published a list of 10 Best Foreign Stocks to Buy According to Billionaires. In this article, we are going to take a look at where Nu Holdings Ltd. (NYSE:NU) stands against other best foreign stocks to invest in. The global economy demonstrated resilience in 2024, maintaining a steady annualized growth rate of 3.2% […]",
            "publication_date": "2025-04-02T21:27:00.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.9001",
            "source": "Insider Monkey",
            "ticker": "NU",
            "title": "Nu Holdings Ltd. (NU): Among the Best Foreign Stocks to Buy According to Billionaires",
            "url": "https://finance.yahoo.com/news/nu-holdings-ltd-nu-among-212700808.html"
        },
        {
            "headline": "Admittedly, one can hardly blame investors for losing patience with Roku (NASDAQ: ROKU).  After reaching a closing price of nearly $480 per share in the summer of 2021, Roku went on to lose more than 90% of its value by the end of 2022.  With its mostly neutral platform and wide audience, Roku has become the leading marketplace for streaming services, viewers, and advertisers to find one another.",
            "publication_date": "2025-04-06T08:11:00.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.2516",
            "source": "Motley Fool",
            "ticker": "NU",
            "title": "3 Stocks That Could Turn $1,000 Into $5,000 by 2030",
            "url": "https://finance.yahoo.com/news/3-stocks-could-turn-1-081100710.html"
        },
        {
            "headline": "Nu Holdings Ltd. (NU) reachead $10.59 at the closing of the latest trading day, reflecting a +1.53% change compared to its last close.",
            "publication_date": "2025-04-02T21:50:16.000Z",
            "sentiment": "Neutral",
            "sentimentScore": "0.0",
            "source": "Zacks",
            "ticker": "NU",
            "title": "Nu Holdings Ltd. (NU) Laps the Stock Market: Here's Why",
            "url": "https://finance.yahoo.com/news/nu-holdings-ltd-nu-laps-215016612.html"
        },
        {
            "headline": "Nu and Coupang could eclipse the Bitcoin hoarder's market cap by early 2027.",
            "publication_date": "2025-03-30T11:45:00.000Z",
            "sentiment": "Neutral",
            "sentimentScore": "0.0",
            "source": "Motley Fool",
            "ticker": "NU",
            "title": "Prediction: These 2 Stocks Will Be Worth More Than Strategy 2 Years From Now",
            "url": "https://finance.yahoo.com/news/prediction-2-stocks-worth-more-114500760.html"
        }
    ],
    "avgScore": 0.448705,
    "todayPctChange": -0.023409623073929707,
    "vScore": -1.050401492138763
}