{
    "4 24 2025": {
        "importantArticles": [
            {
                "headline": "Nvidia (NASDAQ: NVDA) and AMD (NASDAQ: AMD) are two of the biggest providers of artificial intelligence (AI) computing hardware, but Nvidia is much larger and more successful than AMD in this regard.  Nvidia's CEO and co-founder, Jensen Huang, invented the GPU in 1999, and AMD also makes GPUs.  This makes them ideal for workloads that need intense computing power, like AI.",
                "publication_date": "2025-04-24T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9516",
                "source": "Motley Fool",
                "ticker": "NVDA",
                "title": "Nasdaq Bear Market: Is AMD or Nvidia the Best Buy Now?",
                "url": "https://finance.yahoo.com/news/nasdaq-bear-market-amd-nvidia-111500576.html"
            },
            {
                "headline": "Nvidia partner Vertiv's (NYSE: VRT) stock rose by as much as 21% in early morning trading as the company's first-quarter earnings report confirmed that there's nothing wrong with demand for data center equipment.  The report contained plenty of positives, and Vertiv continues to offer investors an excellent way to get exposure to AI-led demand for data center capacity.  The two major pluses from the earnings report this morning were the hike in full-year sales guidance and the return to impressive yearly order growth.",
                "publication_date": "2025-04-24T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9459",
                "source": "Motley Fool",
                "ticker": "NVDA",
                "title": "Here's Why Data Center Equipment Company Vertiv's Stock Soared Today",
                "url": "https://finance.yahoo.com/news/heres-why-data-center-equipment-163300494.html"
            },
            {
                "headline": "Pat Gelsinger, the former CEO of Intel Corp. (NASDAQ:INTC), expressed admiration for Nvidia Corp. (NASDAQ:NVDA) and its superior performance in the artificial intelligence chip market. What Happened: Gelsinger praised Nvidia’s ability in an interview ...",
                "publication_date": "2025-04-24T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9393",
                "source": "Benzinga",
                "ticker": "NVDA",
                "title": "Nvidia CEO Jensen Huang Earns Praise From Former Intel CEO Pat Gelsinger: 'Run Hard To Stay In The Front'",
                "url": "https://finance.yahoo.com/news/nvidia-ceo-jensen-huang-earns-180107979.html"
            },
            {
                "headline": "Nvidia (NASDAQ: NVDA) has faced its share of negative news in recent weeks, from a halt on its exports to China to uncertainty about tariffs on imports into the U.S. of its chips.  Nvidia, after soaring 800% over the past two years, has slipped 26% since the start of the year.  The U.S. recently informed Nvidia that it would need a license to continue selling its chips to China -- meaning the company can't fulfill current orders, and the company said it would take a $5.5 billion charge.",
                "publication_date": "2025-04-24T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.7435",
                "source": "Motley Fool",
                "ticker": "NVDA",
                "title": "AWS Just Delivered Great News for Nvidia Shareholders",
                "url": "https://finance.yahoo.com/news/aws-just-delivered-great-news-101200456.html"
            },
            {
                "headline": "Two investors who appeared together on an episode of CNBC’s Fast Money last week both expressed pessimism about Nvidia (NVDA) stock and urged investors to sell the shares of the chip maker. Guy Adami and Dan Nathan both had very negative takes on the chip giant’s outlook. Adami is the Director of Advisor Advocacy at […]",
                "publication_date": "2025-04-24T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.6478",
                "source": "Insider Monkey",
                "ticker": "NVDA",
                "title": "Why Two CNBC Panelists Were Very Bearish on Nvidia (NVDA) Stock",
                "url": "https://finance.yahoo.com/news/why-two-cnbc-panelists-were-163922336.html"
            },
            {
                "headline": "Big Tech stocks surged for a second day, with ‘Magnificent Seven’ firms adding $455 billion to their market capitalizations Wednesday as the Trump administration hinted at a deescalation of the US-China trade war.",
                "publication_date": "2025-04-24T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5994",
                "source": "Yahoo Finance",
                "ticker": "NVDA",
                "title": "Big Tech stocks gain over $450 billion as Trump, Bessent signal deescalation of US-China trade war",
                "url": "https://finance.yahoo.com/news/big-tech-stocks-gain-over-450-billion-as-trump-bessent-signal-deescalation-of-us-china-trade-war-143427595.html"
            }
        ],
        "avgScore": 0.31075227272727274,
        "pctChange": -0.0010630646240509338
    },
    "4 23 2025": {
        "importantArticles": [
            {
                "headline": "Nvidia has turned out to be one of the hottest stocks on the market in the past decade, as the company has delivered phenomenal gains of more than 19,700% during this period and bested the S&P 500 index's gains of 156% by a massive margin.  What this means is that an investment of $5,100 made in Nvidia a decade ago is now worth just over a million dollars.  Investors who had the foresight to put this much money into Nvidia 10 years ago and had the patience to hold the stock for such a long time are now sitting on handsome gains, becoming millionaires in the process.",
                "publication_date": "2025-04-23T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8834",
                "source": "Motley Fool",
                "ticker": "NVDA",
                "title": "Should You Forget Nvidia and Buy These 2 Millionaire-Maker Stocks Instead?",
                "url": "https://finance.yahoo.com/news/forget-nvidia-buy-2-millionaire-010000295.html"
            },
            {
                "headline": "CoreWeave shares surged Tuesday as several analysts launched coverage of the artificial intelligence play with price targets suggesting they see gains for the stock.",
                "publication_date": "2025-04-23T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8625",
                "source": "Investopedia",
                "ticker": "NVDA",
                "title": "Nvidia-Backed CoreWeave's Stock Jumps as Analysts Launch Coverage—Here's What They're Saying",
                "url": "https://finance.yahoo.com/news/nvidia-backed-coreweaves-stock-jumps-180534966.html"
            },
            {
                "headline": "Tesla stock rises ahead of the electric-vehicle company’s first-quarter earnings, Boeing is selling certain digital aviation solutions assets in a $10.55 billion deal, GE Aerospace’s profit tops analysts’ estimates, and more customers than expected cancel Verizon contracts.",
                "publication_date": "2025-04-23T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8271",
                "source": "Barrons.com",
                "ticker": "NVDA",
                "title": "These Stocks Moved the Most Today: Tesla, Boeing, Northrop, RTX, 3M, GE Aerospace, Lockheed, Verizon, First Solar, and More",
                "url": "https://finance.yahoo.com/m/f387c034-c0c2-3b9a-9424-f8540135729d/these-stocks-moved-the-most.html"
            },
            {
                "headline": "Investing.com -- Wedbush tech analyst Dan Ives highlighted the urgent need for trade deals to address the challenges facing the US technology sector amid ongoing tariff disputes. The analysts pointed out the significant uncertainty and potential damage to the US and global economies, particularly the US tech industry, which has been thrust into the eye of the storm.",
                "publication_date": "2025-04-23T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5859",
                "source": "Investing.com",
                "ticker": "NVDA",
                "title": "Trade deals are key to halting US tech decline, Wedbush’s Ives says",
                "url": "https://finance.yahoo.com/news/trade-deals-key-halting-us-170908149.html"
            },
            {
                "headline": "We recently published a list of 9 Stocks That Could 10X Over the Next 2 Years. In this article, we are going to take a look at where NVIDIA Corporation (NASDAQ:NVDA) stands against other stocks that could 10X over the next 2 years. US Tariffs and the Stock Market Turmoil While tariffs from the US […]",
                "publication_date": "2025-04-23T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.3612",
                "source": "Insider Monkey",
                "ticker": "NVDA",
                "title": "NVIDIA Corporation (NVDA): Among Stocks That Could 10X Over the Next 2 Years",
                "url": "https://finance.yahoo.com/news/nvidia-corporation-nvda-among-stocks-223043106.html"
            },
            {
                "headline": "U.S. stock markets are in turmoil.  Since the start of the year, the benchmark S&P 500 has plunged by over 11%, and the tech-laden Nasdaq-100 has dropped by over 16%, as of this writing.  High-flying tech stocks, which led the potent bull market over the bulk of 2023 and 2024, have been particularly hard-hit.",
                "publication_date": "2025-04-23T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.3612",
                "source": "Motley Fool",
                "ticker": "NVDA",
                "title": "This High-Powered Vanguard ETF Is an Incredible Bargain Right Now",
                "url": "https://finance.yahoo.com/news/high-powered-vanguard-etf-incredible-090000292.html"
            }
        ],
        "avgScore": 0.3779815789473683,
        "pctChange": 0.006377166635530575
    },
    "4 22 2025": {
        "importantArticles": [
            {
                "headline": "The semiconductor sector is growing rapidly thanks to the rise of artificial intelligence (AI), making it a great area to invest in.  The industry saw 19% year-over-year revenue growth to $627 billion in 2024, and is forecast to hit $981 billion by 2029.  Two giants of the industry to consider investing in are Intel (NASDAQ: INTC) and Nvidia (NASDAQ: NVDA).",
                "publication_date": "2025-04-22T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9246",
                "source": "Motley Fool",
                "ticker": "NVDA",
                "title": "Better Semiconductor Stock: Intel vs. Nvidia",
                "url": "https://finance.yahoo.com/news/better-semiconductor-stock-intel-vs-160000906.html"
            },
            {
                "headline": "We recently published a list of 10 Best Stocks to Buy According to Billionaire Chris Rokos. In this article, we are going to take a look at where NVIDIA Corporation (NASDAQ:NVDA) stands against other best stocks to buy according to billionaire Chris Rokos. Chris Rokos is a highly respected British hedge fund manager who co-founded […]",
                "publication_date": "2025-04-22T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9152",
                "source": "Insider Monkey",
                "ticker": "NVDA",
                "title": "Is NVIDIA Corporation (NVDA) the Best Stock to Buy According to Billionaire Chris Rokos?",
                "url": "https://finance.yahoo.com/news/nvidia-corporation-nvda-best-stock-185509926.html"
            },
            {
                "headline": "Many investors are concerned about the impact that tariffs will have on Nvidia's (NASDAQ: NVDA) stock, but Nvidia has already taken steps to circumvent these tariffs: Its most powerful GPUs will be entirely produced in the U.S. This is a massive win for the country, as some of our most critical products won't need to be sourced from outside our borders.  Nvidia announced that its Blackwell chips, the company's current most powerful graphics processing units (GPUs), will be produced entirely in the U.S. Now, this isn't happening tomorrow, but its production is expected to ramp up in the next 12 to 15 months.  Components for these GPUs will come from Taiwan Semiconductor Manufacturing's (NYSE: TSM) chip facility in Phoenix, Foxconn's facility in Houston, and Wistron's facility in Dallas, with final assembly occurring in Nvidia's plant in Texas.",
                "publication_date": "2025-04-22T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.902",
                "source": "Motley Fool",
                "ticker": "NVDA",
                "title": "Tariff Buster: Nvidia Announces Blackwell GPUs Will Be Made in the U.S. Is the Stock a Buy?",
                "url": "https://finance.yahoo.com/news/tariff-buster-nvidia-announces-blackwell-115500502.html"
            },
            {
                "headline": "Nvidia  stock fell again early Monday as the company remained in the crossfire of escalating U.S.-China trade tensions, even as CEO Jensen Huang did his part to try to mitigate the negative impacts of a trade war.  Nvidia stock has fallen 5.4% to $96.02 Monday while the  has dropped 2.3%, the  has delclined 1.9%, and the  is off 1.9%.  On Monday, Huang met Japanese Prime Minister Shigeru Ishiba, following a meeting with Chinese leaders in Beijing on Thursday.",
                "publication_date": "2025-04-22T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.9153",
                "source": "Barrons.com",
                "ticker": "NVDA",
                "title": "Nvidia Stock Falls. How CEO Jensen Huang Is Trying to Ease Trade War Fears.",
                "url": "https://finance.yahoo.com/m/d0d39255-4607-38cf-9872-1acc7bcbef29/nvidia-stock-falls-how-ceo.html"
            },
            {
                "headline": "Nvidia (NASDAQ: NVDA) just became the latest company to get hit by the trade war.  On Wednesday, the stock tumbled after it announced that it would take a charge of up to $5.5 billion in the first quarter due to a new restriction on exports of its H20 chips to China.  The U.S. has pressured a number of other companies to restrict high-tech exports to China, including EUV lithography machine maker ASML.",
                "publication_date": "2025-04-22T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.8481",
                "source": "Motley Fool",
                "ticker": "NVDA",
                "title": "Nvidia Just Lost a $5.5 Billion Opportunity. This Fast-Growing Tech Stock Could Scoop It Up",
                "url": "https://finance.yahoo.com/news/nvidia-just-lost-5-5-163700684.html"
            },
            {
                "headline": "Nvidia shares were heading for another losing session Monday on worries about how the trade battle between the U.S. and China could impact the chipmaker's results.",
                "publication_date": "2025-04-22T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.7003",
                "source": "Investopedia",
                "ticker": "NVDA",
                "title": "Nvidia Stock Furthers Slide on US-China Trade Tiff",
                "url": "https://finance.yahoo.com/news/nvidia-stock-furthers-slide-us-133910037.html"
            }
        ],
        "avgScore": 0.15892999999999996,
        "pctChange": 0.0386287766043215
    },
    "4 21 2025": {
        "importantArticles": [
            {
                "headline": "Most investors came to know Super Micro as one of the biggest artificial intelligence winners, at least through the first half of last year.  Despite all of this, Super Micro has actually refuted a lot of the allegations against it, and it's also very well positioned to capture the next wave of AI investment.  First, the best news for Super Micro is that its new auditor appears to have cleared its books as accurate, despite the resignation of former auditor Ernst & Young last October.",
                "publication_date": "2025-04-21T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9794",
                "source": "Motley Fool",
                "ticker": "NVDA",
                "title": "Prediction: Super Micro Computer Could Surge by 150% in the Next Year",
                "url": "https://finance.yahoo.com/news/prediction-super-micro-computer-could-080000557.html"
            },
            {
                "headline": "The \"Magnificent Seven\" is a name given to Apple, Microsoft (NASDAQ: MSFT), Nvidia, Amazon, Alphabet, Meta Platforms, and Tesla because of their impact on the market over the past few years.  Unfortunately, the \"Magnificent Seven\" hasn't been so magnificent in recent weeks, with all seven down year to date.  Having the Magnificent Seven stocks slump isn't ideal because they account for a lot of many major indexes (especially the S&P 500), but it does present investors with a good opportunity to buy great companies at a \"discounted\" price.",
                "publication_date": "2025-04-21T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9695",
                "source": "Motley Fool",
                "ticker": "NVDA",
                "title": "1 \"Magnificent Seven\" Stock You'll Regret Not Buying During the Dip",
                "url": "https://finance.yahoo.com/news/1-magnificent-seven-stock-youll-100000028.html"
            },
            {
                "headline": "Shares of Nvidia (NASDAQ: NVDA), the leading maker of artificial intelligence (AI) chips, dropped 8.5% last week, which was a four-day trading week due to the stock market being closed for the Good Friday holiday.  Nvidia stock ended the week priced at $101.49 per share.  For additional context, shares of Nvidia competitor Advanced Micro Devices (AMD) were down 6.3%.",
                "publication_date": "2025-04-21T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.936",
                "source": "Motley Fool",
                "ticker": "NVDA",
                "title": "Nvidia Stock: The Week of April 14-18 in Review",
                "url": "https://finance.yahoo.com/news/nvidia-stock-week-april-14-190000685.html"
            },
            {
                "headline": "Investors have been left scratching their heads after President Trump announced global tariffs on April 2, then put the \"reciprocal\" tariffs with most of the world on pause for 90 days, stepped up a trade war with China, and has since flip-flopped on duties on tariffs on electronics while saying he may pull back tariffs on autos.  While investors may be nervous about the trade war and the increasing risk of a recession, long-term investors know that sell-offs represent buying opportunities as quality businesses just got cheaper.  Investors can't run away from Target (NYSE: TGT) fast enough, it seems.",
                "publication_date": "2025-04-21T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.9042",
                "source": "Motley Fool",
                "ticker": "NVDA",
                "title": "Stock Market Sell-Off: 2 Stocks That Could Double in 2 Years",
                "url": "https://finance.yahoo.com/news/stock-market-sell-off-2-151100432.html"
            },
            {
                "headline": "U.S. stocks are set to open sharply lower Monday as Wall Street braces for a high-stakes week of earnings and mounting geopolitical uncertainty. The S&P 500 was down 1.3%, the Nasdaq fell 1.5%, and the Dow was off more than 400 points.",
                "publication_date": "2025-04-21T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5574",
                "source": "Quartz",
                "ticker": "NVDA",
                "title": "Nvidia slips, Netflix rallies, and Big Tech gets ready for earnings: Stocks to watch today",
                "url": "https://finance.yahoo.com/news/nvidia-slips-netflix-rallies-big-131900713.html"
            },
            {
                "headline": "As the US and China continue their faceoff, companies are caught in the crossfire.",
                "publication_date": "2025-04-21T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "TheStreet",
                "ticker": "NVDA",
                "title": "Popular AI app faces US ban (just like TikTok)",
                "url": "https://finance.yahoo.com/news/white-house-may-ban-popular-134700054.html"
            }
        ],
        "avgScore": 0.430145,
        "pctChange": 0.020431283177354955
    },
    "coef": -0.19999999999999998,
    "avgCoef": 0.01969310235779106,
    "similar": {
        "ERIC": 1.0,
        "VZ": 1.0,
        "ENPH": 1.0,
        "KDP": 1.0
    }
}