{
    "4 17 2025": {
        "importantArticles": [
            {
                "headline": "President Donald Trump credited his tariff policies for driving Nvidia Corp.’s (NASDAQ:NVDA) massive $500 billion commitment to build artificial intelligence infrastructure in the United States during a White House press conference on Monday. What ...",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.875",
                "source": "Benzinga",
                "ticker": "NVDA",
                "title": "Jensen Huang Praised By Trump: Nvidia 'Wouldn't Be Doing' $500 Billion AI Infrastructure Commitment Without Tariffs",
                "url": "https://finance.yahoo.com/news/jensen-huang-praised-trump-nvidia-094532124.html"
            },
            {
                "headline": "Nvidia CEO Jensen Huang said on Thursday that China was a very important market for Nvidia after the U.S. imposed a ban  on sales of its H20 artificial intelligence chips to the country.  \"We hope to continue to cooperate with China,\" Huang said in a meeting with Ren Hongbin, head of the China Council for the Promotion of International Trade, according to Chinese state broadcaster CCTV.  China welcomes more U.S. companies including Nvidia to further explore the Chinese market, vice premier He Lifeng told Huang as the two met at the Great Hall of the People in Beijing on Thursday, state news agency Xinhua reported.",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8748",
                "source": "Reuters",
                "ticker": "NVDA",
                "title": "Nvidia CEO stresses importance of China market in Beijing visit, Chinese state media reports",
                "url": "https://finance.yahoo.com/news/nvidia-ceo-jensen-huang-arrived-073924556.html"
            },
            {
                "headline": "(Reuters) -Wall Street stocks ended mixed on Thursday, lifted by Eli Lilly and Apple, as investors weighed progress in U.S. trade negotiations with Japan against concerns about the interest rate outlook.  Traders leaned toward optimism following U.S. President Donald Trump's comments about \"big progress\" in the bilateral talks after Wednesday's steep selloff.  Trump also told reporters he expects to make a trade deal with China, although he offered no indication of how talks would get underway with the two superpowers at an apparent impasse.",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.872",
                "source": "Reuters",
                "ticker": "NVDA",
                "title": "Wall Street choppy as Eli Lilly jumps, UnitedHealth plummets",
                "url": "https://finance.yahoo.com/news/us-stock-futures-bounce-back-100015027.html"
            },
            {
                "headline": "The major averages were broadly lower near noon, with the Nasdaq down over 300 points amid escalating trade tensions and new export restrictions.​ This follows the U.S. government’s decision to tighten export controls on advanced AI-related computer chips.​ The recent U.S. actions have intensified concerns over a potential trade war. President Donald Trump has announced a new investigation into critical mineral imports and imposed steep tariffs on Chinese imports. In retaliation, China has incre",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.8555",
                "source": "TipRanks",
                "ticker": "NVDA",
                "title": "Nvidia, AMD see charges due to new China export rules: Morning Buzz",
                "url": "https://finance.yahoo.com/news/nvidia-amd-see-charges-due-160543145.html"
            },
            {
                "headline": "We recently published a list of 12 Stocks on Jim Cramer’s Radar Recently. In this article, we are going to take a look at where NVIDIA Corporation (NASDAQ:NVDA) stands against other stocks that on Jim Cramer’s radar recently. On Tuesday, Jim Cramer, host of Mad Money, criticized the market’s reaction, or lack thereof, to the […]",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.7906",
                "source": "Insider Monkey",
                "ticker": "NVDA",
                "title": "Jim Cramer Says NVIDIA (NVDA) Can’t Be Owned Like Before: “You Have to Trim”",
                "url": "https://finance.yahoo.com/news/jim-cramer-says-nvidia-nvda-170211589.html"
            },
            {
                "headline": "Nvidia CEO Lands in China as U.S. AI Chip Ban Threatens $5.5B in Sales",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.7351",
                "source": "GuruFocus.com",
                "ticker": "NVDA",
                "title": "Nvidia's Top Exec in Beijing Amid Rising U.S.-China Chip Tensions",
                "url": "https://finance.yahoo.com/news/nvidias-top-exec-beijing-amid-151127876.html"
            }
        ],
        "avgScore": 0.0902522388059701
    },
    "4 16 2025": {
        "importantArticles": [
            {
                "headline": "Recent market volatility has raised anxiety for some investors, but these are the best opportunities to buy shares of the best growth stocks.  The stocks of growing companies will continue to hit new highs over many years.  You just have to maintain a cool attitude toward market swings and realize that the traders on Wall Street hitting the sell button on negative news are not investing for the long term.",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9674",
                "source": "Motley Fool",
                "ticker": "NVDA",
                "title": "2 Growth Stocks Down 27% or More to Buy Right Now",
                "url": "https://finance.yahoo.com/news/2-growth-stocks-down-27-083700946.html"
            },
            {
                "headline": "Artificial intelligence services at their heart are massive data plays: You need data — a lot of it — to build the models, and then the models need efficient ways to ingest and output data to work. A company called Hammerspace has built a system to help AI and other organizations tap into data troves with minimal heavy lifting, and it’s been seeing impressive adoption. Now, with customers including Meta and the Department of Defense, as well as other very recognizable names, Hammerspace is annou",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9382",
                "source": "TechCrunch",
                "ticker": "NVDA",
                "title": "Hammerspace, an unstructured data wrangler used by Meta, raises $100M at $500M+ valuation",
                "url": "https://finance.yahoo.com/news/hammerspace-unstructured-data-wrangler-used-110000113.html"
            },
            {
                "headline": "In recent years, certain GPU makers like Nvidia have seen their share prices soar.  Intel's management team says it has a plan to reinvigorate growth.  A stock split typically occurs when a company's share price is so high that either investors errantly assume it's \"expensive\" or limit their holdings because they can't afford to buy another whole share.",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9337",
                "source": "Motley Fool",
                "ticker": "NVDA",
                "title": "Reverse Stock-Split Watch: Is Intel Next?",
                "url": "https://finance.yahoo.com/news/reverse-stock-split-watch-intel-130600394.html"
            },
            {
                "headline": "US-China trade war tensions drag US stocks lower after Nvidia (NVDA) reported restrictions on exports to China would cost the chipmaker $5.5 billion. CFRA Research chief investment strategist Sam Stovall joins Morning Brief with Madison Mills and Brad Smith to discuss what the uncertainty means for first quarter earnings and chipmakers' outlooks. To watch more expert insights and analysis on the latest market action, check out more Morning Brief here.",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.9022",
                "source": "Yahoo Finance Video",
                "ticker": "NVDA",
                "title": "'What about Q1 earnings?' US-China trade war weighs on chip stocks",
                "url": "https://finance.yahoo.com/video/q1-earnings-us-china-trade-143923088.html"
            },
            {
                "headline": "(Bloomberg) -- Chinese stocks in Hong Kong snapped a six-day winning streak, as renewed fears of an expanding US-China trade war weighed on sentiment.Most Read from BloombergHow Did This Suburb Figure Out Mass Transit?Trump Signs Executive Orders on Federal Purchasing, Office SpaceLA County Floats Leaner Budget Burdened by Fire and Legal CostsThe Hang Seng China Enterprises Index closed down 2.6% to be among Asia’s worst performers on Wednesday. The mainland benchmark CSI 300 Index ended up 0.3%",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.9001",
                "source": "Bloomberg",
                "ticker": "NVDA",
                "title": "Chinese Stocks Slump in Hong Kong as Trade War Concerns Mount",
                "url": "https://finance.yahoo.com/news/chinese-stocks-slump-hong-kong-081841312.html"
            },
            {
                "headline": "(Reuters) -Global chip stocks were battered on Wednesday on fresh evidence of how U.S. President Donald Trump's shifting trade policy was complicating the outlook for semiconductor and computing giants, including AI pioneer Nvidia and its rival AMD.  Attempts to reorient global trade through tariffs and export curbs have started to show the effect as Nvidia warned of a $5.5 billion hit after Washington restricted exports of its AI processor tailored for China, while Dutch chip-making tools giant ASML raised doubts about its outlook.  The U.S. restriction, which also hit the MI308 processor of Advanced Micro Devices, marked the latest blow for the AI chip trade that is losing steam after a two-year rally as tariff threats and fears over Big Tech's spending weigh on sentiment.",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.8979",
                "source": "Reuters",
                "ticker": "NVDA",
                "title": "Global chipmakers feel the pinch of Trump's shifting trade policy",
                "url": "https://finance.yahoo.com/news/global-chip-stocks-slide-nvidia-110516321.html"
            }
        ],
        "avgScore": 0.011309649122807009
    },
    "4 3 2025": {
        "importantArticles": [
            {
                "headline": "CEO Jensen Huang met Chinese trade officials after the U.S. launched a probe into the company's chip sales.",
                "publication_date": "2025-04-03T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.128",
                "source": "GuruFocus.com",
                "ticker": "NVDA",
                "title": "Nvidia CEO Meets Chinese Officials After U.S. Opens Probe Into Chip Sales",
                "url": "https://finance.yahoo.com/news/nvidia-ceo-meets-chinese-officials-211032755.html"
            },
            {
                "headline": "CEO Jensen Huang met Chinese trade officials after the U.S. launched a probe into the company's chip sales.",
                "publication_date": "2025-04-03T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.128",
                "source": "GuruFocus.com",
                "ticker": "NVDA",
                "title": "Nvidia CEO Meets Chinese Officials After U.S. Opens Probe Into Chip Sales",
                "url": "https://finance.yahoo.com/news/nvidia-ceo-meets-chinese-officials-211032755.html"
            }
        ],
        "avgScore": 0.128
    },
    "3 24 2025": {
        "importantArticles": [
            {
                "headline": "As a volatile market correction rattles Big Tech, Nvidia stock puts the focus on these rules for when to sell stocks.",
                "publication_date": "2025-03-24T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Investor's Business Daily",
                "ticker": "NVDA",
                "title": "Nvidia Stock — Once Again — Puts The 8 'Secrets' Of Selling In Focus",
                "url": "https://finance.yahoo.com/m/0de2c5ec-4d76-3994-a567-02c18b5b2cfc/nvidia-stock-%E2%80%94-once-again-%E2%80%94.html"
            },
            {
                "headline": "As a volatile market correction rattles Big Tech, Nvidia stock puts the focus on these rules for when to sell stocks.",
                "publication_date": "2025-03-24T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Investor's Business Daily",
                "ticker": "NVDA",
                "title": "Nvidia Stock — Once Again — Puts The 8 'Secrets' Of Selling In Focus",
                "url": "https://finance.yahoo.com/m/0de2c5ec-4d76-3994-a567-02c18b5b2cfc/nvidia-stock-%E2%80%94-once-again-%E2%80%94.html"
            }
        ],
        "avgScore": 0.0
    },
    "coef": -0.7999999999999999,
    "avgCoef": 0.006929451712450895,
    "similar": {
        "QXO": 0.7999999999999999,
        "AAL": 0.39999999999999997,
        "MARA": 0.39999999999999997,
        "UAA": 0.316227766016838
    }
}