{
    "4 14 2025": {
        "importantArticles": [
            {
                "headline": "We recently published a list of 10 Best Growth Stocks to Buy According to Billionaires. In this article, we are going to take a look at where NVIDIA Corporation (NASDAQ:NVDA) stands against other best growth stocks to buy according to billionaires. Can the Stock Market Have a Big Rebound? The stock market has been on […]",
                "publication_date": "2025-04-14T18:04:21.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9274",
                "source": "Insider Monkey",
                "ticker": "NVDA",
                "title": "Is NVIDIA Corporation (NVDA) the Best Growth Stock to Buy According to Billionaires?",
                "url": "https://finance.yahoo.com/news/nvidia-corporation-nvda-best-growth-180421994.html"
            },
            {
                "headline": "The stocks in this article have caught Wall Street’s attention in a big way, with price targets implying returns above 20%. But investors should take these forecasts with a grain of salt because analysts typically say nice things about companies so their firms can win business in other product lines like M&A advisory.",
                "publication_date": "2025-04-14T13:01:58.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9209",
                "source": "StockStory",
                "ticker": "NVDA",
                "title": "1 of Wall Street’s Favorite Stock for Long-Term Investors and 2 to Ignore",
                "url": "https://finance.yahoo.com/news/1-wall-street-favorite-stock-130158533.html"
            },
            {
                "headline": "VAST Data has been recognized on the Forbes AI 50 list for 2025, which highlights the most promising private AI companies globally. This listing underscores VAST’s significant role in AI infrastructure, evidenced by its platform being utilized by numerous organizations for AI training and inference operations. The company has been noted for its strong innovation and sustained growth in the competitive AI market. VAST Data’s distributed, internet-scale platform has become integral to...",
                "publication_date": "2025-04-14T11:37:24.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9184",
                "source": "Simply Wall St.",
                "ticker": "NVDA",
                "title": "AI Chips Update - VAST Data Shines on Forbes AI 50 List 2025",
                "url": "https://finance.yahoo.com/news/ai-chips-vast-data-shines-113724303.html"
            },
            {
                "headline": "NOW's near-term results are expected to suffer from unfavorable forex and sluggish Agentic AI revenues despite a strong portfolio and rich partner base.",
                "publication_date": "2025-04-14T19:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.6488",
                "source": "Zacks",
                "ticker": "NVDA",
                "title": "ServiceNow Dips 26% Year to Date: Hold or Fold the NOW Stock?",
                "url": "https://finance.yahoo.com/news/servicenow-dips-26-date-hold-190000771.html"
            },
            {
                "headline": "(Bloomberg) -- President Donald Trump’s administration pressed forward with plans to impose tariffs on semiconductor and pharmaceutical imports by initiating trade probes led by the Commerce Department. Most Read from BloombergHow Did This Suburb Figure Out Mass Transit?The Secret Formula for Faster TrainsEven Oslo Has an Air Quality ProblemNYC Tourist Helicopter Crashes in Hudson River, Killing SixLisbon Mayor Wants Companies to Help Fix City’s Housing ShortageThe moves, announced Monday in the",
                "publication_date": "2025-04-14T21:24:22.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5994",
                "source": "Bloomberg",
                "ticker": "NVDA",
                "title": "Trump Initiates Chips and Drug Probes Ahead of More Tariffs",
                "url": "https://finance.yahoo.com/news/trump-announces-chips-drug-probes-204108780.html"
            },
            {
                "headline": "Nvidia has found itself in the crosshairs of an escalating trade war between Washington and Beijing.",
                "publication_date": "2025-04-14T13:21:44.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5994",
                "source": "TheStreet",
                "ticker": "NVDA",
                "title": "Nvidia stock leaps after massive U.S. investment surprise",
                "url": "https://finance.yahoo.com/news/nvidia-stock-leaps-massive-u-132144386.html"
            }
        ],
        "avgScore": 0.2760142857142858
    },
    "4 11 2025": {
        "importantArticles": [
            {
                "headline": "In a period marked by significant market volatility, with the Dow Jones Industrial Average and Nasdaq experiencing sharp declines, investors are keenly observing opportunities that may arise from these fluctuations. Amidst this turbulence, identifying stocks potentially trading below their estimated value becomes crucial for those looking to make informed investment decisions.",
                "publication_date": "2025-04-11T11:38:06.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7783",
                "source": "Simply Wall St.",
                "ticker": "NVDA",
                "title": "3 Stocks Possibly Trading Below Their Estimated Value",
                "url": "https://finance.yahoo.com/news/3-stocks-possibly-trading-below-113806714.html"
            },
            {
                "headline": "South Korean AI hardware startup FuriosaAI has made waves in the global semiconductor industry after reportedly turning down an $800 million acquisition offer from Meta (NASDAQ:META). The decision shows the startup's ambition to remain independent and compete directly in the rapidly evolving AI chip market dominated by NVIDIA (NASDAQ:NVDA) and increasingly encroached on by tech giants like Alphabet (NASDAQ:GOOGL, GOOG)) and Microsoft (NASDAQ:MSFT). Don't Miss: Hasbro, MGM, and Skechers trust thi",
                "publication_date": "2025-04-11T23:02:22.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7387",
                "source": "Benzinga",
                "ticker": "NVDA",
                "title": "FuriosaAI Turns Down Meta's $800M Bid To Go Rogue With RNGD, As AI Chip War Between Nvidia, Google, And Meta Heats Up",
                "url": "https://finance.yahoo.com/news/furiosaai-turns-down-metas-800m-230222314.html"
            },
            {
                "headline": "Tariffs crushed NVIDIA and Broadcom this year, but which stock is now a great deal for investors?",
                "publication_date": "2025-04-11T19:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.6956",
                "source": "Zacks",
                "ticker": "NVDA",
                "title": "Which AI Stock, NVIDIA or Broadcom, Is the Better Bargain to Buy?",
                "url": "https://finance.yahoo.com/news/ai-stock-nvidia-broadcom-better-190000358.html"
            },
            {
                "headline": "Investing.com -- Citi has trimmed its earnings and sales forecasts for both Nvidia (NASDAQ:NVDA) and Marvell Technology (NASDAQ:MRVL), pointing to lower cloud capital expenditure (capex) expectations and persistent macro uncertainty stemming from trade tensions.",
                "publication_date": "2025-04-11T11:07:33.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.743",
                "source": "Investing.com",
                "ticker": "NVDA",
                "title": "Nvidia, Marvell targets cut at Citi amid macro uncertainty",
                "url": "https://finance.yahoo.com/news/nvidia-marvell-targets-cut-citi-110733892.html"
            },
            {
                "headline": "With the Nasdaq Composite in bear market territory (marked by the index falling more than 20% from its all-time high), there is some panic in the market.  Investors are worried about the effect of tariffs on the consumer and would rather be in more conservative investments than artificial intelligence (AI) stocks, which have more upside but with more risk.  Anyone selling right now has a one-year time frame in mind, rather than the three- to five-year time frame that individual investors should have.",
                "publication_date": "2025-04-11T11:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.6236",
                "source": "Motley Fool",
                "ticker": "NVDA",
                "title": "Nasdaq Bear Market: 3 No-Brainer Artificial Intelligence (AI) Stocks to Buy in April",
                "url": "https://finance.yahoo.com/news/nasdaq-bear-market-3-no-110000820.html"
            },
            {
                "headline": "Nvidia, Marvell Forecasts Cuts by Citi on AI Capex Slowdown and Tariff Fears",
                "publication_date": "2025-04-11T14:26:10.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.6124",
                "source": "GuruFocus.com",
                "ticker": "NVDA",
                "title": "Nvidia, Marvell Face Fresh Cloud Investment Risks as Citi Cuts Outlook",
                "url": "https://finance.yahoo.com/news/nvidia-marvell-face-fresh-cloud-142610273.html"
            }
        ],
        "avgScore": 0.06832187500000003
    },
    "4 10 2025": {
        "importantArticles": [
            {
                "headline": "Runway AI, a generative video startup based in New York, has just secured more than $300 million in funding. General Atlantic led the round with support from key-name backers such as Nvidia (NASDAQ:NVDA), Fidelity Management & Research Company, Baillie Gifford, and SoftBank Vision Fund 2, according to Seeking Alpha. This new funding raises Runway’s valuation to $3 billion, Bloomberg reported. The investment showcases strong investor confidence in AI-generated media as a promising frontier for in",
                "publication_date": "2025-04-10T15:46:39.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9403",
                "source": "Benzinga",
                "ticker": "NVDA",
                "title": "Runway AI Secures $300M From Nvidia And Fidelity To Revolutionize Film With Gen-4 Model And Studio Deals Raising Its Valuation To $3B",
                "url": "https://finance.yahoo.com/news/runway-ai-secures-300m-nvidia-154639843.html"
            },
            {
                "headline": "The \"Magnificent Seven\" has long since dominated markets (^GSPC,&nbsp;^IXIC,&nbsp;^DJI) and investor focus, but that dominance may not last forever. Northwestern Mutual Wealth Management Company chief investment officer Brent Schutte joins Morning Brief to discuss the importance of diversifying investments and the likelihood that new leaders will emerge in the market in the coming years. To watch more expert insights and analysis on the latest market action, check out more Morning Brief&nbsp;here.",
                "publication_date": "2025-04-10T15:30:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9042",
                "source": "Yahoo Finance Video",
                "ticker": "NVDA",
                "title": "Get diversified: 'Mag 7 will no longer be the Mag 7' in 5 years",
                "url": "https://finance.yahoo.com/video/diversified-mag-7-no-longer-153000531.html"
            },
            {
                "headline": "We recently published a list of Long-Term Stock Portfolio: 15 Best Stocks for 15 Years. In this article, we are going to take a look at where NVIDIA Corporation (NASDAQ:NVDA) stands against other best stocks for 15 years. Russell Investments believes that 3 features are defining the market outlook for 2025. These include the elevated […]",
                "publication_date": "2025-04-10T22:07:41.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8555",
                "source": "Insider Monkey",
                "ticker": "NVDA",
                "title": "Is NVIDIA Corporation (NVDA) the Best Stock for 15 Years?",
                "url": "https://finance.yahoo.com/news/nvidia-corporation-nvda-best-stock-220741421.html"
            },
            {
                "headline": "Broadcom, Nvidia, and peers slump as renewed trade fears raise uncertainty over supply chains and earnings guidance",
                "publication_date": "2025-04-10T18:00:58.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.6369",
                "source": "GuruFocus.com",
                "ticker": "NVDA",
                "title": "Chip Stocks Reverse Rally as Trade Fears Resurface",
                "url": "https://finance.yahoo.com/news/chip-stocks-reverse-rally-trade-180058307.html"
            },
            {
                "headline": "The U.S. reversed a proposed ban on NVIDIA's AI chip H20, which had targeted high-bandwidth memory exports to China.",
                "publication_date": "2025-04-10T19:33:07.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5574",
                "source": "GuruFocus.com",
                "ticker": "NVDA",
                "title": "U.S. Lifts NVIDIA Chip Ban, Easing Strain on Samsung and SK Hynix",
                "url": "https://finance.yahoo.com/news/u-lifts-nvidia-chip-ban-193307862.html"
            },
            {
                "headline": "We recently published a list of Jim Cramer Calls Market Decline ‘Man-Made’ and Breaks Down 15 Stocks. In this article, we are going to take a look at where NVIDIA Corporation (NASDAQ:NVDA) stands against other stocks that Jim Cramer discusses. On Monday, April 7th, Jim Cramer opened the Mad Money episode with a message of […]",
                "publication_date": "2025-04-10T15:49:45.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.4939",
                "source": "Insider Monkey",
                "ticker": "NVDA",
                "title": "NVIDIA (NVDA) — Jim Cramer Pleads: “This Is the Highest Quality Company in the World”",
                "url": "https://finance.yahoo.com/news/nvidia-nvda-jim-cramer-pleads-154945963.html"
            }
        ],
        "avgScore": 0.330131914893617
    },
    "4 9 2025": {
        "importantArticles": [
            {
                "headline": "Investment bank TD Cowen lowered its price target on Nvidia (NVDA) stock to $140 from $175 today but kept a Buy rating on the shares. NVDA Has Many Positive Attributes, TD Cowen Says The chip maker should be boosted by its strong technology, while the firm’s long-term outlook is positive, according to the investment bank. […]",
                "publication_date": "2025-04-09T17:24:21.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9684",
                "source": "Insider Monkey",
                "ticker": "NVDA",
                "title": "Investment Bank Cuts NVDA Price Target But Remains Bullish on the Name",
                "url": "https://finance.yahoo.com/news/investment-bank-cuts-nvda-price-172421178.html"
            },
            {
                "headline": "The recently-battered Magnificent Seven stocks got some much-needed relief in the form of Trump's tariff pause. Tesla shares climbed more than 17%, while Nvidia and Meta shares also notched double-digit gains.",
                "publication_date": "2025-04-09T18:20:39.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9153",
                "source": "The Wall Street Journal",
                "ticker": "NVDA",
                "title": "Tariff Pause Sends Tech Stocks Soaring",
                "url": "https://finance.yahoo.com/m/de60ddd8-40af-347b-affc-0f999091928e/tariff-pause-sends-tech.html"
            },
            {
                "headline": "Tesla shares soared in Wednesday afternoon trading, leading other Magnificent Seven members higher amid a broad relief rally as President Trump announced a 90-day pause on some of the tariffs announced last week.",
                "publication_date": "2025-04-09T20:24:03.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8481",
                "source": "Investopedia",
                "ticker": "NVDA",
                "title": "Tesla, Nvidia Lead Magnificent 7 Stocks Higher as Tech Drives Broad Relief Rally",
                "url": "https://finance.yahoo.com/news/tesla-nvidia-lead-magnificent-7-202403208.html"
            },
            {
                "headline": "President Trump threw out what appeared to be a lifeline to tech companies Wednesday by suspending onerous tariffs that had sent their stocks spiraling downward.  The uncertainty over trade barriers is still rattling Big Tech and the global economy.  Trump’s reprieve pushed  Nvidia’s  stock above where it was before he imposed tariffs last week, but the trade war with China is escalating, not easing, and huge uncertainty remains.",
                "publication_date": "2025-04-09T20:54:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.9307",
                "source": "The Wall Street Journal",
                "ticker": "NVDA",
                "title": "Tariffs Are Still Coming for the AI Boom",
                "url": "https://finance.yahoo.com/m/24eb806e-1e5d-3b58-917b-390720595b5d/tariffs-are-still-coming-for.html"
            },
            {
                "headline": "Stocks wanted one thing from Trump after last week's shocking \"Liberation Day\" announcement. On Wednesday, they got it.",
                "publication_date": "2025-04-09T20:31:45.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.4019",
                "source": "Yahoo Finance",
                "ticker": "NVDA",
                "title": "US stocks stage historic rally as Trump's 90-day pause takes worst case scenario 'off the table'",
                "url": "https://finance.yahoo.com/news/us-stocks-stage-historic-rally-as-trumps-90-day-pause-takes-worst-case-scenario-off-the-table-203145671.html"
            },
            {
                "headline": "The White House has paused plans to restrict sales of Nvidia H20 chips to Chinese firms, NPR reported Wednesday.",
                "publication_date": "2025-04-09T22:19:46.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.3818",
                "source": "Investopedia",
                "ticker": "NVDA",
                "title": "Trump Pauses Plans to Curb Nvidia H20 Chip Sales to Chinese Firms, Report Says",
                "url": "https://finance.yahoo.com/news/trump-pauses-plans-curb-nvidia-221946504.html"
            }
        ],
        "avgScore": 0.21403333333333333
    },
    "coef": -0.6000000000000001,
    "avgCoef": 0.2221565919801814
}