{
    "4 17 2025": {
        "importantArticles": [
            {
                "headline": "Artificial intelligence services at their heart are massive data plays: You need data — a lot of it — to build the models, and then the models need efficient ways to ingest and output data to work. A company called Hammerspace has built a system to help AI and other organizations tap into data troves with minimal heavy lifting, and it’s been seeing impressive adoption. Now, with customers including Meta and the Department of Defense, as well as other very recognizable names, Hammerspace is annou",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9382",
                "source": "TechCrunch",
                "ticker": "NVDA",
                "title": "Hammerspace, an unstructured data wrangler used by Meta, raises $100M at $500M+ valuation",
                "url": "https://finance.yahoo.com/news/hammerspace-unstructured-data-wrangler-used-110000113.html"
            },
            {
                "headline": "In recent years, certain GPU makers like Nvidia have seen their share prices soar.  Intel's management team says it has a plan to reinvigorate growth.  A stock split typically occurs when a company's share price is so high that either investors errantly assume it's \"expensive\" or limit their holdings because they can't afford to buy another whole share.",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9337",
                "source": "Motley Fool",
                "ticker": "NVDA",
                "title": "Reverse Stock-Split Watch: Is Intel Next?",
                "url": "https://finance.yahoo.com/news/reverse-stock-split-watch-intel-130600394.html"
            },
            {
                "headline": "President Donald Trump credited his tariff policies for driving Nvidia Corp.’s (NASDAQ:NVDA) massive $500 billion commitment to build artificial intelligence infrastructure in the United States during a White House press conference on Monday. What ...",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.875",
                "source": "Benzinga",
                "ticker": "NVDA",
                "title": "Jensen Huang Praised By Trump: Nvidia 'Wouldn't Be Doing' $500 Billion AI Infrastructure Commitment Without Tariffs",
                "url": "https://finance.yahoo.com/news/jensen-huang-praised-trump-nvidia-094532124.html"
            },
            {
                "headline": "US-China trade war tensions drag US stocks lower after Nvidia (NVDA) reported restrictions on exports to China would cost the chipmaker $5.5 billion. CFRA Research chief investment strategist Sam Stovall joins Morning Brief with Madison Mills and Brad Smith to discuss what the uncertainty means for first quarter earnings and chipmakers' outlooks. To watch more expert insights and analysis on the latest market action, check out more Morning Brief here.",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.9022",
                "source": "Yahoo Finance Video",
                "ticker": "NVDA",
                "title": "'What about Q1 earnings?' US-China trade war weighs on chip stocks",
                "url": "https://finance.yahoo.com/video/q1-earnings-us-china-trade-143923088.html"
            },
            {
                "headline": "(Reuters) -Global chip stocks were battered on Wednesday on fresh evidence of how U.S. President Donald Trump's shifting trade policy was complicating the outlook for semiconductor and computing giants, including AI pioneer Nvidia and its rival AMD.  Attempts to reorient global trade through tariffs and export curbs have started to show the effect as Nvidia warned of a $5.5 billion hit after Washington restricted exports of its AI processor tailored for China, while Dutch chip-making tools giant ASML raised doubts about its outlook.  The U.S. restriction, which also hit the MI308 processor of Advanced Micro Devices, marked the latest blow for the AI chip trade that is losing steam after a two-year rally as tariff threats and fears over Big Tech's spending weigh on sentiment.",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.8979",
                "source": "Reuters",
                "ticker": "NVDA",
                "title": "Global chipmakers feel the pinch of Trump's shifting trade policy",
                "url": "https://finance.yahoo.com/news/global-chip-stocks-slide-nvidia-110516321.html"
            },
            {
                "headline": "Investors now consider a trade war to be the biggest threat to the stock market, according to a Bank of America survey of global fund managers.",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.8074",
                "source": "Barrons.com",
                "ticker": "NVDA",
                "title": "China Could Be Willing to Enter Trade Talks, Report Says. Here’s the Latest on Tariffs.",
                "url": "https://finance.yahoo.com/m/ecfe4afd-f277-3693-bb56-5e424ac784bf/china-could-be-willing-to.html"
            }
        ],
        "avgScore": 0.04644824561403508
    },
    "4 16 2025": {
        "importantArticles": [
            {
                "headline": "The scramble to build compute capacity for artificial intelligence (AI) models and training has enriched longtime Nvidia (NASDAQ: NVDA) shareholders.  Large tech companies have been sharply increasing capital spending to build data centers and fill them with powerful servers, largely using Nvidia's products.  Retail investors and hedge fund managers alike piled into Nvidia shares over the past few years.",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7964",
                "source": "Motley Fool",
                "ticker": "NVDA",
                "title": "Prediction: Nvidia Stock Will Beat the Market. Here's Why.",
                "url": "https://finance.yahoo.com/news/prediction-nvidia-stock-beat-market-095000193.html"
            },
            {
                "headline": "Initial rollout will be an AI data centre in Rimouski, Que., equipped with 500 Nvidia Hopper GPUs",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Financial Post",
                "ticker": "NVDA",
                "title": "Telus stakes claim in Canada's AI race with plans for Nvidia-powered data centres",
                "url": "https://finance.yahoo.com/news/telus-stakes-claim-canadas-ai-100008466.html"
            },
            {
                "headline": "The company said it had been informed by US authorities that the H20 chip will now require a licence for export to China “for the indefinite future.”",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Verdict",
                "ticker": "NVDA",
                "title": "Nvidia warns of $5.5bn write-down as US tightens export curbs",
                "url": "https://finance.yahoo.com/news/nvidia-warns-5-5bn-writedown-094045155.html"
            },
            {
                "headline": "Tech stocks are leading Wall Street lower as new export restriction take the U.S-China trade war to a new and damaging level.",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.8885",
                "source": "TheStreet",
                "ticker": "NVDA",
                "title": "Stock Market Today: Stocks tumble as Powell adds to trade war concerns",
                "url": "https://finance.yahoo.com/news/stock-market-today-stocks-slide-095909363.html"
            },
            {
                "headline": "The escalating U.S.-China trade war has expanded and moved beyond tariffs, now hitting everything from chips to planes and pharma.  * Shares fell in Asia on Wednesday as AI darling Nvidia took a hit from U.S. curbs on chip sales to China, highlighting the damage to come in a tit-for-tat global trade war, while gold hit a record and the safe-haven currencies jumped.  * Nvidia did not warn at least some major customers in advance about new U.S. export rules it was told about a week ago requiring it to obtain licenses to sell its China-focused artificial intelligence chip, according to two sources familiar with the matter.",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.362",
                "source": "Reuters",
                "ticker": "NVDA",
                "title": "Morning Bid: US-China trade war goes full throttle",
                "url": "https://finance.yahoo.com/news/morning-bid-us-china-trade-103633010.html"
            },
            {
                "headline": "NEW YORK (Reuters) -U.S. stocks ended sharply lower on Wednesday as Nvidia warned about steep charges from new U.S. curbs on its chip exports to China and Federal Reserve Chair Jerome Powell said U.S. economic growth appears to be slowing.  Powell, in remarks for the Economic Club of Chicago, said larger-than-expected tariffs likely mean higher inflation and slower growth.  The Fed chair's afternoon comments sparked further selling in stocks, which had already been under pressure from a sharp drop in shares of Nvidia and other chipmakers.",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.3182",
                "source": "Reuters",
                "ticker": "NVDA",
                "title": "Indexes drop as Fed's Powell says growth appears to be slowing; Nvidia tumbles",
                "url": "https://finance.yahoo.com/news/us-stock-futures-drop-nvidia-093523048.html"
            }
        ],
        "avgScore": -0.14935714285714283
    },
    "coef": 0.9999999999999999,
    "avgCoef": -0.02100051497857836,
    "similar": {
        "NVDA": 0.9999999999999999,
        "INTC": 0.9999999999999999,
        "ABEV": 0.9999999999999999,
        "LCID": NaN
    }
}