{
    "4 24 2025": {
        "importantArticles": [
            {
                "headline": "Nvidia (NASDAQ: NVDA) and AMD (NASDAQ: AMD) are two of the biggest providers of artificial intelligence (AI) computing hardware, but Nvidia is much larger and more successful than AMD in this regard.  Nvidia's CEO and co-founder, Jensen Huang, invented the GPU in 1999, and AMD also makes GPUs.  This makes them ideal for workloads that need intense computing power, like AI.",
                "publication_date": "2025-04-24T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9516",
                "source": "Motley Fool",
                "ticker": "NVDA",
                "title": "Nasdaq Bear Market: Is AMD or Nvidia the Best Buy Now?",
                "url": "https://finance.yahoo.com/news/nasdaq-bear-market-amd-nvidia-111500576.html"
            },
            {
                "headline": "NVIDIA (NasdaqGS:NVDA) advanced 1.20% last week. The company remains in focus with the recent expansion of its partnership with Cerence Inc. to enhance automotive user experiences through new AI capabilities. This development coincides with the recent rally in the broader tech market led by chipmakers, as evidenced by gains in other semiconductor stocks like Broadcom. Overall, an optimistic atmosphere in the tech sector, propelled by strong earnings reports and positive market sentiment,...",
                "publication_date": "2025-04-24T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9337",
                "source": "Simply Wall St.",
                "ticker": "NVDA",
                "title": "NVIDIA (NasdaqGS:NVDA) Powers Cerence's Next-Gen Automotive AI with MediaTek Partnership",
                "url": "https://finance.yahoo.com/news/nvidia-nasdaqgs-nvda-powers-cerences-174353458.html"
            },
            {
                "headline": "Despite the fanfare, the artificial intelligence (AI) revolution has just begun.  Companies like Nvidia have already taken advantage of this growth, soaring to multitrillion-dollar market caps.  Over time, however, we could see one of these stocks surpass Nvidia's market cap, leading to huge gains for patient shareholders.",
                "publication_date": "2025-04-24T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9169",
                "source": "Motley Fool",
                "ticker": "NVDA",
                "title": "Prediction: 2 Artificial Intelligence (AI) Stocks That Could Be Worth More Than Nvidia by 2030",
                "url": "https://finance.yahoo.com/news/prediction-2-artificial-intelligence-ai-223000088.html"
            },
            {
                "headline": "Nvidia (NASDAQ: NVDA) has faced its share of negative news in recent weeks, from a halt on its exports to China to uncertainty about tariffs on imports into the U.S. of its chips.  Nvidia, after soaring 800% over the past two years, has slipped 26% since the start of the year.  The U.S. recently informed Nvidia that it would need a license to continue selling its chips to China -- meaning the company can't fulfill current orders, and the company said it would take a $5.5 billion charge.",
                "publication_date": "2025-04-24T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.7435",
                "source": "Motley Fool",
                "ticker": "NVDA",
                "title": "AWS Just Delivered Great News for Nvidia Shareholders",
                "url": "https://finance.yahoo.com/news/aws-just-delivered-great-news-101200456.html"
            },
            {
                "headline": "Nvidia faces restrictions on exports to China but negotiations could reduce fears over sector-specific levies on imported semiconductors.",
                "publication_date": "2025-04-24T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5719",
                "source": "Barrons.com",
                "ticker": "NVDA",
                "title": "Nvidia Stock Climbs. It’s Headed for Its 3rd Straight Day of Gains.",
                "url": "https://finance.yahoo.com/m/34a126ee-5bf7-3bcc-8896-bf8c1b3d555c/nvidia-stock-climbs-it%E2%80%99s.html"
            },
            {
                "headline": "The Dow Jones Industrial Average (DJINDICES: ^DJI) index started to crack in March, falling 4.2%, with 73% of its 30 blue chip stocks ending the month in the red.  Nike (NYSE: NKE), Walt Disney (NYSE: DIS), and Nvidia (NASDAQ: NVDA) were the worst-performing Dow stocks in March, and they've fallen further this month.  Nike stock plunged 20.1% to multiyear lows in March after reporting a 9%  and 30% drop in revenue and earnings per share (EPS), respectively, for its 2025 fiscal third quarter, which ended Feb. 28, 2025.",
                "publication_date": "2025-04-24T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.34",
                "source": "Motley Fool",
                "ticker": "NVDA",
                "title": "These Were the 3 Worst-Performing Stocks in the Dow Jones Industrial Average in March 2025",
                "url": "https://finance.yahoo.com/news/were-3-worst-performing-stocks-110100226.html"
            }
        ],
        "avgScore": 0.351903125,
        "pctChange": 0.02855764073090301
    },
    "4 23 2025": {
        "importantArticles": [
            {
                "headline": "Nvidia partner Vertiv's (NYSE: VRT) stock rose by as much as 21% in early morning trading as the company's first-quarter earnings report confirmed that there's nothing wrong with demand for data center equipment.  The report contained plenty of positives, and Vertiv continues to offer investors an excellent way to get exposure to AI-led demand for data center capacity.  The two major pluses from the earnings report this morning were the hike in full-year sales guidance and the return to impressive yearly order growth.",
                "publication_date": "2025-04-23T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9459",
                "source": "Motley Fool",
                "ticker": "NVDA",
                "title": "Here's Why Data Center Equipment Company Vertiv's Stock Soared Today",
                "url": "https://finance.yahoo.com/news/heres-why-data-center-equipment-163300494.html"
            },
            {
                "headline": "Pat Gelsinger, the former CEO of Intel Corp. (NASDAQ:INTC), expressed admiration for Nvidia Corp. (NASDAQ:NVDA) and its superior performance in the artificial intelligence chip market. What Happened: Gelsinger praised Nvidia’s ability in an interview ...",
                "publication_date": "2025-04-23T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9393",
                "source": "Benzinga",
                "ticker": "NVDA",
                "title": "Nvidia CEO Jensen Huang Earns Praise From Former Intel CEO Pat Gelsinger: 'Run Hard To Stay In The Front'",
                "url": "https://finance.yahoo.com/news/nvidia-ceo-jensen-huang-earns-180107979.html"
            },
            {
                "headline": "We recently published a list of 20 Best Stock To Buy According to Marjorie Taylor Greene. In this article, we are going to take a look at where NVIDIA Corporation (NASDAQ:NVDA) stands against other best stock to buy according to Marjorie Taylor Greene. Marjorie Taylor Greene is one of the most active members of the […]",
                "publication_date": "2025-04-23T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.908",
                "source": "Insider Monkey",
                "ticker": "NVDA",
                "title": "Ultimate Insider Marjorie Taylor Greene’s #3 Stock Pick: NVIDIA Corporation (NVDA)",
                "url": "https://finance.yahoo.com/news/ultimate-insider-marjorie-taylor-greene-183419971.html"
            },
            {
                "headline": "Two investors who appeared together on an episode of CNBC’s Fast Money last week both expressed pessimism about Nvidia (NVDA) stock and urged investors to sell the shares of the chip maker. Guy Adami and Dan Nathan both had very negative takes on the chip giant’s outlook. Adami is the Director of Advisor Advocacy at […]",
                "publication_date": "2025-04-23T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.6478",
                "source": "Insider Monkey",
                "ticker": "NVDA",
                "title": "Why Two CNBC Panelists Were Very Bearish on Nvidia (NVDA) Stock",
                "url": "https://finance.yahoo.com/news/why-two-cnbc-panelists-were-163922336.html"
            },
            {
                "headline": "Big Tech stocks surged for a second day, with ‘Magnificent Seven’ firms adding $455 billion to their market capitalizations Wednesday as the Trump administration hinted at a deescalation of the US-China trade war.",
                "publication_date": "2025-04-23T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5994",
                "source": "Yahoo Finance",
                "ticker": "NVDA",
                "title": "Big Tech stocks gain over $450 billion as Trump, Bessent signal deescalation of US-China trade war",
                "url": "https://finance.yahoo.com/news/big-tech-stocks-gain-over-450-billion-as-trump-bessent-signal-deescalation-of-us-china-trade-war-143427595.html"
            },
            {
                "headline": "Big Tech is preparing for its first earnings since Trump launched his global trade war.",
                "publication_date": "2025-04-23T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5267",
                "source": "Yahoo Finance",
                "ticker": "NVDA",
                "title": "Big Tech earnings kick off as tariff uncertainty continues to roil markets",
                "url": "https://finance.yahoo.com/news/big-tech-earnings-kick-off-as-tariff-uncertainty-continues-to-roil-markets-160016313.html"
            }
        ],
        "avgScore": 0.3391133333333334,
        "pctChange": 0.036218491421109375
    },
    "4 22 2025": {
        "importantArticles": [
            {
                "headline": "Many investors are concerned about the impact that tariffs will have on Nvidia's (NASDAQ: NVDA) stock, but Nvidia has already taken steps to circumvent these tariffs: Its most powerful GPUs will be entirely produced in the U.S. This is a massive win for the country, as some of our most critical products won't need to be sourced from outside our borders.  Nvidia announced that its Blackwell chips, the company's current most powerful graphics processing units (GPUs), will be produced entirely in the U.S. Now, this isn't happening tomorrow, but its production is expected to ramp up in the next 12 to 15 months.  Components for these GPUs will come from Taiwan Semiconductor Manufacturing's (NYSE: TSM) chip facility in Phoenix, Foxconn's facility in Houston, and Wistron's facility in Dallas, with final assembly occurring in Nvidia's plant in Texas.",
                "publication_date": "2025-04-22T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.902",
                "source": "Motley Fool",
                "ticker": "NVDA",
                "title": "Tariff Buster: Nvidia Announces Blackwell GPUs Will Be Made in the U.S. Is the Stock a Buy?",
                "url": "https://finance.yahoo.com/news/tariff-buster-nvidia-announces-blackwell-115500502.html"
            },
            {
                "headline": "The unbridled optimism for Wall Street's artificial intelligence (AI) darling is starting to sour.",
                "publication_date": "2025-04-22T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.886",
                "source": "Motley Fool",
                "ticker": "NVDA",
                "title": "Prediction: 8 Wall Street Analysts Lowered Nvidia's Price Target Last Week -- and This Is Just the Beginning",
                "url": "https://finance.yahoo.com/news/prediction-8-wall-street-analysts-073600067.html"
            },
            {
                "headline": "CoreWeave shares surged Tuesday as several analysts launched coverage of the artificial intelligence play with price targets suggesting they see gains for the stock.",
                "publication_date": "2025-04-22T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8625",
                "source": "Investopedia",
                "ticker": "NVDA",
                "title": "Nvidia-Backed CoreWeave's Stock Jumps as Analysts Launch Coverage—Here's What They're Saying",
                "url": "https://finance.yahoo.com/news/nvidia-backed-coreweaves-stock-jumps-180534966.html"
            },
            {
                "headline": "Investing.com -- Wedbush tech analyst Dan Ives highlighted the urgent need for trade deals to address the challenges facing the US technology sector amid ongoing tariff disputes. The analysts pointed out the significant uncertainty and potential damage to the US and global economies, particularly the US tech industry, which has been thrust into the eye of the storm.",
                "publication_date": "2025-04-22T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5859",
                "source": "Investing.com",
                "ticker": "NVDA",
                "title": "Trade deals are key to halting US tech decline, Wedbush’s Ives says",
                "url": "https://finance.yahoo.com/news/trade-deals-key-halting-us-170908149.html"
            },
            {
                "headline": "We recently published a list of 10 Jim Cramer Stocks to Buy and Sell Now. In this article, we are going to take a look at where NVIDIA Corporation (NASDAQ:NVDA) stands against other stocks that Jim Cramer discussed. Jim Cramer in a latest program on CNBC talked about President Donald Trump’s attack on Federal Reserve […]",
                "publication_date": "2025-04-22T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.4767",
                "source": "Insider Monkey",
                "ticker": "NVDA",
                "title": "Jim Cramer Says NVIDIA (NVDA) Stock Isn’t Cheap ‘Unless Everything Goes Right’",
                "url": "https://finance.yahoo.com/news/jim-cramer-says-nvidia-nvda-204308499.html"
            },
            {
                "headline": "We recently compiled a list of the 12 AI Stocks on Wall Street’s Radar. In this article, we are going to take a look at where NVIDIA Corporation (NASDAQ:NVDA) stands against the other AI stocks on Wall Street’s radar. Almost 50 House Democrats have signed a message to stop the unauthorized use of AI tools in […]",
                "publication_date": "2025-04-22T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.296",
                "source": "Insider Monkey",
                "ticker": "NVDA",
                "title": "NVIDIA Corporation (NVDA) Price Target Cut to $160 Amid Tariff Uncertainty, Long-Term Growth Intact",
                "url": "https://finance.yahoo.com/news/nvidia-corporation-nvda-price-target-125642195.html"
            }
        ],
        "avgScore": 0.3449428571428571,
        "pctChange": 0.0386287766043215
    },
    "4 21 2025": {
        "importantArticles": [
            {
                "headline": "Most investors came to know Super Micro as one of the biggest artificial intelligence winners, at least through the first half of last year.  Despite all of this, Super Micro has actually refuted a lot of the allegations against it, and it's also very well positioned to capture the next wave of AI investment.  First, the best news for Super Micro is that its new auditor appears to have cleared its books as accurate, despite the resignation of former auditor Ernst & Young last October.",
                "publication_date": "2025-04-21T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9794",
                "source": "Motley Fool",
                "ticker": "NVDA",
                "title": "Prediction: Super Micro Computer Could Surge by 150% in the Next Year",
                "url": "https://finance.yahoo.com/news/prediction-super-micro-computer-could-080000557.html"
            },
            {
                "headline": "The \"Magnificent Seven\" is a name given to Apple, Microsoft (NASDAQ: MSFT), Nvidia, Amazon, Alphabet, Meta Platforms, and Tesla because of their impact on the market over the past few years.  Unfortunately, the \"Magnificent Seven\" hasn't been so magnificent in recent weeks, with all seven down year to date.  Having the Magnificent Seven stocks slump isn't ideal because they account for a lot of many major indexes (especially the S&P 500), but it does present investors with a good opportunity to buy great companies at a \"discounted\" price.",
                "publication_date": "2025-04-21T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9695",
                "source": "Motley Fool",
                "ticker": "NVDA",
                "title": "1 \"Magnificent Seven\" Stock You'll Regret Not Buying During the Dip",
                "url": "https://finance.yahoo.com/news/1-magnificent-seven-stock-youll-100000028.html"
            },
            {
                "headline": "The semiconductor sector is growing rapidly thanks to the rise of artificial intelligence (AI), making it a great area to invest in.  The industry saw 19% year-over-year revenue growth to $627 billion in 2024, and is forecast to hit $981 billion by 2029.  Two giants of the industry to consider investing in are Intel (NASDAQ: INTC) and Nvidia (NASDAQ: NVDA).",
                "publication_date": "2025-04-21T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9246",
                "source": "Motley Fool",
                "ticker": "NVDA",
                "title": "Better Semiconductor Stock: Intel vs. Nvidia",
                "url": "https://finance.yahoo.com/news/better-semiconductor-stock-intel-vs-160000906.html"
            },
            {
                "headline": "Nvidia  stock fell again early Monday as the company remained in the crossfire of escalating U.S.-China trade tensions, even as CEO Jensen Huang did his part to try to mitigate the negative impacts of a trade war.  Nvidia stock has fallen 5.4% to $96.02 Monday while the  has dropped 2.3%, the  has delclined 1.9%, and the  is off 1.9%.  On Monday, Huang met Japanese Prime Minister Shigeru Ishiba, following a meeting with Chinese leaders in Beijing on Thursday.",
                "publication_date": "2025-04-21T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.9153",
                "source": "Barrons.com",
                "ticker": "NVDA",
                "title": "Nvidia Stock Falls. How CEO Jensen Huang Is Trying to Ease Trade War Fears.",
                "url": "https://finance.yahoo.com/m/d0d39255-4607-38cf-9872-1acc7bcbef29/nvidia-stock-falls-how-ceo.html"
            },
            {
                "headline": "Nvidia (NASDAQ: NVDA) just became the latest company to get hit by the trade war.  On Wednesday, the stock tumbled after it announced that it would take a charge of up to $5.5 billion in the first quarter due to a new restriction on exports of its H20 chips to China.  The U.S. has pressured a number of other companies to restrict high-tech exports to China, including EUV lithography machine maker ASML.",
                "publication_date": "2025-04-21T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.8481",
                "source": "Motley Fool",
                "ticker": "NVDA",
                "title": "Nvidia Just Lost a $5.5 Billion Opportunity. This Fast-Growing Tech Stock Could Scoop It Up",
                "url": "https://finance.yahoo.com/news/nvidia-just-lost-5-5-163700684.html"
            },
            {
                "headline": "Nvidia shares were heading for another losing session Monday on worries about how the trade battle between the U.S. and China could impact the chipmaker's results.",
                "publication_date": "2025-04-21T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.7003",
                "source": "Investopedia",
                "ticker": "NVDA",
                "title": "Nvidia Stock Furthers Slide on US-China Trade Tiff",
                "url": "https://finance.yahoo.com/news/nvidia-stock-furthers-slide-us-133910037.html"
            }
        ],
        "avgScore": 0.20148000000000013,
        "pctChange": 0.020431283177354955
    },
    "4 7 2025": {
        "importantArticles": [
            {
                "headline": "Investing.com -- Shares of NVIDIA Corporation (NASDAQ:NVDA) and Amazon.com Inc (NASDAQ:AMZN) rose 3.2% and 3% respectively Thursday after executives from both companies pushed back on reports suggesting a slowdown in artificial intelligence infrastructure spending. Speaking at a conference reported on by CNBC, the companies said demand for compute power and data center capacity remains strong, directly addressing recent concerns from investors.",
                "publication_date": "2025-04-07T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8591",
                "source": "Investing.com",
                "ticker": "NVDA",
                "title": "Tech stocks climb as Nvidia, Amazon reject claims of AI buildout slowdown",
                "url": "https://finance.yahoo.com/news/tech-stocks-climb-nvidia-amazon-201842954.html"
            },
            {
                "headline": "Investing.com -- Shares of NVIDIA Corporation (NASDAQ:NVDA) and Amazon.com Inc (NASDAQ:AMZN) rose 3.2% and 3% respectively Thursday after executives from both companies pushed back on reports suggesting a slowdown in artificial intelligence infrastructure spending. Speaking at a conference reported on by CNBC, the companies said demand for compute power and data center capacity remains strong, directly addressing recent concerns from investors.",
                "publication_date": "2025-04-07T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8591",
                "source": "Investing.com",
                "ticker": "NVDA",
                "title": "Tech stocks climb as Nvidia, Amazon reject claims of AI buildout slowdown",
                "url": "https://finance.yahoo.com/news/tech-stocks-climb-nvidia-amazon-201842954.html"
            }
        ],
        "avgScore": 0.8591,
        "pctChange": -0.013723846233787342
    },
    "coef": -0.3,
    "avgCoef": -0.016051700859597184,
    "similar": {
        "BTG": 0.7,
        "PSLV": 0.7,
        "GRAB": 0.6155870112510925,
        "NGD": 0.39999999999999997
    }
}