{
    "importantArticles": [
        {
            "headline": "Occidental Petroleum (NYSE: OXY) is a major player in the energy sector and is one of the United States' top oil and gas producers.  After a banner year in 2022, Occidental strengthened its balance sheet and reduced its debt.  Occidental is perhaps best known as one of Warren Buffett's largest holdings in his Berkshire Hathaway portfolio.",
            "publication_date": "2025-03-30T10:30:00.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.8807",
            "source": "Motley Fool",
            "ticker": "OXY",
            "title": "Should You Buy Occidental Petroleum While It's Below $55?",
            "url": "https://finance.yahoo.com/news/buy-occidental-petroleum-while-below-103000396.html"
        },
        {
            "headline": "HOUSTON, April 01, 2025 (GLOBE NEWSWIRE) -- Occidental (NYSE: OXY) today announced the results of its offer to exercise Occidental’s outstanding publicly traded warrants (the “Warrants”) at a temporarily reduced price of $21.30 per Warrant (the “Offer”). The Offer expired at 5:00 p.m. Eastern Time on March 31, 2025. Based on the final count by Equiniti Trust Company, LLC, the depositary agent for the Offer, 41,941,075 Warrants were tendered and not validly withdrawn (including 69,166 Warrants te",
            "publication_date": "2025-04-01T12:00:00.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.8316",
            "source": "GlobeNewswire",
            "ticker": "OXY",
            "title": "Occidental Announces Results of Offer to Exercise Warrants at a Temporarily Reduced Price",
            "url": "https://finance.yahoo.com/news/occidental-announces-results-offer-exercise-120000880.html"
        },
        {
            "headline": "We recently compiled a list of the 10 Best Gas Stocks to Buy According to Billionaires. In this article, we are going to take a look at where Occidental Petroleum Corporation (NYSE:OXY) stands against the other gas stocks. Energy stocks have performed strongly in 2025 so far and have outpaced the broader markets. Investors seem […]",
            "publication_date": "2025-03-24T16:20:12.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.8126",
            "source": "Insider Monkey",
            "ticker": "OXY",
            "title": "Is Occidental Petroleum Corporation (OXY) The Best Gas Stock to Buy According to Billionaires?",
            "url": "https://finance.yahoo.com/news/occidental-petroleum-corporation-oxy-best-162012251.html"
        },
        {
            "headline": "Occidental Petroleum (NYSE:OXY) experienced a 6% decline over the last month, a movement that may be closely tied to the broader market's reaction to evolving trade tensions and tariff announcements. As the U.S. implemented sweeping tariffs and China retaliated, fears of a global trade war escalated, affecting various sectors, including energy. The market's turbulent period, marked by significant losses in major indices and a 6% drop in energy stocks like Exxon Mobil and Chevron, coincided...",
            "publication_date": "2025-04-04T18:00:24.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.7717",
            "source": "Simply Wall St.",
            "ticker": "OXY",
            "title": "Trade Tensions Weigh On Occidental Petroleum (NYSE:OXY) Stock With 6% Drop Over The Last Month",
            "url": "https://finance.yahoo.com/news/trade-tensions-weigh-occidental-petroleum-180024373.html"
        },
        {
            "headline": "HOUSTON, April 02, 2025 (GLOBE NEWSWIRE) -- Occidental (NYSE: OXY) will announce its first quarter 2025 financial results after close of market on Wednesday, May 7, 2025, and will hold a conference call to discuss the results on Thursday, May 8, 2025, at 1 p.m. Eastern/12 p.m. Central. The conference call may be accessed by calling 1-866-871-6512 (international callers dial 1-412-317-5417) or via webcast at oxy.com/investors. Participants may pre-register for the conference call at https://dpreg",
            "publication_date": "2025-04-02T20:15:00.000Z",
            "sentiment": "Neutral",
            "sentimentScore": "0.0",
            "source": "GlobeNewswire",
            "ticker": "OXY",
            "title": "Occidental to Announce First Quarter Results Wednesday, May 7, 2025; Hold Conference Call Thursday, May 8, 2025",
            "url": "https://finance.yahoo.com/news/occidental-announce-first-quarter-results-201500153.html"
        },
        {
            "headline": "Key Insights Significantly high institutional ownership implies Occidental Petroleum's stock price is sensitive to...",
            "publication_date": "2025-04-02T13:00:23.000Z",
            "sentiment": "Neutral",
            "sentimentScore": "0.0",
            "source": "Simply Wall St.",
            "ticker": "OXY",
            "title": "Occidental Petroleum Corporation (NYSE:OXY) is largely controlled by institutional shareholders who own 49% of the company",
            "url": "https://finance.yahoo.com/news/occidental-petroleum-corporation-nyse-oxy-130023240.html"
        }
    ],
    "avgScore": 0.28431052631578946,
    "todayPctChange": -0.04891493453308284,
    "vScore": -1.3907030781803167
}