{
    "importantArticles": [
        {
            "headline": "TORONTO, March 27, 2025 (GLOBE NEWSWIRE) -- Sprott Inc. (NYSE/TSX: SII) (“Sprott”) on behalf of the Sprott Physical Silver Trust (NYSE Arca/TSX: PSLV) (“PSLV” or the “Trust”) today announced that PSLV’s net asset value (“NAV”) has surpassed US$6 billion. “We would like to thank our unitholders for their trust and support in helping the Sprott Physical Silver Trust reach this significant milestone,” said John Ciampaglia, Chief Executive Officer of Sprott Asset Management. “PSLV provides investors",
            "publication_date": "2025-03-27T21:19:00.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.9779",
            "source": "GlobeNewswire",
            "ticker": "PSLV",
            "title": "Sprott Physical Silver Trust Net Asset Value Reaches $6 Billion",
            "url": "https://finance.yahoo.com/news/sprott-physical-silver-trust-net-211900400.html"
        },
        {
            "headline": "TORONTO, Dec. 06, 2024 (GLOBE NEWSWIRE) -- Sprott Asset Management LP (“Sprott Asset Management”), a subsidiary of Sprott Inc., on behalf of the Sprott Physical Silver Trust (NYSE: PSLV) (TSX: PSLV / PSLV.U) (the “Trust”), a closed-ended mutual fund trust created to invest and hold substantially all of its assets in physical silver bullion, today announced that it has added additional sales agents to its at-the-market equity program to issue up to US$1 billion of units of the Trust (“Units”) in",
            "publication_date": "2024-12-07T00:02:00.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.9485",
            "source": "GlobeNewswire",
            "ticker": "PSLV",
            "title": "Sprott Physical Silver Trust Updates Its “At-the-Market” Equity Program",
            "url": "https://finance.yahoo.com/news/sprott-physical-silver-trust-updates-000200887.html"
        },
        {
            "headline": "The global transition to alternative energy should power up silver prices given the metal’s inclusion in various clean energy technologies. That industrial-precious metal component offers investors the opportunity to obtain exposure to an asset that serves both purposes. The metal’s application in electric and solar power technology will add a growth factor as nations look [...]",
            "publication_date": "2024-04-11T17:17:47.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.9153",
            "source": "ETF Trends",
            "ticker": "PSLV",
            "title": "Alternative Energy Demand Should Power Up Silver Prices",
            "url": "https://finance.yahoo.com/news/alternative-energy-demand-power-silver-171747765.html"
        },
        {
            "headline": "Gold hit new highs this week amid rising geopolitical tensions and as the US interest rate cutting cycle got under way.",
            "publication_date": "2024-09-27T05:00:05.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.0516",
            "source": "Yahoo Finance UK",
            "ticker": "PSLV",
            "title": "The top gold funds to invest in as prices soar",
            "url": "https://finance.yahoo.com/news/gold-best-funds-invest-price-050005044.html"
        },
        {
            "headline": "With uncertainties still present and the potential of an overreaction by the market, investing in commodity ETFs with exposure to metals like gold, copper, silver and uranium is a smart strategy to reduce portfolio volatility.",
            "publication_date": "2024-09-09T18:43:00.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.2732",
            "source": "Zacks",
            "ticker": "PSLV",
            "title": "Why Commodity ETFs Are Smart Investments in Today's Market",
            "url": "https://finance.yahoo.com/news/why-commodity-etfs-smart-investments-184300073.html"
        },
        {
            "headline": "Palm Valley Capital Management, an investment management firm, released the “Palm Valley Capital Fund” fourth quarter 2024 investor letter. A copy of the letter can be downloaded here. In the fourth quarter, Palm Valley Capital Fund declined -0.09% outperforming the -0.58% decline in the S&P SmallCap 600 and slightly underperforming the 0.32% gain in the […]",
            "publication_date": "2025-01-08T12:56:44.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.5267",
            "source": "Insider Monkey",
            "ticker": "PSLV",
            "title": "Top Contributor of Palm Valley Capital Fund in 2024: Sprott Physical Silver Trust (PSLV)",
            "url": "https://finance.yahoo.com/news/top-contributor-palm-valley-capital-125644538.html"
        }
    ],
    "avgScore": 0.6101142857142857,
    "todayPctChange": -0.03556187740984771,
    "vScore": -2.169680943456823
}