{
    "importantArticles": [
        {
            "headline": "In recent developments, Rigetti Computing (NasdaqCM:RGTI) announced its participation in DARPA's Quantum Benchmarking Initiative, a move that aligns with its strategic goals to advance quantum computing. This announcement comes amidst Rigetti's performance figures showing a slight 4% increase in its stock price over the past month, a period marked by significant volatility in broader markets. Despite a weak fourth-quarter earnings report revealing a substantial increase in net loss, the...",
            "publication_date": "2025-04-04T18:44:25.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.7435",
            "source": "Simply Wall St.",
            "ticker": "RGTI",
            "title": "Rigetti Computing (NasdaqCM:RGTI) Selected For US$1M DARPA Quantum Benchmarking Initiative",
            "url": "https://finance.yahoo.com/news/rigetti-computing-nasdaqcm-rgti-selected-184425845.html"
        },
        {
            "headline": "QBTS emerges as a strong investment opportunity in 2025, driven by its recent groundbreaking achievements.",
            "publication_date": "2025-04-03T19:00:00.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.7269",
            "source": "Zacks",
            "ticker": "RGTI",
            "title": "D-Wave Quantum Surges 38% in March: Is QBTS a Smart Buy Now?",
            "url": "https://finance.yahoo.com/news/d-wave-quantum-surges-38-190000579.html"
        },
        {
            "headline": "The objective of DARPA’s QBI program is to verify and validate that quantum computing can achieve utility-scale operation by 2033.BERKELEY, Calif., April 03, 2025 (GLOBE NEWSWIRE) -- Rigetti Computing, Inc. (Nasdaq: RGTI) (“Rigetti” or the “Company”), a pioneer in full-stack quantum-classical computing, announced today that it was selected to participate in the Defense Advanced Research Projects Agency (DARPA) Quantum Benchmarking Initiative (QBI). The primary goal of QBI is to determine if any",
            "publication_date": "2025-04-03T20:05:00.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.6124",
            "source": "GlobeNewswire",
            "ticker": "RGTI",
            "title": "Rigetti Computing Selected to Participate in DARPA’s Quantum Benchmarking Initiative",
            "url": "https://finance.yahoo.com/news/rigetti-computing-selected-participate-darpa-200500173.html"
        },
        {
            "headline": "We recently published a list of Jim Cramer Was Talking About These 10 Stocks Amid Trump’s Trade Wars. In this article, we are going to take a look at where Rigetti Computing, Inc. (NASDAQ:RGTI) stands against other stocks that Jim Cramer was talking about amid Trump’s trade wars. Jim Cramer in a latest program on […]",
            "publication_date": "2025-04-04T21:52:39.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.802",
            "source": "Insider Monkey",
            "ticker": "RGTI",
            "title": "Jim Cramer on Rigetti Computing (RGTI): ‘It’s a Meme Stock’",
            "url": "https://finance.yahoo.com/news/jim-cramer-rigetti-computing-rgti-215239484.html"
        },
        {
            "headline": "Quantum computing stocks are having a moment.  Following Alphabet's revelation of its Willow quantum chip in December, quantum computing stocks including Rigetti Computing (NASDAQ: RGTI) soared, and attention has remained on the sector as Microsoft and Nvidia have made their own announcements about quantum computing.  Rigetti Computing is still a development-stage company, as it brought in just $10.8 million in revenue in 2024 and an operating loss of $68.5 million.",
            "publication_date": "2025-03-28T08:37:00.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.3182",
            "source": "Motley Fool",
            "ticker": "RGTI",
            "title": "Prediction: 2 Stocks That Will Be Worth More Than Rigetti Computing 1 Year From Now",
            "url": "https://finance.yahoo.com/news/prediction-2-stocks-worth-more-083700980.html"
        },
        {
            "headline": "This quantum computing stock still looks too hot to handle.",
            "publication_date": "2025-04-05T15:41:00.000Z",
            "sentiment": "Neutral",
            "sentimentScore": "0.0",
            "source": "Motley Fool",
            "ticker": "RGTI",
            "title": "Is Rigetti Computing Stock a Buy Now?",
            "url": "https://finance.yahoo.com/news/rigetti-computing-stock-buy-now-154100624.html"
        }
    ],
    "avgScore": 0.1492625,
    "todayPctChange": -0.02723735889856678,
    "vScore": -0.4065516282597324
}