{
    "Important Articles": [
        {
            "headline": "Rigetti Computing (NasdaqCM:RGTI) recently announced its Q4 2024 earnings, revealing a sales decline to $2.27 million and a substantial rise in net loss to $153 million, impacting investor confidence. This financial backdrop may have contributed to Rigetti's share price decline of 16% over the last month, a period during which major indexes like the Nasdaq managed to reverse their multi-week losses. The company's private placement generating $35 million, while potentially reassuring in terms...",
            "publication_date": "2025-03-23T17:12:00.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.7579",
            "source": "Simply Wall St.",
            "ticker": "RGTI",
            "title": "Rigetti Computing (NasdaqCM:RGTI) Sees 16% Share Price Decline In Last Month After US$153M Net Loss",
            "url": "https://finance.yahoo.com/news/rigetti-computing-nasdaqcm-rgti-sees-171200320.html"
        },
        {
            "headline": "In recent developments, Rigetti Computing (NasdaqCM:RGTI) announced its participation in DARPA's Quantum Benchmarking Initiative, a move that aligns with its strategic goals to advance quantum computing. This announcement comes amidst Rigetti's performance figures showing a slight 4% increase in its stock price over the past month, a period marked by significant volatility in broader markets. Despite a weak fourth-quarter earnings report revealing a substantial increase in net loss, the...",
            "publication_date": "2025-04-04T18:44:25.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.7435",
            "source": "Simply Wall St.",
            "ticker": "RGTI",
            "title": "Rigetti Computing (NasdaqCM:RGTI) Selected For US$1M DARPA Quantum Benchmarking Initiative",
            "url": "https://finance.yahoo.com/news/rigetti-computing-nasdaqcm-rgti-selected-184425845.html"
        },
        {
            "headline": "According to the average brokerage recommendation (ABR), one should invest in Rigetti Computing (RGTI). It is debatable whether this highly sought-after metric is effective because Wall Street analysts' recommendations tend to be overly optimistic. Would it be worth investing in the stock?",
            "publication_date": "2025-03-21T14:00:08.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.743",
            "source": "Zacks",
            "ticker": "RGTI",
            "title": "Brokers Suggest Investing in Rigetti Computing (RGTI): Read This Before Placing a Bet",
            "url": "https://finance.yahoo.com/news/brokers-suggest-investing-rigetti-computing-140008841.html"
        },
        {
            "headline": "We recently published a list of Jim Cramer Was Talking About These 10 Stocks Amid Trump’s Trade Wars. In this article, we are going to take a look at where Rigetti Computing, Inc. (NASDAQ:RGTI) stands against other stocks that Jim Cramer was talking about amid Trump’s trade wars. Jim Cramer in a latest program on […]",
            "publication_date": "2025-04-04T21:52:39.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.802",
            "source": "Insider Monkey",
            "ticker": "RGTI",
            "title": "Jim Cramer on Rigetti Computing (RGTI): ‘It’s a Meme Stock’",
            "url": "https://finance.yahoo.com/news/jim-cramer-rigetti-computing-rgti-215239484.html"
        },
        {
            "headline": "Nvidia (NVDA) chief executive Jensen Huang tried to do damage control after his doubts about quantum computing tanked the stocks — but they fell again anyway.",
            "publication_date": "2025-03-21T14:22:00.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.4019",
            "source": "Quartz",
            "ticker": "RGTI",
            "title": "Quantum computing stocks try to recover. Nvidia's Jensen Huang is sorry for tanking them last time",
            "url": "https://finance.yahoo.com/news/quantum-computing-stocks-try-recover-142200152.html"
        },
        {
            "headline": "Quantum computing stocks are having a moment.  Following Alphabet's revelation of its Willow quantum chip in December, quantum computing stocks including Rigetti Computing (NASDAQ: RGTI) soared, and attention has remained on the sector as Microsoft and Nvidia have made their own announcements about quantum computing.  Rigetti Computing is still a development-stage company, as it brought in just $10.8 million in revenue in 2024 and an operating loss of $68.5 million.",
            "publication_date": "2025-03-28T08:37:00.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.3182",
            "source": "Motley Fool",
            "ticker": "RGTI",
            "title": "Prediction: 2 Stocks That Will Be Worth More Than Rigetti Computing 1 Year From Now",
            "url": "https://finance.yahoo.com/news/prediction-2-stocks-worth-more-083700980.html"
        }
    ],
    "Avg Score": 0.2303375
}