{
    "4 7 2025": {
        "importantArticles": [
            {
                "headline": "(Reuters) -President Donald Trump on Monday directed a U.S. national security panel to take a fresh look at Nippon Steel's bid for U.S. Steel to help determine if \"further action\" is appropriate, raising hopes that the deal could gain an elusive green light.  \"I direct the Committee on Foreign Investment in the United States ... to conduct a review of the acquisition of U.S. Steel by (Nippon Steel) to assist me in determining whether further action in this matter may be appropriate,\" the memo reads.  Shares in U.S. Steel shot up nearly 14%, as investors took it to mean the administration was considering approving the merger, which former President Joe Biden blocked in January on national security grounds.",
                "publication_date": "2025-04-07T14:49:17.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9518",
                "source": "Reuters",
                "ticker": "RIG",
                "title": "Trump orders fresh review of Nippon Steel's bid for US Steel",
                "url": "https://finance.yahoo.com/news/trump-orders-fresh-review-nippon-144917892.html"
            },
            {
                "headline": "Devon Energy (NYSE: DVN) got off to a great start in 2025.  The oil company's stock price surged 14.3% in the first quarter, according to data from S&P Global Market Intelligence.  Here's a look at what fueled Devon's strong first-quarter rally and whether it has the fuel to continue heading higher.",
                "publication_date": "2025-04-07T09:38:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9118",
                "source": "Motley Fool",
                "ticker": "RIG",
                "title": "Devon Energy Rallied Nearly 15% in Q1 While the Nasdaq Had Its Worst Quarter Since the Bear Market",
                "url": "https://finance.yahoo.com/news/devon-energy-rallied-nearly-15-093800380.html"
            },
            {
                "headline": "RONKONKOMA, N.Y., April 07, 2025 (GLOBE NEWSWIRE) -- SUNation Energy, Inc. (“SUNation” or the “Company”) (Nasdaq: SUNE), a leading provider of sustainable solar energy and backup power solutions for households, businesses, and municipalities, today announced the second and final closing of its previously announced securities purchase agreement with certain institutional investors for the purchase and sale of 4,347,826 shares of the Company’s common stock (or common stock equivalents in lieu ther",
                "publication_date": "2025-04-07T14:50:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9118",
                "source": "GlobeNewswire",
                "ticker": "RIG",
                "title": "Sunation Energy Announces Closing of Second and Final Tranche of Registered Direct Offering Generating Gross Proceeds of $5 Million",
                "url": "https://finance.yahoo.com/news/sunation-energy-announces-closing-second-145000283.html"
            },
            {
                "headline": "Julie Hyman and Trader Talk podcast host Kenny Polcari dive into some trending tickers on Market Domination. US Steel (X) is soaring on news that US President Trump ordered a review of the company's blocked deal with Nippon Steel (NPSCY), an acquisition that was stopped by President Biden. General Motors (GM) stock is under pressure after Bernstein analysts downgraded the stock to Underperform from Market Perform as tariffs continue to pressure the US automaker. Caterpillar (CAT) stock drops after UBS analysts downgraded the stock to Sell from Neutral, citing the impact of tariffs. To watch more expert insights and analysis on the latest market action, check out more Market Domination here.",
                "publication_date": "2025-04-07T19:52:32.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.7783",
                "source": "Yahoo Finance Video",
                "ticker": "RIG",
                "title": "GM & Caterpillar, Trump revisits US Steel deal: Trending Tickers",
                "url": "https://finance.yahoo.com/video/gm-caterpillar-trump-revisits-us-195232057.html"
            },
            {
                "headline": "Citi lowered its earnings estimates for half-a-dozen clothes and shoe companies, including Columbia Sportswear, Levi Strauss, VF, Ralph Lauren and Calvin Klein parent PVH, due to looming higher tariffs and a weaker macroeconomic backdrop.",
                "publication_date": "2025-04-07T15:11:38.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5994",
                "source": "The Wall Street Journal",
                "ticker": "RIG",
                "title": "Citi Cuts Profit Forecasts for Levi Strauss, Ralph Lauren, Other Apparel Stocks",
                "url": "https://finance.yahoo.com/m/80cde17e-0cc1-3ea9-86d2-3d90b5dbc2c8/citi-cuts-profit-forecasts.html"
            },
            {
                "headline": "Brazil's state-run oil firm Petrobras is unlikely to lower diesel prices while the economic scenario abroad remains uncertain, Chief Executive Magda Chambriard told Reuters after a request from the government to do so became public on Monday.  Petrobras will not bring jitters from abroad to the Brazilian market, said Chambriard, after reports that Brazil's Mines and Energy Minister Alexandre Silveira asked her to consider a new cut in the average price of diesel sold to distributors in Brazil.",
                "publication_date": "2025-04-07T20:15:22.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5267",
                "source": "Reuters",
                "ticker": "RIG",
                "title": "Brazil's Petrobras unlikely to change diesel prices despite energy minister request",
                "url": "https://finance.yahoo.com/news/brazils-energy-minister-asks-petrobras-201522428.html"
            }
        ],
        "avgScore": 0.35808730158730173
    },
    "4 4 2025": {
        "importantArticles": [
            {
                "headline": "We recently published a list of 11 Best Innovative Stocks to Buy According to Analysts. In this article, we are going to take a look at where Broadcom Inc. (NASDAQ:AVGO) stands against other best innovative stocks to buy according to analysts. Innovative stocks are the companies that continuously invest in developing new products, services or […]",
                "publication_date": "2025-04-04T22:17:38.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9524",
                "source": "Insider Monkey",
                "ticker": "RIG",
                "title": "Is Broadcom Inc. (AVGO) the Best Innovative Stock to Buy According to Analysts?",
                "url": "https://finance.yahoo.com/news/broadcom-inc-avgo-best-innovative-221738886.html"
            },
            {
                "headline": "We recently published a list of the 10 Best Copper Stocks to Buy According to Wall Street Analysts. In this article, we are going to take a look at where Freeport-McMoRan Inc. (NYSE:FCX) stands against other best copper stocks to buy according to Wall Street analysts. The U.S. stock market has changed rapidly since the […]",
                "publication_date": "2025-04-04T23:08:36.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8555",
                "source": "Insider Monkey",
                "ticker": "RIG",
                "title": "Is Freeport-McMoRan Inc. (FCX) the Best Copper Stock to Buy According to Wall Street Analysts?",
                "url": "https://finance.yahoo.com/news/freeport-mcmoran-inc-fcx-best-230836591.html"
            },
            {
                "headline": "The Zacks Earnings ESP is a great way to find potential earnings surprises. Why investors should take advantage now.",
                "publication_date": "2025-04-04T13:00:08.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7906",
                "source": "Zacks",
                "ticker": "RIG",
                "title": "How to Boost Your Portfolio with Top Medical Stocks Set to Beat Earnings",
                "url": "https://finance.yahoo.com/news/boost-portfolio-top-medical-stocks-130008266.html"
            },
            {
                "headline": "(Bloomberg) -- Copper prices plunged below $9,000 a ton in the biggest drop since March 2020 as worries over the impact of a worsening trade war sparked a heavy selloff in metals and mining equities.Most Read from BloombergHousing Agency Aims to Relocate Its DC HeadquartersMetro-North Is Faster Than Acela on NYC-New Haven Route After Signal UpdatesLocal Governments Vie for Fired Federal WorkersWhat Would ‘Transportation Abundance’ Look Like?London Clears Final Hurdle for More High-Speed Trains t",
                "publication_date": "2025-04-04T17:04:11.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.9337",
                "source": "Bloomberg",
                "ticker": "RIG",
                "title": "Copper Plunges Most in 5 Years as Tariffs Slam Metals and Miners",
                "url": "https://finance.yahoo.com/news/copper-plunges-more-5-tariffs-112616302.html"
            },
            {
                "headline": "Oil price could fall as low as $50 as Saudis launch price war. Gasoline prices set to be a bright spot in Trump's trade war.",
                "publication_date": "2025-04-04T16:26:22.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.7906",
                "source": "Investor's Business Daily",
                "ticker": "RIG",
                "title": "U.S. Oil Price Skids To 4-Year Low; Goldman Slashes Oil Outlook",
                "url": "https://finance.yahoo.com/m/f4eea585-509d-3f33-b891-e459bb8b56e8/u-s-oil-price-skids-to.html"
            },
            {
                "headline": "Occidental Petroleum (NYSE:OXY) experienced a 6% decline over the last month, a movement that may be closely tied to the broader market's reaction to evolving trade tensions and tariff announcements. As the U.S. implemented sweeping tariffs and China retaliated, fears of a global trade war escalated, affecting various sectors, including energy. The market's turbulent period, marked by significant losses in major indices and a 6% drop in energy stocks like Exxon Mobil and Chevron, coincided...",
                "publication_date": "2025-04-04T18:00:24.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.7717",
                "source": "Simply Wall St.",
                "ticker": "RIG",
                "title": "Trade Tensions Weigh On Occidental Petroleum (NYSE:OXY) Stock With 6% Drop Over The Last Month",
                "url": "https://finance.yahoo.com/news/trade-tensions-weigh-occidental-petroleum-180024373.html"
            }
        ],
        "avgScore": 0.17336999999999997
    },
    "4 3 2025": {
        "importantArticles": [
            {
                "headline": "The years-long uptrend in artificial intelligence (AI) stocks may be taking a break, but AI integration isn't slowing down.  There's still a ton of work to be done before tech companies and the cloud computing players that support them will have enough AI computing capacity in service to meet the market's needs, and plenty of companies are well positioned to benefit from the infrastructure spending to come.  One company that's in a strong position is Super Micro Computer (NASDAQ: SMCI).",
                "publication_date": "2025-04-03T10:45:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9721",
                "source": "Motley Fool",
                "ticker": "RIG",
                "title": "Prediction: Super Micro Computer Could Be 2025's Best Performing AI Stock",
                "url": "https://finance.yahoo.com/news/prediction-super-micro-computer-could-104500094.html"
            },
            {
                "headline": "Both Nvidia (NASDAQ: NVDA) and Broadcom (NASDAQ: AVGO) have been big beneficiaries of the huge investments in artificial intelligence (AI) hardware, which explains why the share prices of both companies shot up impressively over the past couple of years.  While Nvidia stock jumped more than 280% in the past two years, Broadcom recorded healthy gains of 160% during the same period.  Nvidia stock retreated close to 18% this year, while Broadcom has recorded a sharper drop of almost 28%.",
                "publication_date": "2025-04-03T10:23:36.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9371",
                "source": "Motley Fool",
                "ticker": "RIG",
                "title": "Better Artificial Intelligence (AI) Stock: Nvidia vs. Broadcom",
                "url": "https://finance.yahoo.com/news/better-artificial-intelligence-ai-stock-102336549.html"
            },
            {
                "headline": "Super Micro Computer, Inc. (SMCI), a Total IT Solution Provider for AI/ML, HPC, Cloud, Storage, and 5G/Edge, is announcing first-to-market industry leading performance on several MLPerf Inference v5.0 benchmarks, using the NVIDIA HGX™ B200 8-GPU. The 4U liquid-cooled and 10U air-cooled systems achieved the best performance in select benchmarks. Supermicro demonstrated more than 3 times the tokens per second (Token/s) generation for Llama2-70B and Llama3.1-405B benchmarks compared to H200 8-GPU s",
                "publication_date": "2025-04-03T13:05:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.886",
                "source": "PR Newswire",
                "ticker": "RIG",
                "title": "Industry's First-to-Market Supermicro NVIDIA HGX™ B200 Systems Demonstrate AI Performance Leadership on MLPerf® Inference v5.0 Results",
                "url": "https://finance.yahoo.com/news/industrys-first-market-supermicro-nvidia-130500020.html"
            },
            {
                "headline": "(Bloomberg) -- Roughly $2.5 trillion was erased from the S&P 500 Index on Thursday amid worries that President Donald Trump’s sweeping new round of tariffs could plunge the economy into a recession.Most Read from BloombergHousing Agency Aims to Relocate Its DC HeadquartersMetro-North Is Faster Than Acela on NYC-New Haven Route After Signal UpdatesLocal Governments Vie for Fired Federal WorkersLondon Clears Final Hurdle for More High-Speed Trains to EuropeWhat Would ‘Transportation Abundance’ Loo",
                "publication_date": "2025-04-03T20:13:46.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.7269",
                "source": "Bloomberg",
                "ticker": "RIG",
                "title": "Trump Tariffs Wipe Out $2.5 Trillion From US Stock Market",
                "url": "https://finance.yahoo.com/news/trump-tariffs-set-wipe-nearly-120038363.html"
            },
            {
                "headline": "Energy prices got slammed by fears of a global economic slowdown stemming from President Trump's tariff plan, and OPEC and its market allies piled pressure onto the U.S. energy industry by open up the spigots.  U.S. oil futures fell 6.6%, or $4.76 a barrel to close at $66.95, their worst day on a percentage basis since July 2022, when a spike after Russia's invasion of Ukraine was unwinding.  Futures started selling off while Trump was still talking about his tariff plan Wednesday afternoon.",
                "publication_date": "2025-04-03T19:17:46.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.7096",
                "source": "The Wall Street Journal",
                "ticker": "RIG",
                "title": "Oil Prices Tumbled to Worst Day in Nearly Three Years",
                "url": "https://finance.yahoo.com/m/0740ef60-d62b-3950-88bc-3481038ea642/oil-prices-tumbled-to-worst.html"
            },
            {
                "headline": "Nvidia stock and SMCI stock are plunging on tariff-related uncertainty. For those looking to buy the dip, look for this first.",
                "publication_date": "2025-04-03T19:55:34.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.34",
                "source": "Investor's Business Daily",
                "ticker": "RIG",
                "title": "Nvidia And SMCI Are Cheaper Than Ever — But Wait For This Before Buying",
                "url": "https://finance.yahoo.com/m/1b48806e-b4de-3379-bd63-39a5b2c012b1/nvidia-and-smci-are-cheaper.html"
            }
        ],
        "avgScore": 0.36069062499999993
    },
    "4 2 2025": {
        "importantArticles": [
            {
                "headline": "Valero Energy (VLO) closed at $133.62 in the latest trading session, marking a -0.09% move from the prior day.",
                "publication_date": "2025-04-02T22:00:19.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.2732",
                "source": "Zacks",
                "ticker": "RIG",
                "title": "Valero Energy (VLO) Stock Slides as Market Rises: Facts to Know Before You Trade",
                "url": "https://finance.yahoo.com/news/valero-energy-vlo-stock-slides-220019344.html"
            },
            {
                "headline": "ConocoPhillips (COP) reachead $106.10 at the closing of the latest trading day, reflecting a +0.67% change compared to its last close.",
                "publication_date": "2025-04-02T22:00:17.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Zacks",
                "ticker": "RIG",
                "title": "ConocoPhillips (COP) Stock Moves 0.67%: What You Should Know",
                "url": "https://finance.yahoo.com/news/conocophillips-cop-stock-moves-0-220017461.html"
            },
            {
                "headline": "Schlumberger (SLB) reachead $42.19 at the closing of the latest trading day, reflecting a -0.02% change compared to its last close.",
                "publication_date": "2025-04-02T22:00:17.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Zacks",
                "ticker": "RIG",
                "title": "Schlumberger (SLB) Stock Sinks As Market Gains: Here's Why",
                "url": "https://finance.yahoo.com/news/schlumberger-slb-stock-sinks-market-220017867.html"
            },
            {
                "headline": "Schlumberger (SLB) reachead $42.19 at the closing of the latest trading day, reflecting a -0.02% change compared to its last close.",
                "publication_date": "2025-04-02T22:00:17.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Zacks",
                "ticker": "RIG",
                "title": "Schlumberger (SLB) Stock Sinks As Market Gains: Here's Why",
                "url": "https://finance.yahoo.com/news/schlumberger-slb-stock-sinks-market-220017867.html"
            },
            {
                "headline": "ConocoPhillips (COP) reachead $106.10 at the closing of the latest trading day, reflecting a +0.67% change compared to its last close.",
                "publication_date": "2025-04-02T22:00:17.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Zacks",
                "ticker": "RIG",
                "title": "ConocoPhillips (COP) Stock Moves 0.67%: What You Should Know",
                "url": "https://finance.yahoo.com/news/conocophillips-cop-stock-moves-0-220017461.html"
            },
            {
                "headline": "Valero Energy (VLO) closed at $133.62 in the latest trading session, marking a -0.09% move from the prior day.",
                "publication_date": "2025-04-02T22:00:19.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.2732",
                "source": "Zacks",
                "ticker": "RIG",
                "title": "Valero Energy (VLO) Stock Slides as Market Rises: Facts to Know Before You Trade",
                "url": "https://finance.yahoo.com/news/valero-energy-vlo-stock-slides-220019344.html"
            }
        ],
        "avgScore": 0.09106666666666667
    },
    "coef": 0.5873397227911612,
    "avgCoef": 0.17654832054966055
}