{
    "Important Articles": [
        {
            "headline": "Electric vehicle (EV) maker Rivian Automotive (NASDAQ: RIVN) released first-quarter deliveries today, and the stock tanked.  If you liked Rivian stock before today, though, you should like it even more now.  While Rivian's EV deliveries declined by 36% year over year, the number of units shipped (8,640) was in line with guidance and expectations.",
            "publication_date": "2025-04-02T15:16:10.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.6808",
            "source": "Motley Fool",
            "ticker": "RIVN",
            "title": "Why Rivian Stock Plunged Today",
            "url": "https://finance.yahoo.com/news/why-rivian-stock-plunged-today-151610713.html"
        },
        {
            "headline": "Investing.com -- Rivian Automotive reported first-quarter vehicle deliveries of 8640, a fall of 36% but it was slightly above analysts’ estimates of 8610. Shares fell more than 4% in early tradingThe electric vehicle maker also said it produced 14611 vehicles at its Normal, Illinois, facility during the quarter ended March 31. For the same period last year, Rivian produced 13,980 vehicles at the same manufacturing facility and delivered 13,588 vehicles.",
            "publication_date": "2025-04-02T14:11:56.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.4215",
            "source": "Investing.com",
            "ticker": "RIVN",
            "title": "Rivian deliveries fall but beat estimates slightly, shares down",
            "url": "https://finance.yahoo.com/news/rivian-deliveries-fall-beat-estimates-141156400.html"
        },
        {
            "headline": "Electric automaker Lucid  posted a 58% jump in first-quarter deliveries on Wednesday as it lowered prices of its vehicles, while peer Rivian Automotive reported a 36% decline.  Lucid has also offered incentives including cheaper financing to woo customers away from cheaper hybrid vehicles amid high interest rates.  Rivian has been battling tough demand as consumers opt for cheaper hybrid and gas-powered vehicles in an uncertain economic and political environment.",
            "publication_date": "2025-04-02T12:31:33.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.3818",
            "source": "Reuters",
            "ticker": "RIVN",
            "title": "Lucid's quarterly deliveries rise, Rivian's fall sharply",
            "url": "https://finance.yahoo.com/news/rivian-reports-fall-first-quarter-123133979.html"
        },
        {
            "headline": "We recently published a list of Top 10 Stocks on Jim Cramer’s Radar as Trump Tariffs Wreak Havoc Across Global Markets. In this article, we are going to take a look at where Rivian Automotive Inc (NASDAQ:RIVN) stands against other top stocks on Jim Cramer’s radar as Trump tariffs wreak havoc across global markets. Jim […]",
            "publication_date": "2025-04-03T18:47:21.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.7351",
            "source": "Insider Monkey",
            "ticker": "RIVN",
            "title": "Jim Cramer on Rivian Automotive (RIVN): ‘I Do Worry About Financing’",
            "url": "https://finance.yahoo.com/news/jim-cramer-rivian-automotive-rivn-184721629.html"
        },
        {
            "headline": "RIVN's deliveries drop to 8,640 vehicles from 13,588 in the same period last year due to sluggish demand for EV.",
            "publication_date": "2025-04-03T11:09:00.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.6486",
            "source": "Zacks",
            "ticker": "RIVN",
            "title": "Rivian Q1 Deliveries Decline Y/Y Amid Weaker Demand for EV",
            "url": "https://finance.yahoo.com/news/rivian-q1-deliveries-decline-y-110900519.html"
        },
        {
            "headline": "If there’s one thing that financial markets don’t like, it’s uncertainty – and President Trump’s tariffs have thrown a huge bucket of uncertainty right into the mix. It’s not just that his aggressive tariff policy has ignited a competitive trade war with our largest trading partners, Canada and Mexico – it’s also that the mercurial President will announce tariffs, walk them back, and reimpose them. He’s created an environment that makes it difficult for investors to predict what’s coming next. F",
            "publication_date": "2025-04-03T08:00:04.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.6486",
            "source": "TipRanks",
            "ticker": "RIVN",
            "title": "Trump Tariffs’ Pain Could Be These Stocks’ Gain",
            "url": "https://finance.yahoo.com/news/trump-tariffs-pain-could-stocks-080004921.html"
        }
    ],
    "Avg Score": -0.007978947368421042
}