{
    "importantArticles": [
        {
            "headline": "Rivian (NASDAQ: RIVN) stock posted big gains in Tuesday's trading thanks to a pair of bullish catalysts.  The electric vehicle (EV) company's shares ended the day up 6.4% amid the backdrop of a 0.3% gain for the S&P 500 and a 0.8% gain for the Nasdaq Composite.  The stock also got a boost from recent analysis that Rivian could benefit from recent controversies surrounding Tesla and its CEO Elon Musk.",
            "publication_date": "2025-04-02T00:08:45.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.9584",
            "source": "Motley Fool",
            "ticker": "RIVN",
            "title": "Why Rivian Stock Surged Today",
            "url": "https://finance.yahoo.com/news/why-rivian-stock-surged-today-000845168.html"
        },
        {
            "headline": "Shares of electric vehicle manufacturer Rivian (NASDAQ:RIVN) jumped 8.5% in the afternoon session as auto companies with significant manufacturing local presence became more favored after US President Donald Trump announced a 25% tariff on all vehicles imported into the United States. Rivian manufactures its cars in the United States. While this does not necessarily mean the company sources all its components and raw materials domestically, the stock's positive reaction indicates that investors",
            "publication_date": "2025-03-27T18:54:53.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.9359",
            "source": "StockStory",
            "ticker": "RIVN",
            "title": "Rivian (RIVN) Shares Skyrocket, What You Need To Know",
            "url": "https://finance.yahoo.com/news/rivian-rivn-shares-skyrocket-know-185453395.html"
        },
        {
            "headline": "Rivian Automotive (NasdaqGS:RIVN) saw a notable share price increase of nearly 20% last week, coinciding with its strategic decision to spin off its micromobility business into Also, Inc., highlighting the company's focus on core electric vehicle operations. This move may have strengthened investor confidence despite broader market concerns, as the Dow Jones Industrial Average and NASDAQ Composite experienced declines amid heightened inflation and weakened consumer sentiment. While the...",
            "publication_date": "2025-03-28T17:42:01.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.8074",
            "source": "Simply Wall St.",
            "ticker": "RIVN",
            "title": "Rivian Automotive (NasdaqGS:RIVN) Sees 20% Weekly Price Jump After Spin-Off Of Micromobility Business",
            "url": "https://finance.yahoo.com/news/rivian-automotive-nasdaqgs-rivn-sees-174201804.html"
        },
        {
            "headline": "We recently published a list of 10 Stocks Jump, Defy Market Uncertainties on Thursday. In this article, we are going to take a look at where Rivian Automotive Inc. (NASDAQ:RIVN) stands against other stocks that jumped, defying market uncertainties on Thursday. The stock market extended losses on Thursday, with all the major indices ending in […]",
            "publication_date": "2025-03-28T08:26:39.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.7579",
            "source": "Insider Monkey",
            "ticker": "RIVN",
            "title": "Why Rivian Automotive Inc. (RIVN) Surged On Thursday?",
            "url": "https://finance.yahoo.com/news/why-rivian-automotive-inc-rivn-082639507.html"
        },
        {
            "headline": "We recently published a list of Top 10 Stocks on Jim Cramer’s Radar as Trump Tariffs Wreak Havoc Across Global Markets. In this article, we are going to take a look at where Rivian Automotive Inc (NASDAQ:RIVN) stands against other top stocks on Jim Cramer’s radar as Trump tariffs wreak havoc across global markets. Jim […]",
            "publication_date": "2025-04-03T18:47:21.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.7351",
            "source": "Insider Monkey",
            "ticker": "RIVN",
            "title": "Jim Cramer on Rivian Automotive (RIVN): ‘I Do Worry About Financing’",
            "url": "https://finance.yahoo.com/news/jim-cramer-rivian-automotive-rivn-184721629.html"
        },
        {
            "headline": "RIVN's deliveries drop to 8,640 vehicles from 13,588 in the same period last year due to sluggish demand for EV.",
            "publication_date": "2025-04-03T11:09:00.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.6486",
            "source": "Zacks",
            "ticker": "RIVN",
            "title": "Rivian Q1 Deliveries Decline Y/Y Amid Weaker Demand for EV",
            "url": "https://finance.yahoo.com/news/rivian-q1-deliveries-decline-y-110900519.html"
        }
    ],
    "avgScore": 0.13044358974358977,
    "todayPctChange": -0.009725959882439197,
    "vScore": -0.12686891207675113
}