{
    "importantArticles": [
        {
            "headline": "Rocket Companies (NYSE:RKT) recently announced plans to acquire Mr. Cooper Group and Redfin, alongside a special dividend and corporate governance changes, which have collectively contributed to a 40% rise in the company's share price over the last quarter. These developments underscore a focus on expansion and shareholder returns, aligning with an impressive financial recovery, including a substantial rise in earnings for Q4 2024. This performance stands out amid broader market declines,...",
            "publication_date": "2025-04-05T18:41:55.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.8402",
            "source": "Simply Wall St.",
            "ticker": "RKT",
            "title": "Rocket Companies (NYSE:RKT) Climbs 40% Over Last Quarter Following Special Dividend Announcement",
            "url": "https://finance.yahoo.com/news/rocket-companies-nyse-rkt-climbs-184155713.html"
        },
        {
            "headline": "Shares of the mortgage giant Rocket Companies (NYSE: RKT) were trading about 8% lower at 11:48 a.m. ET today, after the company announced plans to acquire the large mortgage servicing company Mr. Cooper Group.  It's clear that Rocket is trying to consolidate and gain market share amid a challenging high-interest-rate environment that has now dogged the mortgage sector for the last few years.  A few weeks ago, Rocket announced that it would acquire Redfin in a $1.75 billion deal.",
            "publication_date": "2025-03-31T17:08:44.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.8316",
            "source": "Motley Fool",
            "ticker": "RKT",
            "title": "Why Shares of Rocket Companies Are Falling After a Big Acquisition Announcement",
            "url": "https://finance.yahoo.com/news/why-shares-rocket-companies-falling-170844744.html"
        },
        {
            "headline": "Rocket Companies (RKT) is expanding its business by acquiring Mr. Cooper (COOP) for $9.4 billion to build a homeownership platform that integrates everything from home search to servicing. Rocket Companies CEO Varun Krishna joins Wealth host Julie Hyman and Yahoo Finance Executive Editor Brian Sozzi to explain that this acquisition will enhance their client relationships and improve profitability. To watch more expert insights and analysis on the latest market action, check out more Wealth&nbsp;here.",
            "publication_date": "2025-03-31T16:48:24.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.802",
            "source": "Yahoo Finance Video",
            "ticker": "RKT",
            "title": "Why Rocket Companies is betting big on Mr. Cooper",
            "url": "https://finance.yahoo.com/video/why-rocket-companies-betting-big-164824294.html"
        },
        {
            "headline": "The major averages were mostly lower near noon, with the Dow up fractionally but the Nasdaq down nearly 250 points amid mounting concerns about President Donald Trump’s upcoming announcement of promised new tariffs. Meanwhile, the S&P 500’s early losses brought the index to its lowest level since September. Looking to commodities, gold prices are sharply higher, continuing their rally to over $3,150, while oil prices are also up over 2.5%. Get caught up quickly on the top news and calls moving s",
            "publication_date": "2025-04-01T16:16:11.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.4767",
            "source": "TipRanks",
            "ticker": "RKT",
            "title": "Rocket acquires Mr. Cooper, Musk’s xAI acquires X: Morning Buzz",
            "url": "https://finance.yahoo.com/news/rocket-acquires-mr-cooper-musk-161611941.html"
        },
        {
            "headline": "Rocket Companies (RKT) witnessed a jump in share price last session on above-average trading volume. The latest trend in earnings estimate revisions for the stock doesn't suggest further strength down the road.",
            "publication_date": "2025-04-03T13:06:00.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.1098",
            "source": "Zacks",
            "ticker": "RKT",
            "title": "Rocket Companies (RKT) Moves 10.0% Higher: Will This Strength Last?",
            "url": "https://finance.yahoo.com/news/rocket-companies-rkt-moves-10-130600369.html"
        },
        {
            "headline": "As the broader market continued to fall Rocket Companies (RKT) stock spiked over +10% on Friday and has now soared +35% in 2025.",
            "publication_date": "2025-04-04T22:05:00.000Z",
            "sentiment": "Neutral",
            "sentimentScore": "0.0",
            "source": "Zacks",
            "ticker": "RKT",
            "title": "M&A Watch: Buy the Surge in Rocket Companies (RKT) Stock?",
            "url": "https://finance.yahoo.com/news/m-watch-buy-surge-rocket-220500588.html"
        }
    ],
    "avgScore": 0.30735625,
    "todayPctChange": 0.10017830480288759,
    "vScore": 3.0790428095572517
}