{
    "Important Articles": [
        {
            "headline": "SLB (SLB) has announced an agreement between its OneSubsea joint venture and Vundefinedr Energi to deliver a sizeable subsea production systems SPS work scope. This award leverages the existing strategic subsea partnership agreement between the two companies for standardized subsea equipment, supporting multiple upcoming oil and gas developments on the Norwegian Continental Shelf NCS…Under this SPS pre-commitment program, work commences immediately to deliver two equipment packages. The first pa",
            "publication_date": "2025-02-05T13:35:53.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.9153",
            "source": "TipRanks",
            "ticker": "SLB",
            "title": "OneSubsea in deal with Vundefinedr Energi for subsea developments in Norway",
            "url": "https://finance.yahoo.com/news/onesubsea-deal-vundefinedr-energi-subsea-133553790.html"
        },
        {
            "headline": "HOUSTON, February 04, 2025--SLB (NYSE: SLB) has announced an agreement between its OneSubsea™ joint venture and Vår Energi to deliver a sizeable subsea production systems (SPS) work scope. This award leverages the existing strategic subsea partnership agreement between the two companies for standardized subsea equipment, supporting multiple upcoming oil and gas developments on the Norwegian Continental Shelf (NCS).",
            "publication_date": "2025-02-04T13:26:00.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.9153",
            "source": "Business Wire",
            "ticker": "SLB",
            "title": "SLB OneSubsea signs agreement with Vår Energi for upcoming subsea developments in Norway",
            "url": "https://finance.yahoo.com/news/slb-onesubsea-signs-agreement-v-132600082.html"
        },
        {
            "headline": "We recently published a list of 12 Best Energy Stocks to Invest in According to Billionaires. In this article, we are going to take a look at where Schlumberger Limited (NYSE:SLB) stands against other best energy stocks to invest in according to billionaires. After significantly lagging behind in 2024, the broader energy sector finally seems […]",
            "publication_date": "2025-03-24T13:53:00.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.8934",
            "source": "Insider Monkey",
            "ticker": "SLB",
            "title": "Is Schlumberger Limited (SLB) the Best Energy Stock to Invest in According to Billionaires?",
            "url": "https://finance.yahoo.com/news/schlumberger-limited-slb-best-energy-135300183.html"
        },
        {
            "headline": "We recently published a list of 8 Stocks on Jim Cramer’s Radar. In this article, we are going to take a look at where Schlumberger Limited (NYSE:SLB) stands against other stocks on Jim Cramer’s radar. Jim Cramer, the host of Mad Money, recently broke down the market’s performance on Tuesday, discussing how President Donald Trump’s […]",
            "publication_date": "2025-01-25T15:54:35.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.7845",
            "source": "Insider Monkey",
            "ticker": "SLB",
            "title": "Schlumberger Limited (SLB): Leading the Charge in Energy and Carbon Management",
            "url": "https://finance.yahoo.com/news/schlumberger-limited-slb-leading-charge-155435081.html"
        },
        {
            "headline": "We recently published a list of Jim Cramer’s Thoughts on These 9 Stocks. In this article, we are going to take a look at where Schlumberger Limited (NYSE:SLB) stands against other stocks that Jim Cramer discusses. Jim Cramer, host of Mad Money, recently pointed out some unexpected trends in the stock market this year, spotlighting […]",
            "publication_date": "2025-02-08T21:42:05.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.6249",
            "source": "Insider Monkey",
            "ticker": "SLB",
            "title": "Schlumberger (SLB): “Best House in a Bad Neighborhood” Says Jim Cramer",
            "url": "https://finance.yahoo.com/news/schlumberger-slb-best-house-bad-214205788.html"
        },
        {
            "headline": "We recently published a list of Jim Cramer Looked At These 7 Stocks Recently. In this article, we are going to take a look at where Schlumberger Limited (NYSE:SLB) stands against other stocks that Jim Cramer recently looked at. Jim Cramer, host of Mad Money, recently shared his perspective on a few oil service stocks […]",
            "publication_date": "2025-01-28T10:17:46.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.4019",
            "source": "Insider Monkey",
            "ticker": "SLB",
            "title": "Cramer Called Schlumberger Limited (SLB) “The Larger and More International of the Two”",
            "url": "https://finance.yahoo.com/news/cramer-called-schlumberger-limited-slb-101746382.html"
        }
    ],
    "Avg Score": 0.30557027027027023
}