{
    "importantArticles": [
        {
            "headline": "The ongoing market correction is hitting tech stocks particularly hard. Some popular social media and internet stocks are now significantly lower than their 52-week highs. Shares of Meta Platforms (META), the $1.5 trillion-dollar gorilla in the social media space, are down 22.2% from recent highs. Meanwhile, shares of other popular social media stocks like Pinterest (PINS) and Snapchat (SNAP) are down 30.4% and 48.7%, respectively. Let’s examine these three social media stocks to determine which",
            "publication_date": "2025-04-01T11:59:03.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.8894",
            "source": "TipRanks",
            "ticker": "SNAP",
            "title": "META, PINS, or SNAP: Which Social Media Stock Can Withstand a Market Correction?",
            "url": "https://finance.yahoo.com/news/meta-pins-snap-social-media-115903221.html"
        },
        {
            "headline": "We recently published a list of the 12 Best AI Stocks to Invest in According to Reddit. In this article, we are going to take a look at where Snap Inc. (NYSE:SNAP) stands against other AI stocks to invest in according to Reddit. Jensen Huang had previously estimated that practical quantum computing would be 15 […]",
            "publication_date": "2025-03-27T13:30:06.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.6369",
            "source": "Insider Monkey",
            "ticker": "SNAP",
            "title": "Is Snap Inc. (SNAP) the Best AI Stock to Invest in According to Reddit?",
            "url": "https://finance.yahoo.com/news/snap-inc-snap-best-ai-133006986.html"
        },
        {
            "headline": "We recently published a list of Top 10 Stocks to Buy According to SRS Investment Management. In this article, we are going to take a look at where Snap Inc. (NYSE:SNAP) stands against other top stocks to buy according to SRS Investment Management. SRS Investment Management is a New York-based investment firm founded in 2006 by […]",
            "publication_date": "2025-03-30T12:39:23.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.3818",
            "source": "Insider Monkey",
            "ticker": "SNAP",
            "title": "Is Snap Inc. (SNAP) the Top Stock to Buy According to SRS Investment Management?",
            "url": "https://finance.yahoo.com/news/snap-inc-snap-top-stock-123923262.html"
        },
        {
            "headline": "BofA notes that President Trump’s newly announced tariffs were larger than anticipated and are “a direct negative” for discretionary retail sales and advertising. In addition, the potential for increasing recession fears fueled by the tariffs are “a relative negative for the entire Internet sector,” which the analyst notes underperformed in 2008 and 2022 as fears of a recession grew. The “only potential silver lining” is that proposed rates could be viewed as a negotiation tool that may not be f",
            "publication_date": "2025-04-04T13:16:20.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.9313",
            "source": "TipRanks",
            "ticker": "SNAP",
            "title": "Tariff-fueled recession fears ‘relative negative’ for Internet sector, says BofA",
            "url": "https://finance.yahoo.com/news/tariff-fueled-recession-fears-relative-131620534.html"
        },
        {
            "headline": "Although the S&P 500 is down 1.4% over the past six months, Snap’s stock price has fallen further to $9.13, losing shareholders 14.7% of their capital. This may have investors wondering how to approach the situation.",
            "publication_date": "2025-03-28T09:05:39.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.6249",
            "source": "StockStory",
            "ticker": "SNAP",
            "title": "3 Reasons SNAP is Risky and 1 Stock to Buy Instead",
            "url": "https://finance.yahoo.com/news/3-reasons-snap-risky-1-090539452.html"
        },
        {
            "headline": "Wall Street is wasting no time adjusting their views on certain stocks in the wake of bruising Trump tariffs.",
            "publication_date": "2025-04-04T13:54:45.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.4215",
            "source": "Yahoo Finance",
            "ticker": "SNAP",
            "title": "Wall Street now hates these 10 stocks because of Trump tariffs",
            "url": "https://finance.yahoo.com/news/wall-street-now-hates-these-10-stocks-because-of-trump-tariffs-135445636.html"
        }
    ],
    "avgScore": 0.055527777777777766,
    "todayPctChange": 0.015792798560005997,
    "vScore": 0.08769390089292217
}