{
    "importantArticles": [
        {
            "headline": "SoFi Technologies (NasdaqGS:SOFI) has recently secured a significant $5 billion agreement with Blue Owl Capital to bolster its Loan Platform Business, focusing on personal loans. This development aligns with SoFi's efforts to diversify its revenue streams and likely supported the 11% increase in the company's share price over the past week. Meanwhile, as the broader market climbed 2% over the same period, driven by gains in major indices like the S&P 500 and Nasdaq, SoFi's performance...",
            "publication_date": "2025-03-25T17:46:53.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.9468",
            "source": "Simply Wall St.",
            "ticker": "SOFI",
            "title": "SoFi Technologies (NasdaqGS:SOFI) Secures US$5B Deal with Blue Owl Capital Amid 11% Stock Surge Over Last Week",
            "url": "https://finance.yahoo.com/news/sofi-technologies-nasdaqgs-sofi-secures-174653796.html"
        },
        {
            "headline": "The 9th Annual FinTech Breakthrough Awards have highlighted the ongoing advancements in the FinTech sector, with a strong emphasis on digital payments and related technologies. This year's awards showcase innovations that are shaping the digital payment landscape, such as embedded finance, artificial intelligence, and blockchain. These technologies are driving enhanced user experiences and operational efficiencies, reflecting the industry's rapid evolution. As demand for seamless digital...",
            "publication_date": "2025-03-24T12:07:26.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.926",
            "source": "Simply Wall St.",
            "ticker": "SOFI",
            "title": "This Week In Digital Payment - FinTech Innovations Shaping Future Financial Services",
            "url": "https://finance.yahoo.com/news/week-digital-payment-fintech-innovations-120726508.html"
        },
        {
            "headline": "Recent advancements in digital payment technology continue to enhance merchant capabilities, as evidenced by Finix's latest suite of product updates for Q1, unveiled on March 26, 2025. These updates include features such as Account Updater, Network Tokens, Instant Payouts, and new hardware terminal options, aimed at improving efficiency, security, and cash flow for businesses. By addressing key payment processing challenges, Finix exemplifies the ongoing innovation within the digital payment...",
            "publication_date": "2025-03-31T12:07:36.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.8625",
            "source": "Simply Wall St.",
            "ticker": "SOFI",
            "title": "Latest News In Digital Payment - Innovative Payment Tools Boost Merchant Efficiency and Security",
            "url": "https://finance.yahoo.com/news/latest-news-digital-payment-innovative-120736064.html"
        },
        {
            "headline": "The market has been doing some flip-flopping during the past two weeks, with the Nasdaq Composite officially in a correction and the S&P 500 entering one briefly.  Investors are nervous about an economic slowdown, with new tariffs looming that could hurt company earnings.  Older investors should have most of their funds in secure, dividend-paying stocks that can withstand brutal market conditions, and younger investors have the time to plow through and see their investments rebound and grow over many years or decades.",
            "publication_date": "2025-03-22T09:00:00.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.8271",
            "source": "Motley Fool",
            "ticker": "SOFI",
            "title": "This Magnificent Growth Stock Is Down 51%. Buy It Before It Sets a New All-Time High",
            "url": "https://finance.yahoo.com/news/magnificent-growth-stock-down-51-090000595.html"
        },
        {
            "headline": "The digital bank continues to grow at lightning speed, but faces an increasingly uncertain economic climate.",
            "publication_date": "2025-04-02T08:53:00.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.4215",
            "source": "Motley Fool",
            "ticker": "SOFI",
            "title": "SoFi Technologies: Buy, Sell, or Hold?",
            "url": "https://finance.yahoo.com/news/sofi-technologies-buy-sell-hold-085300902.html"
        },
        {
            "headline": "We recently published a list of Jim Cramer’s Thoughts on These 5 Stocks. In this article, we are going to take a look at where SoFi Technologies, Inc. (NASDAQ:SOFI), stands against other stocks that Jim Cramer discusses. On Tuesday, Jim Cramer, host of Mad Money, shared his thoughts on the current state of the market, […]",
            "publication_date": "2025-03-22T19:23:48.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.2023",
            "source": "Insider Monkey",
            "ticker": "SOFI",
            "title": "Jim Cramer on SoFi Technologies (SOFI): ‘Do Not Panic – The Company’s in Good Hands’",
            "url": "https://finance.yahoo.com/news/jim-cramer-sofi-technologies-sofi-192348685.html"
        }
    ],
    "avgScore": 0.42213684210526325,
    "todayPctChange": -0.06093364854416815,
    "vScore": -2.5722337974387113
}