{
    "importantArticles": [
        {
            "headline": "MILAN (Reuters) -Carmaker Stellantis has signed a deal with trade unions for 350 voluntary exits from its Pomigliano and Pratola Serra plants in southern Italy, the Fiom union said on Wednesday.  A spokesman for Stellantis said the layoffs involved employees close to retirement age and were in line with overall plans presented in December to the Italian government to boost its production in the country.  Fiom, which did not itself sign the agreement, said in a statement that job reductions involved 300 workers at the Pomigliano assembly plant and 50 at the Pratola Serra engine facility, both in Campania, the region comprising Naples.",
            "publication_date": "2025-04-02T10:54:39.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.7096",
            "source": "Reuters",
            "ticker": "STLA",
            "title": "Stellantis agrees 350 job cuts in southern Italy with unions",
            "url": "https://finance.yahoo.com/news/stellantis-agrees-350-job-cuts-105439506.html"
        },
        {
            "headline": "President Trump made good on his tariff promise for foreign made autos, slapping 25% tariffs across the board on foreign-made automobiles.",
            "publication_date": "2025-04-02T21:01:56.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.6369",
            "source": "Yahoo Finance",
            "ticker": "STLA",
            "title": "Trump makes good on auto tariff threat with 25% levy on foreign-made cars",
            "url": "https://finance.yahoo.com/news/trump-makes-good-on-auto-tariff-threat-with-25-levy-on-foreign-made-cars-210156415.html"
        },
        {
            "headline": "Auto workers voiced uncertainty and hope outside a Stellantis assembly plant in central Mexico that was scheduled to begin a month-long pause in production Friday as the maker of brands including Jeep and Ram assesses the potential impact of the latest U.S. tariffs on its operations.  The company had announced Thursday that it would pause production at the plant in Toluca, as well as another one in Canada.  The pauses would lead to 900 temporary layoffs at plants in Michigan and Indiana.",
            "publication_date": "2025-04-04T17:28:39.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.3818",
            "source": "Associated Press Finance",
            "ticker": "STLA",
            "title": "US tariffs ripple through auto supply chains into Mexico",
            "url": "https://finance.yahoo.com/news/us-tariffs-ripple-auto-supply-172839404.html"
        },
        {
            "headline": "General Motors and Ford reported upbeat first quarter US sales, just as the threat of tariffs portends pain ahead for the Big Three automakers.",
            "publication_date": "2025-04-01T18:29:23.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.7717",
            "source": "Yahoo Finance",
            "ticker": "STLA",
            "title": "GM, Ford report upbeat Q1 retail sales as Trump tariffs loom",
            "url": "https://finance.yahoo.com/news/gm-ford-report-upbeat-q1-retail-sales-as-trump-tariffs-loom-182750180.html"
        },
        {
            "headline": "(Bloomberg) -- Supply Lines is a daily newsletter that tracks global trade. Sign up here.Most Read from BloombergWhat Frank Lloyd Wright Learned From the DesertLondon Clears Final Hurdle for More High-Speed Trains to EuropeMetro-North Is Faster Than Acela on NYC-New Haven Route After Signal UpdatesLocal Governments Vie for Fired Federal WorkersBank Regulators Fight for Desks as OCC Returns to New York TowerMercedes-Benz Group AG is considering withdrawing its least expensive cars from the US bec",
            "publication_date": "2025-04-02T07:08:52.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.7096",
            "source": "Bloomberg",
            "ticker": "STLA",
            "title": "Mercedes Weighs Pulling US Entry-Level Cars Over Tariffs",
            "url": "https://finance.yahoo.com/news/mercedes-weighs-pulling-us-entry-153127919.html"
        },
        {
            "headline": "The major averages were sharply lower again near noon, continuing yesterday’s post-tariff slide. China has retaliated with additional tariffs of 34% on all U.S. goods a day after the Trump administration imposed its own sweeping levies. Meanwhile, the latest U.S. jobs data show that nonfarm payrolls rose by a higher-than-forecast 228,000 jobs, though the unemployment rate has ticked higher. Looking to commodities, oil prices are sharply lower due to a planned output increase promised by OPEC+ as",
            "publication_date": "2025-04-05T16:10:32.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.6808",
            "source": "TipRanks",
            "ticker": "STLA",
            "title": "China announces retaliatory tariffs, U.S. unemployment rises: Morning Buzz",
            "url": "https://finance.yahoo.com/news/china-announces-retaliatory-tariffs-u-161032836.html"
        }
    ],
    "avgScore": -0.1267,
    "todayPctChange": -0.0005146798108475617,
    "vScore": 0.006520993203438607
}