{
    "Important Articles": [
        {
            "headline": "Auto workers voiced uncertainty and hope outside a Stellantis assembly plant in central Mexico that was scheduled to begin a month-long pause in production Friday as the maker of brands including Jeep and Ram assesses the potential impact of the latest U.S. tariffs on its operations.  The company had announced Thursday that it would pause production at the plant in Toluca, as well as another one in Canada.  The pauses would lead to 900 temporary layoffs at plants in Michigan and Indiana.",
            "publication_date": "2025-04-04T17:28:39.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.3818",
            "source": "Associated Press Finance",
            "ticker": "STLA",
            "title": "US tariffs ripple through auto supply chains into Mexico",
            "url": "https://finance.yahoo.com/news/us-tariffs-ripple-auto-supply-172839404.html"
        },
        {
            "headline": "Automaker Stellantis is temporarily halting production at a plant in Canada and a plant in Mexico shortly after President Donald Trump announced a 25% tariff on imported vehicles.  Stellantis, which owns car brands like Jeep, Citroën and Ram, said Thursday it will be temporarily pausing production at the Windsor assembly plant in Canada for for the weeks of April 7 and 14.  The company will also be temporarily pausing production at the Toluca assembly plant in Mexico for the month of April, starting on April 7.",
            "publication_date": "2025-04-03T16:14:36.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.3612",
            "source": "Associated Press Finance",
            "ticker": "STLA",
            "title": "Stellantis temporarily halts production at 2 plants in Canada, Mexico as auto tariffs take effect",
            "url": "https://finance.yahoo.com/news/stellantis-temporarily-halting-production-2-161436908.html"
        },
        {
            "headline": "(Bloomberg) -- President Claudia Sheinbaum is pitching Mexico as a winner in Donald Trump’s global trade war, arguing that her positive relationship with the US leader has made it a more attractive place to invest.Most Read from BloombergHousing Agency Aims to Relocate Its DC HeadquartersMetro-North Is Faster Than Acela on NYC-New Haven Route After Signal UpdatesLocal Governments Vie for Fired Federal WorkersLondon Clears Final Hurdle for More High-Speed Trains to EuropeWhat Would ‘Transportatio",
            "publication_date": "2025-04-03T20:15:38.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.101",
            "source": "Bloomberg",
            "ticker": "STLA",
            "title": "Sheinbaum Touts Her Strong Ties to Trump to Sell CEOs on Mexico",
            "url": "https://finance.yahoo.com/news/sheinbaum-dispatches-trade-chief-washington-150229828.html"
        },
        {
            "headline": "Trump's tariffs have thrown the auto industry into turmoil, with Canada hitting back. Consumers and automakers now brace up for rising costs and disruptions.",
            "publication_date": "2025-04-04T13:58:00.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.5994",
            "source": "Zacks",
            "ticker": "STLA",
            "title": "Canada's Retaliatory Tariffs Fuel Trump's Trade War, Roil Auto Sector",
            "url": "https://finance.yahoo.com/news/canadas-retaliatory-tariffs-fuel-trumps-135800328.html"
        },
        {
            "headline": "Shuttering of Windsor plant brings reality of tariff war home",
            "publication_date": "2025-04-03T17:16:58.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.5994",
            "source": "Financial Post",
            "ticker": "STLA",
            "title": "Canada hits back with tariffs on U.S. vehicles as auto sector reels",
            "url": "https://finance.yahoo.com/news/canada-hits-back-tariffs-u-171658666.html"
        },
        {
            "headline": "(Bloomberg) -- Supply Lines is a daily newsletter that tracks global trade. Sign up here.Most Read from BloombergHousing Agency Aims to Relocate Its DC HeadquartersMetro-North Is Faster Than Acela on NYC-New Haven Route After Signal UpdatesLocal Governments Vie for Fired Federal WorkersLondon Clears Final Hurdle for More High-Speed Trains to EuropeWhat Would ‘Transportation Abundance’ Look Like?Just hours after taking effect, President Donald Trump’s 25% tariffs on imported cars are already reve",
            "publication_date": "2025-04-03T18:57:40.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.5106",
            "source": "Bloomberg",
            "ticker": "STLA",
            "title": "Carmakers Idle Plants, Rethink Prices as Trump’s Tariffs Hit",
            "url": "https://finance.yahoo.com/news/trump-25-us-auto-import-105245329.html"
        }
    ],
    "Avg Score": -0.1627666666666667
}