{
    "4 16 2025": {
        "importantArticles": [
            {
                "headline": "Chrysler is revving up for an exciting celebration marking 100 years of pioneering innovation and iconic vehicles that have shaped the American automotive landscape over the last century",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7003",
                "source": "PR Newswire",
                "ticker": "STLA",
                "title": "100 Years of Shaping Automotive History: Chrysler's Century of Innovation",
                "url": "https://finance.yahoo.com/news/100-years-shaping-automotive-history-160000931.html"
            },
            {
                "headline": "New 2025 Jeep® Wagoneer Overland package is purpose-built for challenging conditions, combining 32-inch all-terrain tires, Quadra-Lift air suspension, two-speed transfer case, skid plates and more, with a unique appearance, plus ample space and creature comforts for seven passengers and their gear",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.5719",
                "source": "PR Newswire",
                "ticker": "STLA",
                "title": "Ready for Adventure: Jeep® Brand Debuts 2025 Wagoneer Overland Special Edition",
                "url": "https://finance.yahoo.com/news/ready-adventure-jeep-brand-debuts-040100567.html"
            },
            {
                "headline": "Catch up on the top industries and stocks that were impacted, or were predicted to be impacted, by the comments, actions and policies of President Donald Trump with this daily recap compiled by The Fly: POTENTIAL TARIFF DELAY: Shares of car manufacturers Ford (F), General Motors (GM) and Stellantis (STLA) were Trump told reporters that his administration is “looking at something to help car companies” as they slowly move manufacturing to the U.S. President Donald Trump told reporters in the Oval",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.3954",
                "source": "TipRanks",
                "ticker": "STLA",
                "title": "Trump Trade: Carmakers may see tariff relief, China halts Boeing deliveries",
                "url": "https://finance.yahoo.com/news/trump-trade-carmakers-may-see-140439617.html"
            },
            {
                "headline": "Only two of the five automakers in Canada are producing vehicles at full capacity",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Financial Post",
                "ticker": "STLA",
                "title": "‘Mass uncertainty’: How Trump's tariffs are already hobbling Canada's auto sector",
                "url": "https://finance.yahoo.com/news/mass-uncertainty-trumps-tariffs-already-100005994.html"
            },
            {
                "headline": "(Bloomberg) -- The Stellantis NV assembly plant in Windsor, Ontario, rises like an industrial temple on the city’s outskirts. On a typical day, smoke drifts from its sprawling labyrinth of pipes as workers assemble Chrysler Pacifica minivans and Dodge Chargers. But the building has been eerily quiet since its doors shut last week.Most Read from BloombergHow Did This Suburb Figure Out Mass Transit?Trump Signs Executive Orders on Federal Purchasing, Office SpaceLA County Floats Leaner Budget Burde",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.1901",
                "source": "Bloomberg",
                "ticker": "STLA",
                "title": "'Like a direct attack:' Canadian auto town feels heat of tariffs",
                "url": "https://finance.yahoo.com/news/direct-attack-canadian-auto-town-130003854.html"
            },
            {
                "headline": "Catch up on the top industries and stocks that were impacted, or were predicted to be impacted, by the comments, actions and policies of President Donald Trump with this daily recap compiled by The Fly: POTENTIAL TARIFF DELAY: Shares of car manufacturers Ford (F), General Motors (GM) and Stellantis (STLA) were Trump told reporters that his administration is “looking at something to help car companies” as they slowly move manufacturing to the U.S. President Donald Trump told reporters in the Oval",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.3954",
                "source": "TipRanks",
                "ticker": "STLA",
                "title": "Trump Trade: Carmakers may see tariff relief, China halts Boeing deliveries",
                "url": "https://finance.yahoo.com/news/trump-trade-carmakers-may-see-140439617.html"
            }
        ],
        "avgScore": 0.37154
    },
    "4 15 2025": {
        "importantArticles": [
            {
                "headline": "Shares in Asian and European carmakers rose Tuesday after President Trump suggested the sector might get tariff exemptions to give it more time to restructure North American supply chains.  Hyundai advanced 4.3% in South Korea, following roughly similar gains by General Motors and Ford in the U.S. on Monday.  European automakers such as Mercedes-Benz and BMW also rose Tuesday.",
                "publication_date": "2025-04-15T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.6808",
                "source": "The Wall Street Journal",
                "ticker": "STLA",
                "title": "Global Auto Stocks Rise After Trump Hints at Tariff Pause",
                "url": "https://finance.yahoo.com/m/28005fc2-3aaa-3dbc-99c6-0bca08c5bf60/global-auto-stocks-rise-after.html"
            },
            {
                "headline": "French-Italian carmaker Stellantis has reduced its shortlist of CEO candidates to five, said two people familiar with the matter, as it nears a decision on who will lead the company through one of the industry's most tumultuous periods.  Investors are likely to seek an update on the hiring process as well as further insight into how Stellantis will manage President Donald Trump's 25% tariffs on foreign auto imports at an annual general meeting in Amsterdam later on Tuesday.  Former CEO Carlos Tavares abruptly departed the company - maker of Jeep and Peugeot brand cars - in December following a dramatic plunge in sales and profit.",
                "publication_date": "2025-04-15T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.6249",
                "source": "Reuters",
                "ticker": "STLA",
                "title": "Stellantis closing in on new CEO with shortlist of five candidates, sources say",
                "url": "https://finance.yahoo.com/news/stellantis-closing-ceo-shortlist-five-111410074.html"
            },
            {
                "headline": "New Chrysler Century of Innovation display highlights 100-year anniversary, featuring the original 1924 Chrysler Six that debuted at the 1924 National Automobile Show in New York City",
                "publication_date": "2025-04-15T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.5994",
                "source": "PR Newswire",
                "ticker": "STLA",
                "title": "Stellantis Brings Multiple Exhibits and Driving Experiences to the 2025 New York International Auto Show",
                "url": "https://finance.yahoo.com/news/stellantis-brings-multiple-exhibits-driving-195600805.html"
            },
            {
                "headline": "MILAN (Reuters) -Stellantis Chairman John Elkann said on Tuesday U.S. tariffs and strict European Union emissions standards were threatening the industry, as the automaker continued its search for a new chief executive.  \"With the current path of painful tariffs and overly rigid regulations, the American and European car industries are being put at risk,\" amid increased competition from China, Elkann said at the group's annual shareholders' meeting.  \"That would be a tragedy as car manufacturing is a source of jobs, innovation and strong communities,\" he said.",
                "publication_date": "2025-04-15T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.6369",
                "source": "Reuters",
                "ticker": "STLA",
                "title": "Stellantis chair says US tariffs, EU rules put auto industry at risk",
                "url": "https://finance.yahoo.com/news/u-europe-putting-auto-industry-122213362.html"
            },
            {
                "headline": "(Bloomberg) -- On an overcast afternoon on Canada’s east coast, Mark Carney emerged from a pickup truck and stepped carefully in his dress shoes through the muddy lot outside a lumber mill. His hard hat didn’t fit right, pitched forward at an awkward angle; an aide hustled over to fix it before he went inside.Most Read from BloombergHow Did This Suburb Figure Out Mass Transit?Even Oslo Has an Air Quality ProblemNYC Tourist Helicopter Crashes in Hudson River, Killing SixLisbon Mayor Wants Compani",
                "publication_date": "2025-04-15T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5267",
                "source": "Bloomberg",
                "ticker": "STLA",
                "title": "Carney Rides Anti-Trump Sentiment on Campaign Trail, and Voters Like It",
                "url": "https://finance.yahoo.com/news/carney-rides-anti-trump-sentiment-090000377.html"
            },
            {
                "headline": "Auto stocks jumped on Monday afternoon after President Trump hinted tariff relief might be coming.",
                "publication_date": "2025-04-15T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.4767",
                "source": "Yahoo Finance",
                "ticker": "STLA",
                "title": "Auto stocks pop as Trump says he's 'looking at something' to help car companies with tariffs",
                "url": "https://finance.yahoo.com/news/auto-stocks-pop-as-trump-says-hes-looking-at-something-to-help-car-companies-with-tariffs-180127851.html"
            }
        ],
        "avgScore": 0.24212857142857147
    },
    "4 14 2025": {
        "importantArticles": [
            {
                "headline": "Market Domination host Josh Lipton goes over some of the top stories of the day in this segment of Market Minute. Automaker stocks like General Motors (GM), Ford (F), and Stellantis (STLA) are gaining on Monday after President Trump suggested that automakers could possibly see some tariff relief. Webull (BULL) stock is skyrocketing after the company went public through a special-purpose acquisition company (SPAC) merger. DuPont (DD) was upgraded by KeyBanc to Overweight from Sector Weight, citing the company's strong balance sheet amid economic uncertainty. Stay up to date on the latest market action, minute-by-minute, with Yahoo Finance's Market Minute.",
                "publication_date": "2025-04-14T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8126",
                "source": "Yahoo Finance Video",
                "ticker": "STLA",
                "title": "Automaker stocks pop, Webull skyrockets, DuPont upgraded",
                "url": "https://finance.yahoo.com/video/automaker-stocks-pop-webull-skyrockets-182221164.html"
            },
            {
                "headline": "The retrofit solution is designed to allow the conversion of LCVs with combustion engines into EVs.",
                "publication_date": "2025-04-14T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.4939",
                "source": "Just Auto",
                "ticker": "STLA",
                "title": "Stellantis, Qinomic unveil electric retrofit solution for LCVs",
                "url": "https://finance.yahoo.com/news/stellantis-qinomic-unveil-electric-retrofit-165825254.html"
            },
            {
                "headline": "Jeep and Chrysler parent Stellantis will face greater headwinds from tariffs than its counterparts in Detroit, UBS analysts said.",
                "publication_date": "2025-04-14T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.3612",
                "source": "Investopedia",
                "ticker": "STLA",
                "title": "UBS Downgrades Stellantis Stock, Slashes Price Target on Tariff Headwinds",
                "url": "https://finance.yahoo.com/news/ubs-downgrades-stellantis-stock-slashes-173010749.html"
            },
            {
                "headline": "(Bloomberg) -- President Donald Trump’s tariff exclusions for smartphones and other tech products have added to a growing set of confusing signals for companies and trading partners digesting how to engage a White House still promising to negotiate dozens of new deals in America’s favor.Most Read from BloombergHow Did This Suburb Figure Out Mass Transit?The Secret Formula for Faster TrainsEven Oslo Has an Air Quality ProblemNYC Tourist Helicopter Crashes in Hudson River, Killing SixLisbon Mayor",
                "publication_date": "2025-04-14T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.128",
                "source": "Bloomberg",
                "ticker": "STLA",
                "title": "Trump’s Tangled Tariffs Sow Confusion as Negotiators Line Up",
                "url": "https://finance.yahoo.com/news/trump-tangled-tariffs-sow-confusion-122723925.html"
            },
            {
                "headline": "Jeep and Chrysler parent Stellantis will face greater headwinds from tariffs than its counterparts in Detroit, UBS analysts said.",
                "publication_date": "2025-04-14T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.3612",
                "source": "Investopedia",
                "ticker": "STLA",
                "title": "UBS Downgrades Stellantis Stock, Slashes Price Target on Tariff Headwinds",
                "url": "https://finance.yahoo.com/news/ubs-downgrades-stellantis-stock-slashes-173010749.html"
            },
            {
                "headline": "The retrofit solution is designed to allow the conversion of LCVs with combustion engines into EVs.",
                "publication_date": "2025-04-14T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.4939",
                "source": "Just Auto",
                "ticker": "STLA",
                "title": "Stellantis, Qinomic unveil electric retrofit solution for LCVs",
                "url": "https://finance.yahoo.com/news/stellantis-qinomic-unveil-electric-retrofit-165825254.html"
            }
        ],
        "avgScore": 0.38492499999999996
    },
    "4 11 2025": {
        "importantArticles": [
            {
                "headline": "We recently published a list of 10 Best Economic Recovery Stocks to Buy. In this article, we are going to take a look at where ​​Stellantis N.V. (NYSE:STLA) stands against other best economic recovery stocks to buy. Economic cycles, as defined by economists, alternate between periods of growth, peak, recession, and recovery, depending on the […]",
                "publication_date": "2025-04-11T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8481",
                "source": "Insider Monkey",
                "ticker": "STLA",
                "title": "Is Stellantis (STLA) the Best Economic Recovery Stock to Buy?",
                "url": "https://finance.yahoo.com/news/stellantis-stla-best-economic-recovery-212555536.html"
            },
            {
                "headline": "🔎 JP Morgan (JPM): Shares in the bank rallied Friday morning after it posted better-than-expected quarterly earnings. Chief Executive Jamie Dimon said the \"economy is facing considerable turbulence.\" Wells Fargo (WFC) also posted above-forecast net income, but shares fell.",
                "publication_date": "2025-04-11T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.6875",
                "source": "The Wall Street Journal",
                "ticker": "STLA",
                "title": "Stocks to Watch Friday: JPMorgan, Wells Fargo, BlackRock, Novartis",
                "url": "https://finance.yahoo.com/m/f55e4098-d52e-3a3b-86cd-f17b406c18b6/stocks-to-watch-friday-.html"
            },
            {
                "headline": "Jeep® brand and Jeep Performance Parts (JPP) by Mopar head to Moab, Utah, April 12-20 with even more vehicles and experiences for Jeep customers and off-road enthusiasts",
                "publication_date": "2025-04-11T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.34",
                "source": "PR Newswire",
                "ticker": "STLA",
                "title": "Jeep® Brand and Jeep Performance Parts (JPP) by Mopar Gear Up to Hit the Town and Trails at the 59th Annual Easter Jeep Safari",
                "url": "https://finance.yahoo.com/news/jeep-brand-jeep-performance-parts-040100674.html"
            },
            {
                "headline": "MILAN (Reuters) -Stellantis' global shipments fell 9% year-on-year in the first quarter to an estimated 1.2 million vehicles, it said on Friday, after a 12% drop in 2024.  The world's fourth-largest automaker said the first-quarter drop primarily reflected lower North American production, due to extended holiday downtime in January, as well as product transitions and lower van sales in Europe.  In the first three months of 2025, Stellantis' shipments were down 20% in North America and 8% in its so-called Enlarged Europe area, it said in a statement.",
                "publication_date": "2025-04-11T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.4215",
                "source": "Reuters",
                "ticker": "STLA",
                "title": "Stellantis' first-quarter shipments fall 9% to 1.2 million vehicles",
                "url": "https://finance.yahoo.com/news/stellantis-first-quarter-shipments-fall-060038385.html"
            },
            {
                "headline": "Carmaker Stellantis remains committed to its ailing luxury brand Maserati even as U.S. tariffs complicate the situation for the automotive industry in general, the brand's head said on Friday.  A spokesman for Stellantis said earlier this week the group had hired consultant McKinsey to advise on the effects of the recently announced tariffs for Maserati and Alfa Romeo as the two brands prepare future plans.  The news reignited speculation about the future of Maserati, which in 2024 more than halved its output to just 11,300 vehicles and went into the red with a 260 million euro ($295.83 million) operating loss.",
                "publication_date": "2025-04-11T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.0516",
                "source": "Reuters",
                "ticker": "STLA",
                "title": "Maserati CEO says Stellantis remains committed to brand",
                "url": "https://finance.yahoo.com/news/stellantis-remains-committed-maserati-brand-133922359.html"
            },
            {
                "headline": "The auto giant, which houses brands including Jeep, Ram, Chrysler, Fiat and Peugeot, said vehicle shipments in North America fell 20%.",
                "publication_date": "2025-04-11T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "The Wall Street Journal",
                "ticker": "STLA",
                "title": "Stellantis Shipments Fall 9% on Lower North American Production",
                "url": "https://finance.yahoo.com/m/7839ac0b-2eb7-3dba-81c6-06bb1adbc8cf/stellantis-shipments-fall-9-.html"
            }
        ],
        "avgScore": 0.20035714285714287
    },
    "4 10 2025": {
        "importantArticles": [
            {
                "headline": "European stocks climbed, echoing Wednesday's U.S. rally after President Trump's tariff pause.    The benchmark Stoxx Europe 600 shot up 3.7%, its biggest one-day gains since March 2022.   Country-specific indexes also rallied.",
                "publication_date": "2025-04-10T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.34",
                "source": "The Wall Street Journal",
                "ticker": "STLA",
                "title": "Tariff Delay Lifts European Markets; Bank Stocks Rally",
                "url": "https://finance.yahoo.com/m/7425a3bd-a941-34b4-bc0f-97d5cdee86a4/tariff-delay-lifts-european.html"
            },
            {
                "headline": "Auto stocks pulled higher after President Trump backed off and announced a 90-day pause on tariffs for most countries, yet at the same time he increased levies on China, and kept auto tariffs in place.",
                "publication_date": "2025-04-10T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.296",
                "source": "Yahoo Finance",
                "ticker": "STLA",
                "title": "Auto stocks pull higher as Trump reverses on reciprocal duties, but auto tariffs remain",
                "url": "https://finance.yahoo.com/news/auto-stocks-pull-higher-as-trump-reverses-on-reciprocal-duties-but-auto-tariffs-remain-192700279.html"
            },
            {
                "headline": "The Dutch auto conglomerate will clarify that its cars are assembled, not “built,” in U.S. factories.",
                "publication_date": "2025-04-10T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "The Wall Street Journal",
                "ticker": "STLA",
                "title": "Stellantis to Revise Ads Saying Its Cars Are Built in America",
                "url": "https://finance.yahoo.com/m/19cc24b6-0c84-3744-b07f-b2f99006606f/stellantis-to-revise-ads.html"
            },
            {
                "headline": "The Dutch auto conglomerate will clarify that its cars are assembled, not “built,” in U.S. factories.",
                "publication_date": "2025-04-10T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "The Wall Street Journal",
                "ticker": "STLA",
                "title": "Stellantis to Revise Ads Saying Its Cars Are Built in America",
                "url": "https://finance.yahoo.com/m/19cc24b6-0c84-3744-b07f-b2f99006606f/stellantis-to-revise-ads.html"
            },
            {
                "headline": "Auto stocks pulled higher after President Trump backed off and announced a 90-day pause on tariffs for most countries, yet at the same time he increased levies on China, and kept auto tariffs in place.",
                "publication_date": "2025-04-10T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.296",
                "source": "Yahoo Finance",
                "ticker": "STLA",
                "title": "Auto stocks pull higher as Trump reverses on reciprocal duties, but auto tariffs remain",
                "url": "https://finance.yahoo.com/news/auto-stocks-pull-higher-as-trump-reverses-on-reciprocal-duties-but-auto-tariffs-remain-192700279.html"
            },
            {
                "headline": "European stocks climbed, echoing Wednesday's U.S. rally after President Trump's tariff pause.    The benchmark Stoxx Europe 600 shot up 3.7%, its biggest one-day gains since March 2022.   Country-specific indexes also rallied.",
                "publication_date": "2025-04-10T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.34",
                "source": "The Wall Street Journal",
                "ticker": "STLA",
                "title": "Tariff Delay Lifts European Markets; Bank Stocks Rally",
                "url": "https://finance.yahoo.com/m/7425a3bd-a941-34b4-bc0f-97d5cdee86a4/tariff-delay-lifts-european.html"
            }
        ],
        "avgScore": 0.212
    },
    "4 9 2025": {
        "importantArticles": [
            {
                "headline": "The Big Three automakers — Ford (F), General Motors (GM), and Stellantis (STLA) — are the most exposed to US President Trump's auto tariffs, even when compared to foreign automakers, according to auto data firm JATO Dynamics. Senior Autos Reporter Pras Subramanian joins Julie Hyman and Josh Lipton on Market Domination Overtime to take a closer look at the auto sector. To watch more expert insights and analysis on the latest market action, check out more Market Domination Overtime here.",
                "publication_date": "2025-04-09T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0276",
                "source": "Yahoo Finance Video",
                "ticker": "STLA",
                "title": "Why auto tariffs will be extra harsh on Ford, GM, & Stellantis",
                "url": "https://finance.yahoo.com/video/why-auto-tariffs-extra-harsh-215733894.html"
            },
            {
                "headline": "The company is considering alternative production options within Europe for the Leapmotor vehicle.",
                "publication_date": "2025-04-09T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Just Auto",
                "ticker": "STLA",
                "title": "Stellantis halts Leapmotor EV production in Poland",
                "url": "https://finance.yahoo.com/news/stellantis-halts-leapmotor-ev-production-114652732.html"
            },
            {
                "headline": "The latest investor updates on stocks that are trending on Wednesday.",
                "publication_date": "2025-04-09T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Yahoo Finance UK",
                "ticker": "STLA",
                "title": "Trending tickers: Apple, Advanced Micro Devices, Ford, BP and AstraZeneca",
                "url": "https://finance.yahoo.com/news/apple-advanced-micro-devices-ford-bp-astrazeneca-trending-tickers-093254195.html"
            },
            {
                "headline": "The latest investor updates on stocks that are trending on Wednesday.",
                "publication_date": "2025-04-09T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Yahoo Finance UK",
                "ticker": "STLA",
                "title": "Trending tickers: Apple, Advanced Micro Devices, Ford, BP and AstraZeneca",
                "url": "https://finance.yahoo.com/news/apple-advanced-micro-devices-ford-bp-astrazeneca-trending-tickers-093254195.html"
            },
            {
                "headline": "The company is considering alternative production options within Europe for the Leapmotor vehicle.",
                "publication_date": "2025-04-09T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Just Auto",
                "ticker": "STLA",
                "title": "Stellantis halts Leapmotor EV production in Poland",
                "url": "https://finance.yahoo.com/news/stellantis-halts-leapmotor-ev-production-114652732.html"
            },
            {
                "headline": "The Big Three automakers — Ford (F), General Motors (GM), and Stellantis (STLA) — are the most exposed to US President Trump's auto tariffs, even when compared to foreign automakers, according to auto data firm JATO Dynamics. Senior Autos Reporter Pras Subramanian joins Julie Hyman and Josh Lipton on Market Domination Overtime to take a closer look at the auto sector. To watch more expert insights and analysis on the latest market action, check out more Market Domination Overtime here.",
                "publication_date": "2025-04-09T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0276",
                "source": "Yahoo Finance Video",
                "ticker": "STLA",
                "title": "Why auto tariffs will be extra harsh on Ford, GM, & Stellantis",
                "url": "https://finance.yahoo.com/video/why-auto-tariffs-extra-harsh-215733894.html"
            }
        ],
        "avgScore": 0.0092
    },
    "4 8 2025": {
        "importantArticles": [
            {
                "headline": "Remanufacturing revives used products to meet OEM standards, ensuring performance and warranty on par with new parts.",
                "publication_date": "2025-04-08T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.5719",
                "source": "Just Auto",
                "ticker": "STLA",
                "title": "Stellantis and Valeo unveils remanufactured LED headlamp and display screen",
                "url": "https://finance.yahoo.com/news/stellantis-valeo-unveils-remanufactured-led-181718547.html"
            },
            {
                "headline": "Stellantis has stopped making its Chinese partner Leapmotor's T03 small electric car in Poland and is assessing alternative production options, the Franco-Italian automaker said on Tuesday.  The group \"is no longer assembling Leapmotor's T03 model at the Tychy plant, in Poland, since March 30,\" it said in a statement.  \"While the company remains fully engaged in the launch of Leapmotor vehicles in Europe, at the moment it is evaluating different production options,\" Stellantis said, without providing further details, including whether the model might be relocated to another European plant.",
                "publication_date": "2025-04-08T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "-0.0276",
                "source": "Reuters",
                "ticker": "STLA",
                "title": "Stellantis stops making Leapmotor EV in Poland, eyes other options",
                "url": "https://finance.yahoo.com/news/stellantis-says-stopped-making-small-112442804.html"
            },
            {
                "headline": "President Trump's tariff plans have walloped auto stocks. Shares of the big three automakers (F, GM, STLA) all closed lower again on Monday. Yahoo Finance Autos Reporter Pras Subramanian reports the latest in the video above.&nbsp; To watch more expert insights and analysis on the latest market action, check out more Market Domination Overtime here.",
                "publication_date": "2025-04-08T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.1226",
                "source": "Yahoo Finance Video",
                "ticker": "STLA",
                "title": "Auto stocks have been clobbered by Trump's tariffs",
                "url": "https://finance.yahoo.com/video/auto-stocks-clobbered-trumps-tariffs-203056273.html"
            },
            {
                "headline": "Catch up on the top industries and stocks that were impacted, or were predicted to be impacted, by the comments, actions and policies of President Donald Trump with this daily recap compiled by The Fly: TRUMP SAYS NO INFLATION: President Trump said via Truth Social, “Oil prices are down, interest rates are down (the slow moving Fed should cut rates!), food prices are down, there is NO INFLATION, and the long time abused USA is bringing in Billions of Dollars a week from the abusing countries on",
                "publication_date": "2025-04-08T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.8155",
                "source": "TipRanks",
                "ticker": "STLA",
                "title": "Trump Trade: Trump claims ‘no inflation,’ Medicare won’t cover obesity drugs",
                "url": "https://finance.yahoo.com/news/trump-trade-trump-claims-no-142755841.html"
            },
            {
                "headline": "Stellantis (STLA), the automaker behind Jeep, has said it will absorb some of its suppliers’ costs from President Donald Trump’s tariffs — one of the first indicators of how the auto industry is responding to the president’s trade war.",
                "publication_date": "2025-04-08T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5994",
                "source": "Quartz",
                "ticker": "STLA",
                "title": "Stellantis will help suppliers offset the cost of tariffs, report says",
                "url": "https://finance.yahoo.com/news/stellantis-help-suppliers-offset-cost-194400069.html"
            },
            {
                "headline": "Stellantis' Italian auto production dropped further in the first quarter after output in the country fell to an almost 70-year low in 2024, the FIM Cisl union said on Tuesday, as new models will not support activity before next year.  Vehicle production in the January-March period, comprising passenger cars and vans was down 35.5% compared to a year earlier to around 110,000 units, the union said in a quarterly report.  Activity contracted in all the six assembly plants the automaker runs in Italy, it added.",
                "publication_date": "2025-04-08T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.4731",
                "source": "Reuters",
                "ticker": "STLA",
                "title": "Stellantis output in Italy fell further in first quarter, union says",
                "url": "https://finance.yahoo.com/news/stellantis-output-italy-fell-further-112020031.html"
            }
        ],
        "avgScore": -0.23108571428571428
    },
    "4 7 2025": {
        "importantArticles": [
            {
                "headline": "With one in 10 jobs dependent on the auto industry, the state is already feeling the effects of tariffs. Automakers and factory workers are tightening their belts, even as many locals hope the short-term pain will lead to long-term gain.",
                "publication_date": "2025-04-07T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.5423",
                "source": "The Wall Street Journal",
                "ticker": "STLA",
                "title": "The First Victim of Trump’s Trade War: Michigan’s Economy",
                "url": "https://finance.yahoo.com/m/8160e7f9-788f-3e4d-8b51-d74f1c6d5e2d/the-first-victim-of-trump%E2%80%99s.html"
            },
            {
                "headline": "Auto stocks continued their downward slide on Monday as the sector, heavily exposed to tariffs, looks for a bottom.",
                "publication_date": "2025-04-07T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.0772",
                "source": "Yahoo Finance",
                "ticker": "STLA",
                "title": "Auto stocks continue slide as tariff impact threatens to decimate sales",
                "url": "https://finance.yahoo.com/news/auto-stocks-continue-slide-as-tariff-impact-threatens-to-decimate-sales-185757899.html"
            },
            {
                "headline": "Auto stocks continued their downward slide on Monday as the sector, heavily exposed to tariffs, looks for a bottom.",
                "publication_date": "2025-04-07T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.0772",
                "source": "Yahoo Finance",
                "ticker": "STLA",
                "title": "Auto stocks continue slide as tariff impact threatens to decimate sales",
                "url": "https://finance.yahoo.com/news/auto-stocks-continue-slide-as-tariff-impact-threatens-to-decimate-sales-185757899.html"
            },
            {
                "headline": "With one in 10 jobs dependent on the auto industry, the state is already feeling the effects of tariffs. Automakers and factory workers are tightening their belts, even as many locals hope the short-term pain will lead to long-term gain.",
                "publication_date": "2025-04-07T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.5423",
                "source": "The Wall Street Journal",
                "ticker": "STLA",
                "title": "The First Victim of Trump’s Trade War: Michigan’s Economy",
                "url": "https://finance.yahoo.com/m/8160e7f9-788f-3e4d-8b51-d74f1c6d5e2d/the-first-victim-of-trump%E2%80%99s.html"
            }
        ],
        "avgScore": 0.23255
    },
    "4 4 2025": {
        "importantArticles": [
            {
                "headline": "Stellantis, owner of Jeep and Ram, plans to extend its employee-discount program to the broader public on most new models, the latest move by carmakers to stoke sales following the Trump administration’s tariffs on the automotive sector.  The program is effective Friday and covers the company's most popular models, including the Jeep Wrangler SUV and Ram light-duty pickup trucks, according to a memo seen by The Wall Street Journal.  Stellantis said Thursday it would temporarily pause production at a minivan factory in Windsor, Canada and a Jeep plant in Mexico in response to the tariffs.",
                "publication_date": "2025-04-04T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7841",
                "source": "The Wall Street Journal",
                "ticker": "STLA",
                "title": "Exclusive: Jeep's Parent to Offer Most Buyers Same Discount Deal as Employees",
                "url": "https://finance.yahoo.com/m/f2f39ac2-0ffa-3b1e-894a-f55ccec39189/exclusive-jeep-s-parent-to.html"
            },
            {
                "headline": "Ford Motor is leaning into the tariff moment with a new ad campaign that highlights its American-made vehicles and extends its employee discounts to the wider buying public.  For its EVs, Ford is throwing in a home charger and free installation.  Employee discounts can shave several thousand dollars off the price of a new car or truck.",
                "publication_date": "2025-04-04T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.5859",
                "source": "The Wall Street Journal",
                "ticker": "STLA",
                "title": "Ford Offers Its Employee Discount to All New Car Buyers",
                "url": "https://finance.yahoo.com/m/6c494d1d-5fae-3523-8745-5103b8b19f01/ford-offers-its-employee.html"
            },
            {
                "headline": "Auto workers voiced uncertainty and hope outside a Stellantis assembly plant in central Mexico that was scheduled to begin a month-long pause in production Friday as the maker of brands including Jeep and Ram assesses the potential impact of the latest U.S. tariffs on its operations.  The company had announced Thursday that it would pause production at the plant in Toluca, as well as another one in Canada.  The pauses would lead to 900 temporary layoffs at plants in Michigan and Indiana.",
                "publication_date": "2025-04-04T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.3818",
                "source": "Associated Press Finance",
                "ticker": "STLA",
                "title": "US tariffs ripple through auto supply chains into Mexico",
                "url": "https://finance.yahoo.com/news/us-tariffs-ripple-auto-supply-172839404.html"
            },
            {
                "headline": "Trump's tariffs have thrown the auto industry into turmoil, with Canada hitting back. Consumers and automakers now brace up for rising costs and disruptions.",
                "publication_date": "2025-04-04T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5994",
                "source": "Zacks",
                "ticker": "STLA",
                "title": "Canada's Retaliatory Tariffs Fuel Trump's Trade War, Roil Auto Sector",
                "url": "https://finance.yahoo.com/news/canadas-retaliatory-tariffs-fuel-trumps-135800328.html"
            },
            {
                "headline": "Investing.com -- On Thursday, Fitch Ratings announced a downgrade of Stellantis NV's (NYSE:STLA) Long-Term Issuer Default Rating (IDR) and senior unsecured rating to 'BBB' from 'BBB+'. The outlook for the auto manufacturer remains stable despite the downgrade, which was prompted by deteriorating market conditions in North America and rising cost pressures from new tariffs.",
                "publication_date": "2025-04-04T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.4019",
                "source": "Investing.com",
                "ticker": "STLA",
                "title": "Fitch cuts Stellantis stock rating to 'BBB'",
                "url": "https://finance.yahoo.com/news/fitch-cuts-stellantis-stock-rating-200758745.html"
            },
            {
                "headline": "(Reuters) -Automakers are offering deals to anxious customers to ride a short-term surge in shopping, while also warning lawmakers that they will have to raise prices dramatically if tariffs remain in place for long.  Chrysler parent Stellantis said on Friday it would extend its employee-discount program to the wider market on some new models, following a similar move from Ford Motor which was first reported by Reuters on Wednesday.  U.S. President Donald Trump's 25% tariffs on automotive imports, and a 10% baseline tariff on all imports, have sent car companies scrambling.",
                "publication_date": "2025-04-04T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.4019",
                "source": "Reuters",
                "ticker": "STLA",
                "title": "Automakers provide stable pricing for now, but warn of future hikes",
                "url": "https://finance.yahoo.com/news/stellantis-extends-employee-discount-public-145032066.html"
            }
        ],
        "avgScore": 0.025163636363636367
    },
    "4 3 2025": {
        "importantArticles": [
            {
                "headline": "President Trump made good on his tariff promise for foreign made autos, slapping 25% tariffs across the board on foreign-made automobiles.",
                "publication_date": "2025-04-03T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.6369",
                "source": "Yahoo Finance",
                "ticker": "STLA",
                "title": "Trump makes good on auto tariff threat with 25% levy on foreign-made cars",
                "url": "https://finance.yahoo.com/news/trump-makes-good-on-auto-tariff-threat-with-25-levy-on-foreign-made-cars-210156415.html"
            },
            {
                "headline": "Automaker Stellantis is temporarily halting production at a plant in Canada and a plant in Mexico shortly after President Donald Trump announced a 25% tariff on imported vehicles.  Stellantis, which owns car brands like Jeep, Citroën and Ram, said Thursday it will be temporarily pausing production at the Windsor assembly plant in Canada for for the weeks of April 7 and 14.  The company will also be temporarily pausing production at the Toluca assembly plant in Mexico for the month of April, starting on April 7.",
                "publication_date": "2025-04-03T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.3612",
                "source": "Associated Press Finance",
                "ticker": "STLA",
                "title": "Stellantis temporarily halts production at 2 plants in Canada, Mexico as auto tariffs take effect",
                "url": "https://finance.yahoo.com/news/stellantis-temporarily-halting-production-2-161436908.html"
            },
            {
                "headline": "The array of automotive parts that President Trump plans to tariff is more extensive than the industry expected, raising concerns about significant cost increases for U.S.-built vehicles.  As part of Trump’s tariff announcement Wednesday, the administration published a list of auto parts that would be subject to 25% tariffs starting May 3.  The parts list is “more extensive than feared,” Bernstein financial analyst Daniel Roeska wrote in a research note following Trump’s announcement.",
                "publication_date": "2025-04-03T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.2023",
                "source": "The Wall Street Journal",
                "ticker": "STLA",
                "title": "Trump Tariffs to Hit Many Auto Parts",
                "url": "https://finance.yahoo.com/m/8fa09341-a8fb-370d-802e-d116d20090dc/trump-tariffs-to-hit-many.html"
            },
            {
                "headline": "Shuttering of Windsor plant brings reality of tariff war home",
                "publication_date": "2025-04-03T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5994",
                "source": "Financial Post",
                "ticker": "STLA",
                "title": "Canada hits back with tariffs on U.S. vehicles as auto sector reels",
                "url": "https://finance.yahoo.com/news/canada-hits-back-tariffs-u-171658666.html"
            },
            {
                "headline": "(Bloomberg) -- Supply Lines is a daily newsletter that tracks global trade. Sign up here.Most Read from BloombergHousing Agency Aims to Relocate Its DC HeadquartersMetro-North Is Faster Than Acela on NYC-New Haven Route After Signal UpdatesLocal Governments Vie for Fired Federal WorkersLondon Clears Final Hurdle for More High-Speed Trains to EuropeWhat Would ‘Transportation Abundance’ Look Like?Just hours after taking effect, President Donald Trump’s 25% tariffs on imported cars are already reve",
                "publication_date": "2025-04-03T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5106",
                "source": "Bloomberg",
                "ticker": "STLA",
                "title": "Carmakers Idle Plants, Rethink Prices as Trump’s Tariffs Hit",
                "url": "https://finance.yahoo.com/news/trump-25-us-auto-import-105245329.html"
            },
            {
                "headline": "Stellantis is temporarily halting production at factories in Mexico and Canada as the automaker adjusts to President Donald Trump's auto tariffs.  The parent company of Jeep, Chrysler, Dodge and Ram brands will idle its minivan plant in Windsor, Ontario, for two weeks, The Wall Street Journal reported.  Also, a Jeep plant in Toluca, Mexico, will stop work for the rest of April, according to an email from the company's North American chief, Antonio Filosa.",
                "publication_date": "2025-04-03T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.296",
                "source": "Investor's Business Daily",
                "ticker": "STLA",
                "title": "Auto Tariffs Force Ram, Jeep-Maker To Idle These Factories",
                "url": "https://finance.yahoo.com/m/735c30df-f88f-3bbb-983d-d3390629252c/auto-tariffs-force-ram-.html"
            }
        ],
        "avgScore": -0.01713333333333335
    },
    "4 2 2025": {
        "importantArticles": [
            {
                "headline": "MILAN (Reuters) -Carmaker Stellantis has signed a deal with trade unions for 350 voluntary exits from its Pomigliano and Pratola Serra plants in southern Italy, the Fiom union said on Wednesday.  A spokesman for Stellantis said the layoffs involved employees close to retirement age and were in line with overall plans presented in December to the Italian government to boost its production in the country.  Fiom, which did not itself sign the agreement, said in a statement that job reductions involved 300 workers at the Pomigliano assembly plant and 50 at the Pratola Serra engine facility, both in Campania, the region comprising Naples.",
                "publication_date": "2025-04-02T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7096",
                "source": "Reuters",
                "ticker": "STLA",
                "title": "Stellantis agrees 350 job cuts in southern Italy with unions",
                "url": "https://finance.yahoo.com/news/stellantis-agrees-350-job-cuts-105439506.html"
            },
            {
                "headline": "↗️ Tesla (TSLA): Shares dropped early after the e-vehicle maker's first-quarter deliveries fell more than expected, then recovered after Politico reported that President Trump has told advisers that Tesla CEO Elon Musk would step back from his political work in coming weeks.",
                "publication_date": "2025-04-02T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.296",
                "source": "The Wall Street Journal",
                "ticker": "STLA",
                "title": "Stocks to Watch Wednesday: Tesla, Nvidia, Newsmax",
                "url": "https://finance.yahoo.com/m/f453e4bd-ece5-32c0-834a-b79041ac6cd4/stocks-to-watch-wednesday-.html"
            },
            {
                "headline": "March was the first month China's Leapmotor, partly owned by Stellantis, became the top-seller among the country's EV startups.",
                "publication_date": "2025-04-02T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Automotive News",
                "ticker": "STLA",
                "title": "Stellantis-backed Leapmotor becomes top-seller among Chinese EV startups in March",
                "url": "https://finance.yahoo.com/news/stellantis-backed-leapmotor-becomes-top-175818204.html"
            },
            {
                "headline": "(Bloomberg) -- Supply Lines is a daily newsletter that tracks global trade. Sign up here.Most Read from BloombergWhat Frank Lloyd Wright Learned From the DesertLondon Clears Final Hurdle for More High-Speed Trains to EuropeMetro-North Is Faster Than Acela on NYC-New Haven Route After Signal UpdatesLocal Governments Vie for Fired Federal WorkersBank Regulators Fight for Desks as OCC Returns to New York TowerMercedes-Benz Group AG is considering withdrawing its least expensive cars from the US bec",
                "publication_date": "2025-04-02T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.7096",
                "source": "Bloomberg",
                "ticker": "STLA",
                "title": "Mercedes Weighs Pulling US Entry-Level Cars Over Tariffs",
                "url": "https://finance.yahoo.com/news/mercedes-weighs-pulling-us-entry-153127919.html"
            },
            {
                "headline": "(Bloomberg) -- Beaten-down corporate bonds from automakers could rally after Wednesday’s tariff announcement from US President Donald Trump, making the debt an attractive purchase, according to JPMorgan Chase & Co.Most Read from BloombergMetro-North Is Faster Than Acela on NYC-New Haven Route After Signal UpdatesLondon Clears Final Hurdle for More High-Speed Trains to EuropeWhat Frank Lloyd Wright Learned From the DesertLocal Governments Vie for Fired Federal WorkersChicago School District Agree",
                "publication_date": "2025-04-02T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.1027",
                "source": "Bloomberg",
                "ticker": "STLA",
                "title": "JPMorgan’s Tariff-Day Trade Is Going Long on Automaker Bonds",
                "url": "https://finance.yahoo.com/news/jpmorgan-tariff-day-trade-going-160204744.html"
            },
            {
                "headline": "First-quarter 2025 total U.S. sales decreased 12% year over year",
                "publication_date": "2025-04-02T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "PR Newswire",
                "ticker": "STLA",
                "title": "FCA US Reports First-quarter 2025 US Sales Results",
                "url": "https://finance.yahoo.com/news/fca-us-reports-first-quarter-235000079.html"
            }
        ],
        "avgScore": 0.03221666666666667
    },
    "4 1 2025": {
        "importantArticles": [
            {
                "headline": "We recently compiled a list of the 10 Best EV Stocks to Buy Under $50. In this article, we are going to take a look at where Stellantis N.V. (NYSE:STLA) stands against the other EV stocks under $50. Electric vehicle (EV) sales continue to grow but at a slower pace than many had previously expected. […]",
                "publication_date": "2025-04-01T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.3818",
                "source": "Insider Monkey",
                "ticker": "STLA",
                "title": "Is Stellantis N.V. (STLA) The Best EV Stock to Buy Under $50?",
                "url": "https://finance.yahoo.com/news/stellantis-n-v-stla-best-165416715.html"
            },
            {
                "headline": "Wayne Griffiths, CEO of Volkswagen’s Spanish subsidiary SEAT and father of the Cupra brand, stepped down at his own request “to pursue new challenges.”",
                "publication_date": "2025-04-01T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Fortune",
                "ticker": "STLA",
                "title": "The mastermind behind Europe’s hottest new car brand is leaving Volkswagen in a shock departure",
                "url": "https://finance.yahoo.com/news/mastermind-behind-europe-hottest-car-174536947.html"
            },
            {
                "headline": "Companies In The News Are: STLA, TSLA, COOP, RKT, SGML.",
                "publication_date": "2025-04-01T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Zacks",
                "ticker": "STLA",
                "title": "Company News for Apr 1, 2025",
                "url": "https://finance.yahoo.com/news/company-news-apr-1-2025-093100353.html"
            },
            {
                "headline": "General Motors and Ford reported upbeat first quarter US sales, just as the threat of tariffs portends pain ahead for the Big Three automakers.",
                "publication_date": "2025-04-01T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.7717",
                "source": "Yahoo Finance",
                "ticker": "STLA",
                "title": "GM, Ford report upbeat Q1 retail sales as Trump tariffs loom",
                "url": "https://finance.yahoo.com/news/gm-ford-report-upbeat-q1-retail-sales-as-trump-tariffs-loom-182750180.html"
            },
            {
                "headline": "US automakers are making a last-ditch effort to sway the Trump administration on tariffs set to take effect this week, contending that levies on the thousands of parts they source abroad could have catastrophic effects on the industry.",
                "publication_date": "2025-04-01T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.4939",
                "source": "Bloomberg",
                "ticker": "STLA",
                "title": "US automakers make mad dash to persuade Trump to temper tariffs",
                "url": "https://finance.yahoo.com/news/us-automakers-mad-dash-persuade-013847428.html"
            },
            {
                "headline": "Companies In The News Are: STLA, TSLA, COOP, RKT, SGML.",
                "publication_date": "2025-04-01T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Zacks",
                "ticker": "STLA",
                "title": "Company News for Apr 1, 2025",
                "url": "https://finance.yahoo.com/news/company-news-apr-1-2025-093100353.html"
            }
        ],
        "avgScore": -0.17676000000000003
    },
    "3 31 2025": {
        "importantArticles": [
            {
                "headline": "President Trump’s auto tariffs have customers and dealers spooked.",
                "publication_date": "2025-03-31T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Yahoo Finance",
                "ticker": "STLA",
                "title": "Car dealer: 'Afraid' buyers are rushing to purchase cars ahead of tariffs",
                "url": "https://finance.yahoo.com/news/car-dealer-afraid-buyers-are-rushing-to-purchase-cars-ahead-of-tariffs-144014529.html"
            },
            {
                "headline": "President Trump’s auto tariffs have customers and dealers spooked.",
                "publication_date": "2025-03-31T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Yahoo Finance",
                "ticker": "STLA",
                "title": "Car dealer: 'Afraid' buyers are rushing to purchase cars ahead of tariffs",
                "url": "https://finance.yahoo.com/news/car-dealer-afraid-buyers-are-rushing-to-purchase-cars-ahead-of-tariffs-144014529.html"
            }
        ],
        "avgScore": 0.0
    },
    "3 28 2025": {
        "importantArticles": [
            {
                "headline": "President Trump made good on his promise to impose tariffs on foreign automakers.",
                "publication_date": "2025-03-28T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.4588",
                "source": "Yahoo Finance",
                "ticker": "STLA",
                "title": "GM, Ford stocks reel after Trump announces 25% auto tariffs on foreign-made vehicles, certain parts",
                "url": "https://finance.yahoo.com/news/gm-ford-stocks-reel-after-trump-announces-25-auto-tariffs-on-foreign-made-vehicles-certain-parts-134341668.html"
            },
            {
                "headline": "Parent company Stellantis said it would now transfer ‘machinery and process knowledge’ to its plant in Ellesmere Port, Cheshire.",
                "publication_date": "2025-03-28T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "PA Media: Money",
                "ticker": "STLA",
                "title": "Vauxhall closes van-making factory in Luton",
                "url": "https://finance.yahoo.com/news/vauxhall-closes-van-making-factory-162631046.html"
            },
            {
                "headline": "The US auto industry faces uncertainty with President Trump's upcoming 25% tariffs set to begin next week. TD Cowen analyst Itay Michaeli joins Catalysts host Madison Mills and Basenese Group founder Lou Basenese to discuss the potential impact. To watch more expert insights and analysis on the latest market action, check out more Morning Brief&nbsp;here.",
                "publication_date": "2025-03-28T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.34",
                "source": "Yahoo Finance Video",
                "ticker": "STLA",
                "title": "Auto tariffs are 'close to the worst outcome' for automakers",
                "url": "https://finance.yahoo.com/video/auto-tariffs-close-worst-outcome-170000514.html"
            },
            {
                "headline": "The US auto industry faces uncertainty with President Trump's upcoming 25% tariffs set to begin next week. TD Cowen analyst Itay Michaeli joins Catalysts host Madison Mills and Basenese Group founder Lou Basenese to discuss the potential impact. To watch more expert insights and analysis on the latest market action, check out more Morning Brief&nbsp;here.",
                "publication_date": "2025-03-28T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.34",
                "source": "Yahoo Finance Video",
                "ticker": "STLA",
                "title": "Auto tariffs are 'close to the worst outcome' for automakers",
                "url": "https://finance.yahoo.com/video/auto-tariffs-close-worst-outcome-170000514.html"
            },
            {
                "headline": "Parent company Stellantis said it would now transfer ‘machinery and process knowledge’ to its plant in Ellesmere Port, Cheshire.",
                "publication_date": "2025-03-28T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "PA Media: Money",
                "ticker": "STLA",
                "title": "Vauxhall closes van-making factory in Luton",
                "url": "https://finance.yahoo.com/news/vauxhall-closes-van-making-factory-162631046.html"
            },
            {
                "headline": "President Trump made good on his promise to impose tariffs on foreign automakers.",
                "publication_date": "2025-03-28T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.4588",
                "source": "Yahoo Finance",
                "ticker": "STLA",
                "title": "GM, Ford stocks reel after Trump announces 25% auto tariffs on foreign-made vehicles, certain parts",
                "url": "https://finance.yahoo.com/news/gm-ford-stocks-reel-after-trump-announces-25-auto-tariffs-on-foreign-made-vehicles-certain-parts-134341668.html"
            }
        ],
        "avgScore": 0.03959999999999999
    },
    "3 27 2025": {
        "importantArticles": [
            {
                "headline": "Both European and American automakers are seeing their shares take a hit from President Trump's decision to put a 25% levy on vehicles and some auto parts imported into the US. There are a couple of auto stocks moving higher though. Both Tesla and Rivian are trading higher given how much of their production is in the United States. Stay up to date on the latest market action, minute-by-minute, with Yahoo Finance's Market Minute.",
                "publication_date": "2025-03-27T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.6124",
                "source": "Yahoo Finance Video",
                "ticker": "STLA",
                "title": "Auto stocks feel the impact of Trump's latest tariff: Market Minute",
                "url": "https://finance.yahoo.com/video/auto-stocks-feel-impact-trumps-152124933.html"
            },
            {
                "headline": "President Trump's plan to put a 25% levy on vehicles and some parts imported into the US will have a widespread impact on the auto industry. But some are better positioned to weather the storm than others. AutoGuide editorial director Greg Migliore takes a look at some of the winners and losers in the video above. To watch more expert insights and analysis on the latest market action, check out more Morning Brief here.",
                "publication_date": "2025-03-27T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.5267",
                "source": "Yahoo Finance Video",
                "ticker": "STLA",
                "title": "Trump auto tariffs: Winners & losers",
                "url": "https://finance.yahoo.com/video/trump-auto-tariffs-winners-losers-173000474.html"
            },
            {
                "headline": "John Elkann, the chairman of Stellantis, voiced concerns on Thursday over the impact of 25% U.S. tariffs imposed on the carmaking sector on the cost of vehicles and demand.  Speaking to analysts on a conference call, Elkann underlined the message voiced by a trade body grouping Chrysler and Jeep maker Stellantis, GM and Ford.  \"But more importantly, the concern on the affordability of our products, our products made in America, and the implications on demand, on what will this uncertainty mean for demand in the United States of America,\" he added.",
                "publication_date": "2025-03-27T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.1442",
                "source": "Reuters",
                "ticker": "STLA",
                "title": "Stellantis' Elkann concerned over car prices after U.S. tariffs",
                "url": "https://finance.yahoo.com/news/stellantis-elkann-concerned-over-car-153743156.html"
            },
            {
                "headline": "Sir Jim Ratcliffe’s car maker Ineos Automotive has accused the European Union of “sitting on their hands” before Donald Trump ramped up his global tariff war.",
                "publication_date": "2025-03-27T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.7269",
                "source": "The Telegraph",
                "ticker": "STLA",
                "title": "Ratcliffe’s car maker ‘outraged’ at EU neglect over Trump tariffs",
                "url": "https://finance.yahoo.com/news/ratcliffe-car-maker-outraged-eu-180712576.html"
            },
            {
                "headline": "President Trump is readying an announcement on auto tariffs as soon as today, Josh Wingrove and Joe Deaux of Bloomberg report, citing people familiar with the matter. Trump told reporters earlier this week that he would detail the auto levies in the coming days, Bloomberg notes. The level and scope of the auto tariffs are not clear, it adds. Publicly traded companies in the space include Ford (F), General Motors (GM), Honda (HMC), Mercedes-Benz (MBGYY), Nissan (NSANY), Stellantis (STLA), Tesla (",
                "publication_date": "2025-03-27T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.2695",
                "source": "TipRanks",
                "ticker": "STLA",
                "title": "Trump could announce auto tariffs today, Bloomberg reports",
                "url": "https://finance.yahoo.com/news/trump-could-announce-auto-tariffs-160041725.html"
            },
            {
                "headline": "Ferrari may not be immune to Trump tariffs.",
                "publication_date": "2025-03-27T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.2235",
                "source": "Yahoo Finance",
                "ticker": "STLA",
                "title": "JPMorgan cuts outlook for GM, Ford stocks, says Trump auto tariffs may be 'worse' for Ferrari",
                "url": "https://finance.yahoo.com/news/jpmorgan-cuts-outlook-for-gm-ford-stocks-says-trump-auto-tariffs-may-be-worse-for-ferrari-122341848.html"
            }
        ],
        "avgScore": -0.016800000000000002
    },
    "3 26 2025": {
        "importantArticles": [
            {
                "headline": "Italian sports car maker Maserati, one of the worst performing brands within the Stellantis group, said on Wednesday it was boosting lucrative customisation services while working on wider turnaround plans.  \"We must reverse the trend that unfortunately is negative\", Maserati CEO Santo Ficili, who has been in charge for less than six months, said at an online presentation of the new customisation service.  \"Certainly the intention is this, to return little by little to having a positive result for this wonderful brand within Stellantis,\" he said.",
                "publication_date": "2025-03-26T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7194",
                "source": "Reuters",
                "ticker": "STLA",
                "title": "Stellantis' Maserati boosts customisation options ahead of relaunch plans",
                "url": "https://finance.yahoo.com/news/stellantis-maserati-boosts-customisation-options-153307919.html"
            },
            {
                "headline": "President Donald Trump is set to announce the details of his plan for auto tariffs later this afternoon. Detroit Free Press automotive reporter Jamie Lareau joins Market Domination to discuss what people are expecting. To watch more expert insights and analysis on the latest market action, check out more Market Domination here.",
                "publication_date": "2025-03-26T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.4404",
                "source": "Yahoo Finance Video",
                "ticker": "STLA",
                "title": "Trump to announce auto tariffs",
                "url": "https://finance.yahoo.com/video/trump-announce-auto-tariffs-191022966.html"
            },
            {
                "headline": "Stellantis' Chinese partner Leapmotor plans to roll out vehicles equipped with its smart-driving technologies in Europe next year, the company's senior vice president said on Wednesday.  That is the first timeline announced by a Chinese automaker for advanced driver-assistance technologies outside China and comes as the manufacturers scramble for an edge in the hyper-competitive market for EVs and long-range hybrids.  Leapmotor will launch a research and development team in Europe that will focus on algorithm training for self-driving systems based on data collected from roads there, senior vice-president Cao Li told Reuters.",
                "publication_date": "2025-03-26T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.25",
                "source": "Reuters",
                "ticker": "STLA",
                "title": "China's Leapmotor aims for Europe smart-driving rollout in 2026",
                "url": "https://finance.yahoo.com/news/chinas-leapmotor-aims-europe-smart-095422086.html"
            },
            {
                "headline": "The company is also preparing to upgrade its new B10 crossover by the end of the year.",
                "publication_date": "2025-03-26T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Just Auto",
                "ticker": "STLA",
                "title": "Leapmotor plans to introduce smart-driving technologies in Europe in 2026",
                "url": "https://finance.yahoo.com/news/leapmotor-plans-introduce-smart-driving-182304197.html"
            },
            {
                "headline": "Stellantis' Chinese partner Leapmotor plans to roll out vehicles equipped with its smart-driving technologies in Europe next year, the company's senior vice president said on Wednesday.  That is the first timeline announced by a Chinese automaker for advanced driver-assistance technologies outside China and comes as the manufacturers scramble for an edge in the hyper-competitive market for EVs and long-range hybrids.  Leapmotor will launch a research and development team in Europe that will focus on algorithm training for self-driving systems based on data collected from roads there, senior vice-president Cao Li told Reuters.",
                "publication_date": "2025-03-26T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.25",
                "source": "Reuters",
                "ticker": "STLA",
                "title": "China's Leapmotor aims for Europe smart-driving rollout in 2026",
                "url": "https://finance.yahoo.com/news/chinas-leapmotor-aims-europe-smart-095422086.html"
            },
            {
                "headline": "President Donald Trump is set to announce the details of his plan for auto tariffs later this afternoon. Detroit Free Press automotive reporter Jamie Lareau joins Market Domination to discuss what people are expecting. To watch more expert insights and analysis on the latest market action, check out more Market Domination here.",
                "publication_date": "2025-03-26T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.4404",
                "source": "Yahoo Finance Video",
                "ticker": "STLA",
                "title": "Trump to announce auto tariffs",
                "url": "https://finance.yahoo.com/video/trump-announce-auto-tariffs-191022966.html"
            }
        ],
        "avgScore": 0.35245000000000004
    },
    "3 25 2025": {
        "importantArticles": [
            {
                "headline": "Hyundai (HYMTF) is set to announce a $20B investment in U.S. onshoring that includes a $5B steel plant in Louisiana, people familiar with the plans told CNBC’s Seema Mody. The new steel plant will produce next-generation steel that will be used by Hyundai’s two U.S. auto plants to manufacture electric vehicles, the report noted. The investment is expected to be announced Monday at the White House by President Donald Trump, Hyundai Chairman Euisun Chung and Louisiana Gov. Jeff Landry, CNBC added.",
                "publication_date": "2025-03-25T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "TipRanks",
                "ticker": "STLA",
                "title": "Hyundai to announce $20B investment in U.S., CNBC reports",
                "url": "https://finance.yahoo.com/news/hyundai-announce-20b-investment-u-124636477.html"
            },
            {
                "headline": "Hyundai (HYMTF) is set to announce a $20B investment in U.S. onshoring that includes a $5B steel plant in Louisiana, people familiar with the plans told CNBC’s Seema Mody. The new steel plant will produce next-generation steel that will be used by Hyundai’s two U.S. auto plants to manufacture electric vehicles, the report noted. The investment is expected to be announced Monday at the White House by President Donald Trump, Hyundai Chairman Euisun Chung and Louisiana Gov. Jeff Landry, CNBC added.",
                "publication_date": "2025-03-25T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "TipRanks",
                "ticker": "STLA",
                "title": "Hyundai to announce $20B investment in U.S., CNBC reports",
                "url": "https://finance.yahoo.com/news/hyundai-announce-20b-investment-u-124636477.html"
            }
        ],
        "avgScore": 0.0
    },
    "3 24 2025": {
        "importantArticles": [
            {
                "headline": "The offer is available at over 20 plants and parts distribution centres across Detroit and Toledo, as well as some workers in Illinois.",
                "publication_date": "2025-03-24T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.2732",
                "source": "Just Auto",
                "ticker": "STLA",
                "title": "Stellantis offers new buyouts to US factory workers",
                "url": "https://finance.yahoo.com/news/stellantis-offers-buyouts-us-factory-124719833.html"
            },
            {
                "headline": "Auto stocks including Ford (F), General Motors (GM), and Stellantis (STLA) are trading in the green amid reports of President Trump's targeted tariffs. Threadneedle Ventures Founder Ann Berry joins Catalysts host Madison Mills to break down the impact of tariffs on the auto industry. To watch more expert insights and analysis on the latest market action, check out more Catalysts here.",
                "publication_date": "2025-03-24T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Yahoo Finance Video",
                "ticker": "STLA",
                "title": "Auto stocks rise on narrowed tariff plan",
                "url": "https://finance.yahoo.com/video/auto-stocks-rise-narrowed-tariff-152546936.html"
            },
            {
                "headline": "Auto stocks including Ford (F), General Motors (GM), and Stellantis (STLA) are trading in the green amid reports of President Trump's targeted tariffs. Threadneedle Ventures Founder Ann Berry joins Catalysts host Madison Mills to break down the impact of tariffs on the auto industry. To watch more expert insights and analysis on the latest market action, check out more Catalysts here.",
                "publication_date": "2025-03-24T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Yahoo Finance Video",
                "ticker": "STLA",
                "title": "Auto stocks rise on narrowed tariff plan",
                "url": "https://finance.yahoo.com/video/auto-stocks-rise-narrowed-tariff-152546936.html"
            },
            {
                "headline": "The offer is available at over 20 plants and parts distribution centres across Detroit and Toledo, as well as some workers in Illinois.",
                "publication_date": "2025-03-24T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.2732",
                "source": "Just Auto",
                "ticker": "STLA",
                "title": "Stellantis offers new buyouts to US factory workers",
                "url": "https://finance.yahoo.com/news/stellantis-offers-buyouts-us-factory-124719833.html"
            }
        ],
        "avgScore": 0.1366
    },
    "3 21 2025": {
        "importantArticles": [
            {
                "headline": "DETROIT (Reuters) -Jeep-maker Stellantis is offering a new round of buyouts for some of its U.S. factory workers as the automaker looks to cut costs following a difficult 2024.  The automaker confirmed on Friday that it is offering voluntary buyouts to some workers at facilities in Detroit, Ohio and Illinois.  \"Stellantis continues to review its operations to improve efficiency and protect its competitiveness in a very dynamic market,\" the company said in a statement.",
                "publication_date": "2025-03-21T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7425",
                "source": "Reuters",
                "ticker": "STLA",
                "title": "Stellantis initiates new round of buyouts for some US factory workers",
                "url": "https://finance.yahoo.com/news/stellantis-initiates-round-buyouts-factory-160351168.html"
            },
            {
                "headline": "The buyouts and voluntary retirement packages follow a challenging 2024 for the automaker that included declining profits and shrinking market share in North America.",
                "publication_date": "2025-03-21T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.6908",
                "source": "Automotive Dive",
                "ticker": "STLA",
                "title": "Stellantis offers buyouts in Michigan, Ohio and Illinois",
                "url": "https://finance.yahoo.com/news/stellantis-offers-buyouts-michigan-ohio-173000888.html"
            },
            {
                "headline": "China's embassy in Spain said Stellantis  and its Chinese partner Leapmotor plan a $200 million investment in a Spanish factory after a person with direct knowledge of the matter said Spain was the top site to produce the B10 electric crossover for the European market from 2026.  Stellantis' factories in Germany and Slovakia have also been under consideration, Reuters previously reported.  China's embassy said the factory where they plan to invest is in Zaragoza, northeast Spain, but did not provide any further details.",
                "publication_date": "2025-03-21T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.1154",
                "source": "Reuters",
                "ticker": "STLA",
                "title": "Stellantis, Leapmotor favour Spain for production of B10 EV, source says",
                "url": "https://finance.yahoo.com/news/stellantis-leapmotor-favour-spain-production-124634621.html"
            },
            {
                "headline": "Tesla’s reputational troubles and Stellantis’s falling sales are the latest examples of the obstacles facing transnational auto manufacturers.",
                "publication_date": "2025-03-21T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.7351",
                "source": "The Wall Street Journal",
                "ticker": "STLA",
                "title": "From Ford to Musk, the Perils of Trying to Build a Global Auto Empire",
                "url": "https://finance.yahoo.com/m/f45db4b8-b169-39a6-9512-a2b595641dcf/from-ford-to-musk-the-perils.html"
            },
            {
                "headline": "China's embassy in Spain said Stellantis  and its Chinese partner Leapmotor plan a $200 million investment in a Spanish factory after a person with direct knowledge of the matter said Spain was the top site to produce the B10 electric crossover for the European market from 2026.  Stellantis' factories in Germany and Slovakia have also been under consideration, Reuters previously reported.  China's embassy said the factory where they plan to invest is in Zaragoza, northeast Spain, but did not provide any further details.",
                "publication_date": "2025-03-21T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.1154",
                "source": "Reuters",
                "ticker": "STLA",
                "title": "Stellantis, Leapmotor favour Spain for production of B10 EV, source says",
                "url": "https://finance.yahoo.com/news/stellantis-leapmotor-favour-spain-production-124634621.html"
            },
            {
                "headline": "The buyouts and voluntary retirement packages follow a challenging 2024 for the automaker that included declining profits and shrinking market share in North America.",
                "publication_date": "2025-03-21T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.6908",
                "source": "Automotive Dive",
                "ticker": "STLA",
                "title": "Stellantis offers buyouts in Michigan, Ohio and Illinois",
                "url": "https://finance.yahoo.com/news/stellantis-offers-buyouts-michigan-ohio-173000888.html"
            }
        ],
        "avgScore": 0.2034
    },
    "3 20 2025": {
        "importantArticles": [
            {
                "headline": "Yahoo Finance host&nbsp;Brad Smith tracks several of this morning's top market stories in this Market Minute, including Carvana's (CVNA) upgrade from Piper Sandler while the firm downgraded Rivian (RIVN) and Stellantis (STLA), and Darden Restaurants' (DRI) shares getting a boost following its earnings results. Stay up to date on the latest market action, minute-by-minute, with&nbsp;Yahoo Finance's Market Minute.",
                "publication_date": "2025-03-20T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.6908",
                "source": "Yahoo Finance Video",
                "ticker": "STLA",
                "title": "Carvana upgrade, Rivian & Stellantis, Darden: Market Minute",
                "url": "https://finance.yahoo.com/video/carvana-upgrade-rivian-stellantis-darden-161347540.html"
            },
            {
                "headline": "We recently compiled a list of the 12 Cheap EV Stocks to Buy According to Hedge Funds. In this article, we are going to take a look at where Stellantis N.V. (NYSE:STLA) stands against the other cheap EV stocks. Ownership of EVs is rising in the US. On March 16, CNBC reported that currently there […]",
                "publication_date": "2025-03-20T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Insider Monkey",
                "ticker": "STLA",
                "title": "Is Stellantis N.V. (STLA) The Best Cheap EV Stock to Buy?",
                "url": "https://finance.yahoo.com/news/stellantis-n-v-stla-best-154300590.html"
            },
            {
                "headline": "Piper Sandler has downgraded US auto stocks, cutting the price targets on Rivian (RIVN) and Stellantis (STLA) while maintaining an Overweight rating on EV leader Tesla (TSLA). Madison Mills&nbsp;and StoneX senior adviser Jon Hilsenrath assess how Wall Street is forecasting President Trump's tariffs to weigh on automakers and create further uncertainty for the broader auto industry. To watch more expert insights and analysis on the latest market action, check out more Catalysts&nbsp;here.",
                "publication_date": "2025-03-20T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5106",
                "source": "Yahoo Finance Video",
                "ticker": "STLA",
                "title": "Piper Sandler remains bullish on Tesla in auto stock downgrades",
                "url": "https://finance.yahoo.com/video/piper-sandler-remains-bullish-tesla-144207317.html"
            },
            {
                "headline": "Piper Sandler has downgraded US auto stocks, cutting the price targets on Rivian (RIVN) and Stellantis (STLA) while maintaining an Overweight rating on EV leader Tesla (TSLA). Madison Mills&nbsp;and StoneX senior adviser Jon Hilsenrath assess how Wall Street is forecasting President Trump's tariffs to weigh on automakers and create further uncertainty for the broader auto industry. To watch more expert insights and analysis on the latest market action, check out more Catalysts&nbsp;here.",
                "publication_date": "2025-03-20T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5106",
                "source": "Yahoo Finance Video",
                "ticker": "STLA",
                "title": "Piper Sandler remains bullish on Tesla in auto stock downgrades",
                "url": "https://finance.yahoo.com/video/piper-sandler-remains-bullish-tesla-144207317.html"
            },
            {
                "headline": "We recently compiled a list of the 12 Cheap EV Stocks to Buy According to Hedge Funds. In this article, we are going to take a look at where Stellantis N.V. (NYSE:STLA) stands against the other cheap EV stocks. Ownership of EVs is rising in the US. On March 16, CNBC reported that currently there […]",
                "publication_date": "2025-03-20T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Insider Monkey",
                "ticker": "STLA",
                "title": "Is Stellantis N.V. (STLA) The Best Cheap EV Stock to Buy?",
                "url": "https://finance.yahoo.com/news/stellantis-n-v-stla-best-154300590.html"
            },
            {
                "headline": "Yahoo Finance host&nbsp;Brad Smith tracks several of this morning's top market stories in this Market Minute, including Carvana's (CVNA) upgrade from Piper Sandler while the firm downgraded Rivian (RIVN) and Stellantis (STLA), and Darden Restaurants' (DRI) shares getting a boost following its earnings results. Stay up to date on the latest market action, minute-by-minute, with&nbsp;Yahoo Finance's Market Minute.",
                "publication_date": "2025-03-20T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.6908",
                "source": "Yahoo Finance Video",
                "ticker": "STLA",
                "title": "Carvana upgrade, Rivian & Stellantis, Darden: Market Minute",
                "url": "https://finance.yahoo.com/video/carvana-upgrade-rivian-stellantis-darden-161347540.html"
            }
        ],
        "avgScore": 0.060066666666666636
    },
    "3 19 2025": {
        "importantArticles": [
            {
                "headline": "The chairman of Stellantis said on Wednesday that Europe's automotive industry does not need to convert to defence production, while confirming the group is on course to appoint a new CEO in the first half of this year.  As European counties discuss a big increase in defence spending, Italy's Industry Minister Adolfo Urso said this week that Rome was preparing an industrial plan aimed at fostering connections between its automotive, defence and aerospace sectors, to be unveiled in June.  Addressing the Italian parliament, Stellantis Chairman John Elkann said U.S. and China both maintained strong defence and automotive industries, meaning there was not a choice to be made between the two.",
                "publication_date": "2025-03-19T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.802",
                "source": "Reuters",
                "ticker": "STLA",
                "title": "Europe's carmakers should steer clear of defence industry, Stellantis' Elkann says",
                "url": "https://finance.yahoo.com/news/elkann-says-stellantis-appoint-ceo-135258434.html"
            },
            {
                "headline": "Big Bear Edition debuts for 2025 Jeep® Gladiator midsize pickup truck, a tribute to the inspiring outdoors and adventurous people of California",
                "publication_date": "2025-03-19T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.6369",
                "source": "PR Newswire",
                "ticker": "STLA",
                "title": "Golden State Gladiator: Jeep® Brand Debuts 2025 Gladiator Big Bear Edition Exclusively for California",
                "url": "https://finance.yahoo.com/news/golden-state-gladiator-jeep-brand-160000421.html"
            },
            {
                "headline": "Chinese EV maker Leapmotor has started selling two electric vehicle models at Stellantis dealerships in Britain via its joint venture with the world's No. 4 automaker, it said on Wednesday.  Leapmotor has launched sales of the T03 compact electric car and the C10, a large electric SUV, with the B10 midsize SUV launching later this year, at 44 Stellantis dealerships where staff have been trained to sell the cars.  By the end of 2025, Leapmotors will be on sale at 80 Stellantis dealers in Britain, with more coming next year, said Damien Dally, Leapmotor's UK managing director.",
                "publication_date": "2025-03-19T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.1779",
                "source": "Reuters",
                "ticker": "STLA",
                "title": "Leapmotor launches UK sales with two EV models",
                "url": "https://finance.yahoo.com/news/leapmotor-launches-uk-sales-two-000947183.html"
            },
            {
                "headline": "Chinese EV maker Leapmotor has started selling two electric vehicle models at Stellantis dealerships in Britain via its joint venture with the world's No. 4 automaker, it said on Wednesday.  Leapmotor has launched sales of the T03 compact electric car and the C10, a large electric SUV, with the B10 midsize SUV launching later this year, at 44 Stellantis dealerships where staff have been trained to sell the cars.  By the end of 2025, Leapmotors will be on sale at 80 Stellantis dealers in Britain, with more coming next year, said Damien Dally, Leapmotor's UK managing director.",
                "publication_date": "2025-03-19T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.1779",
                "source": "Reuters",
                "ticker": "STLA",
                "title": "Leapmotor launches UK sales with two EV models",
                "url": "https://finance.yahoo.com/news/leapmotor-launches-uk-sales-two-000947183.html"
            },
            {
                "headline": "Big Bear Edition debuts for 2025 Jeep® Gladiator midsize pickup truck, a tribute to the inspiring outdoors and adventurous people of California",
                "publication_date": "2025-03-19T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.6369",
                "source": "PR Newswire",
                "ticker": "STLA",
                "title": "Golden State Gladiator: Jeep® Brand Debuts 2025 Gladiator Big Bear Edition Exclusively for California",
                "url": "https://finance.yahoo.com/news/golden-state-gladiator-jeep-brand-160000421.html"
            },
            {
                "headline": "The chairman of Stellantis said on Wednesday that Europe's automotive industry does not need to convert to defence production, while confirming the group is on course to appoint a new CEO in the first half of this year.  As European counties discuss a big increase in defence spending, Italy's Industry Minister Adolfo Urso said this week that Rome was preparing an industrial plan aimed at fostering connections between its automotive, defence and aerospace sectors, to be unveiled in June.  Addressing the Italian parliament, Stellantis Chairman John Elkann said U.S. and China both maintained strong defence and automotive industries, meaning there was not a choice to be made between the two.",
                "publication_date": "2025-03-19T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.802",
                "source": "Reuters",
                "ticker": "STLA",
                "title": "Europe's carmakers should steer clear of defence industry, Stellantis' Elkann says",
                "url": "https://finance.yahoo.com/news/elkann-says-stellantis-appoint-ceo-135258434.html"
            }
        ],
        "avgScore": 0.4203333333333334
    },
    "3 18 2025": {
        "importantArticles": [
            {
                "headline": "Hosted by automotive enthusiast and gearhead Garrett Reed, the new, interactive, mobile Dodge Charger Virtual Experience showcases the all-new Dodge Charger and lets customers create their dream ride right on their phone",
                "publication_date": "2025-03-18T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.6808",
                "source": "PR Newswire",
                "ticker": "STLA",
                "title": "Dodge Brand Debuts New Interactive Mobile 360-degree Dodge Charger Virtual Experience, 2025 Charger Muscle Cars in Bludicrous Start Arriving in Dealerships",
                "url": "https://finance.yahoo.com/news/dodge-brand-debuts-interactive-mobile-150000002.html"
            },
            {
                "headline": "The investment aims to bolster the manufacturing of steel components for electric drive modules in Italy.",
                "publication_date": "2025-03-18T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Just Auto",
                "ticker": "STLA",
                "title": "Stellantis to invest $41m in Italian plant for EV component production",
                "url": "https://finance.yahoo.com/news/stellantis-invest-41m-italian-plant-113209782.html"
            },
            {
                "headline": "The investment aims to bolster the manufacturing of steel components for electric drive modules in Italy.",
                "publication_date": "2025-03-18T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Just Auto",
                "ticker": "STLA",
                "title": "Stellantis to invest $41m in Italian plant for EV component production",
                "url": "https://finance.yahoo.com/news/stellantis-invest-41m-italian-plant-113209782.html"
            },
            {
                "headline": "Hosted by automotive enthusiast and gearhead Garrett Reed, the new, interactive, mobile Dodge Charger Virtual Experience showcases the all-new Dodge Charger and lets customers create their dream ride right on their phone",
                "publication_date": "2025-03-18T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.6808",
                "source": "PR Newswire",
                "ticker": "STLA",
                "title": "Dodge Brand Debuts New Interactive Mobile 360-degree Dodge Charger Virtual Experience, 2025 Charger Muscle Cars in Bludicrous Start Arriving in Dealerships",
                "url": "https://finance.yahoo.com/news/dodge-brand-debuts-interactive-mobile-150000002.html"
            }
        ],
        "avgScore": 0.3404
    },
    "coef": 0.1332956845020496,
    "avgCoef": 0.021500424395419337,
    "similar": {
        "UMC": 0.36769275682556907,
        "LYG": 0.34340583125951757,
        "CCL": 0.30217453901947683,
        "AGNC": 0.29370235568248215
    }
}