{
    "4 7 2025": {
        "importantArticles": [
            {
                "headline": "LG Energy Solution (LGES), an electric vehicle (EV) battery supplier for General Motors and Tesla, estimated on Monday a 138% rise in its quarterly operating profit. However, excluding tax credits under the U.S. Inflation Reduction Act, LG Energy Solution said it saw an operating loss of 83 billion won ($56.52 million) in the first quarter, as the industry is hit by cooling demand for electric vehicles. The South Korean company said its operating profit was likely 374.7 billion won for the January-to-March period, compared with a 157.3 billion won profit a year earlier and a 29 billion won average forecast by LSEG SmartEstimate, weighted toward analysts who are more consistently accurate.",
                "publication_date": "2025-04-07T01:37:19.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9834",
                "source": "Reuters",
                "ticker": "TSLA",
                "title": "LG Energy Solution flags 138% rise in Q1 operating profit",
                "url": "https://finance.yahoo.com/news/lg-energy-solution-flags-138-013719331.html"
            },
            {
                "headline": "Shares of Tesla (NASDAQ: TSLA) traded close to 6% lower as of 10:31 a.m. ET today, but had traded as much as 10.5% down before broader market volatility set in, causing volatile swings in shares.  Longtime bull Dan Ives, an analyst at Wedbush, slashed his price target on the electric carmaker by 43%, while maintaining a buy rating.  Ives, who formerly had the highest price target on Wall Street, lowered his expectations on Tesla's stock from $550 per share to $315, which still implies significant upside from current levels, although shares of Tesla are off some 42% this year.",
                "publication_date": "2025-04-07T14:41:42.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7579",
                "source": "Motley Fool",
                "ticker": "TSLA",
                "title": "Longtime Bull Dan Ives Just Slashed His Price Target on Tesla -- Shares Are Falling",
                "url": "https://finance.yahoo.com/news/longtime-bull-dan-ives-just-144142980.html"
            },
            {
                "headline": "With its new \"Super e-Platform.\" BYDDY is taking a huge leap forward in battery technology and charging speed.",
                "publication_date": "2025-04-07T12:36:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7351",
                "source": "Zacks",
                "ticker": "TSLA",
                "title": "BYD's Blazing Rally Continues: Should You Still Buy at These Levels?",
                "url": "https://finance.yahoo.com/news/byds-blazing-rally-continues-still-123600310.html"
            },
            {
                "headline": "Bank earnings arriving as trade war intensifies, Tesla price target slashed amid Musk ‘brand crisis tornado,’ and more news to start your day.",
                "publication_date": "2025-04-07T10:43:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.872",
                "source": "Barrons.com",
                "ticker": "TSLA",
                "title": "Trump ‘Medicine’ Has Caused Market Meltdown. Why Only He Can Save Stocks and 4 Other Things to Know Today.",
                "url": "https://finance.yahoo.com/m/6400ad1d-7118-3cfd-b1f7-c9f843f10bd9/trump-%E2%80%98medicine%E2%80%99-has-caused.html"
            },
            {
                "headline": "Tesla and Apple will be among the top U.S. companies most badly damaged by President Trump's tariff campaign, Wedbush analysts said in a pair of research notes.  For Tesla, the resulting trade war is a double whammy, they noted.  China is also a key region for Tesla, and Trump's tariffs have created a backlash against Elon Musk there that will drive customers to BYD and other Chinese competitors, they added.",
                "publication_date": "2025-04-07T11:18:27.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.8258",
                "source": "Barrons.com",
                "ticker": "TSLA",
                "title": "Tesla and Apple Stand To Take The Biggest Tariff Hits",
                "url": "https://finance.yahoo.com/m/dc3d22b4-7066-3383-b744-77d763bfb94e/tesla-and-apple-stand-to-take.html"
            },
            {
                "headline": "\"The demand destruction for Tesla and brand damage is real,\" wrote Wedbush Securities analyst Dan Ives.",
                "publication_date": "2025-04-07T12:27:20.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.7351",
                "source": "Fortune",
                "ticker": "TSLA",
                "title": "Wall Street’s biggest Tesla bull just raised the white flag, blaming Elon Musk for slashing his price target nearly by half",
                "url": "https://finance.yahoo.com/news/wall-street-biggest-tesla-bull-122720987.html"
            }
        ],
        "avgScore": -0.034440425531914856
    },
    "4 4 2025": {
        "importantArticles": [
            {
                "headline": "The stock market took a dive, but Cathie Wood didn’t flinch. Instead of retreating, the Ark Invest CEO saw an opportunity and went on a buying spree. According to Investor’s Business Daily, her firm snapped up shares of Tesla (NASDAQ:TSLA), Robinhood (NASDAQ:HOOD), Coinbase (NASDAQ:COIN), Palantir Technologies (NYSE:PLTR), and more on March 10. Big Bets in a Turbulent Market Investor’s Business Daily said that Ark Invest picked up 79,318 shares of Tesla, valued at $17.62 million based on Monday’",
                "publication_date": "2025-04-04T20:30:46.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9209",
                "source": "Benzinga",
                "ticker": "TSLA",
                "title": "Cathie Wood Just Made A Bold Move—Why She Spent Over $65M On Tesla, Robinhood, And Coinbase 'As The Market Crashed'",
                "url": "https://finance.yahoo.com/news/cathie-wood-just-made-bold-203046717.html"
            },
            {
                "headline": "The global EV fuse market is projected to grow significantly, reaching an anticipated value of US$ 5.6 billion by 2031, according to a report by Stratview Research. This growth accompanies an annual rate of 13.9% from 2024 to 2031, driven by the increasing adoption of electric vehicles (EVs) including battery electric vehicles (BEVs) and hybrid electric vehicles (HEVs). The market segmentation includes various types of fuses used across different applications, with low-voltage fuses...",
                "publication_date": "2025-04-04T10:09:37.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7003",
                "source": "Simply Wall St.",
                "ticker": "TSLA",
                "title": "Electric Vehicles Today - Accelerating Growth In The Global EV Fuse Market",
                "url": "https://finance.yahoo.com/news/electric-vehicles-today-accelerating-growth-100937547.html"
            },
            {
                "headline": "Six of the 10 most popular fund categories were bond strategies. Investors fled large growth stocks, and crypto was a washout.",
                "publication_date": "2025-04-04T06:30:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.6901",
                "source": "Barrons.com",
                "ticker": "TSLA",
                "title": "Gold and Foreign Stocks Are Winning. Here Are the Losers.",
                "url": "https://finance.yahoo.com/m/61ff2211-ec1a-3d35-98d0-5747cb12f017/gold-and-foreign-stocks-are.html"
            },
            {
                "headline": "Shares of Tesla (NASDAQ: TSLA) are sliding on Friday.  The decline comes as the S&P 500 and Nasdaq Composite both lost more than 5%.  As the escalating trade war hammers markets, Tesla received a bearish adjustment from a key analyst who said Tesla has suffered \"unprecedented brand damage\" due to CEO Elon Musk's involvement in politics.",
                "publication_date": "2025-04-04T17:48:03.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.886",
                "source": "Motley Fool",
                "ticker": "TSLA",
                "title": "Why Tesla Stock Is Crashing Today -- It's Not Just Trump's Tariffs",
                "url": "https://finance.yahoo.com/news/why-tesla-stock-crashing-today-174803093.html"
            },
            {
                "headline": "Musk, Bezos, and Zuckerberg lose nearly $45 billion amid market rout, the worst since 2020",
                "publication_date": "2025-04-04T15:53:17.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.7783",
                "source": "GuruFocus.com",
                "ticker": "TSLA",
                "title": "Top 3 Billionaires Suffer $45 Billion Loss in Worst Market Drop Since 2020",
                "url": "https://finance.yahoo.com/news/top-3-billionaires-suffer-45-155317679.html"
            },
            {
                "headline": "Nvidia and Tesla led megacaps lower on Friday as stocks continued to sell off amid a global trade war.",
                "publication_date": "2025-04-04T20:28:05.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.7269",
                "source": "Yahoo Finance",
                "ticker": "TSLA",
                "title": "Nvidia, Apple, Tesla stocks plunge, leading another 'Magnificent 7' sell-off as a trade war intensifies",
                "url": "https://finance.yahoo.com/news/nvidia-apple-tesla-stocks-plunge-leading-another-magnificent-7-sell-off-as-a-trade-war-intensifies-202805499.html"
            }
        ],
        "avgScore": -0.13334166666666666
    },
    "4 3 2025": {
        "importantArticles": [
            {
                "headline": "While many investors hold great respect for Warren Buffett, they may also view him as more of a traditional investor.  Consumer tech giant Apple is still the largest holding in Berkshire Hathaway's massive equities portfolio, and the conglomerate owns stakes in other innovative companies as well.  In fact, one of those companies is starting to eat Tesla's lunch.",
                "publication_date": "2025-04-03T08:14:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9042",
                "source": "Motley Fool",
                "ticker": "TSLA",
                "title": "Warren Buffett Owns an EV Stock That Is Starting to Eat Tesla's Lunch",
                "url": "https://finance.yahoo.com/news/warren-buffett-owns-ev-stock-081400341.html"
            },
            {
                "headline": "Greenbacker Renewable Energy Company LLC reported its 2024 results, highlighting contributions to the energy transition despite challenging market conditions. The company achieved a 16% increase in operating revenue to $210 million and a 23% rise in power production, driven by the addition of 22 new solar energy assets and significant wind repowering efforts. Amid macroeconomic pressures, Greenbacker adjusted its net asset value and implemented cost-saving measures, including a workforce...",
                "publication_date": "2025-04-03T11:07:23.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8822",
                "source": "Simply Wall St.",
                "ticker": "TSLA",
                "title": "This Week In Energy Transition - Greenbacker Advances with Solar and Wind Energy Initiatives",
                "url": "https://finance.yahoo.com/news/week-energy-transition-greenbacker-advances-110723156.html"
            },
            {
                "headline": "We recently published a list of 10 Best Climate Change Stocks to Buy Now. In this article, we will look at where Tesla, Inc. (NASDAQ:TSLA) stands against other best climate change stocks to buy now. Investors are focusing on companies driving the transition to a low-carbon economy. Climate change stocks, as defined by the Climate Change […]",
                "publication_date": "2025-04-03T10:56:21.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8555",
                "source": "Insider Monkey",
                "ticker": "TSLA",
                "title": "Tesla, Inc. (TSLA): The Best Climate Change Stock to Buy Now",
                "url": "https://finance.yahoo.com/news/tesla-inc-tsla-best-climate-105621860.html"
            },
            {
                "headline": "After Tesla (TSLA) announced its Q1 delivery figure of 337,000 vehicles, which was “well below” both the Street’s 352,000 estimate and Street “whisper numbers” of about 350,000, Wedbush said “brand crisis issues are clearly having a negative impact on Tesla…there is no debate.” This delivery number was “a disaster for the bulls with continuous negativity around the TSLA brand,” according to the analyst, who adds: “We are not going to look at these numbers with rose colored glasses…they were a di",
                "publication_date": "2025-04-03T14:00:54.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.9371",
                "source": "TipRanks",
                "ticker": "TSLA",
                "title": "Wedbush says Tesla needs to ‘navigate brand crisis or else’",
                "url": "https://finance.yahoo.com/news/wedbush-says-tesla-needs-navigate-140054423.html"
            },
            {
                "headline": "(Bloomberg) -- The retail traders who have stormed the markets in recent years were among the only investors buying on Thursday as US stocks had their worst day since June 2020.Most Read from BloombergHousing Agency Aims to Relocate Its DC HeadquartersMetro-North Is Faster Than Acela on NYC-New Haven Route After Signal UpdatesLocal Governments Vie for Fired Federal WorkersLondon Clears Final Hurdle for More High-Speed Trains to EuropeWhat Would ‘Transportation Abundance’ Look Like?Small investor",
                "publication_date": "2025-04-03T20:38:38.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.8126",
                "source": "Bloomberg",
                "ticker": "TSLA",
                "title": "Retail Traders Step In to Buy as Others Flee in Tariff Rout",
                "url": "https://finance.yahoo.com/news/retail-traders-step-buy-others-203838411.html"
            },
            {
                "headline": "We recently published a list of Top 10 Stocks on Jim Cramer’s Radar as Trump Tariffs Wreak Havoc Across Global Markets. In this article, we are going to take a look at where Tesla, Inc. (NASDAQ:TSLA) stands against other top stocks on Jim Cramer’s radar as Trump tariffs wreak havoc across global markets. Jim Cramer […]",
                "publication_date": "2025-04-03T20:51:01.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.7351",
                "source": "Insider Monkey",
                "ticker": "TSLA",
                "title": "Jim Cramer Says ‘There’s Nothing Magnificent’ About Tesla (TSLA)",
                "url": "https://finance.yahoo.com/news/jim-cramer-says-nothing-magnificent-205101248.html"
            }
        ],
        "avgScore": 0.02768235294117639
    },
    "4 2 2025": {
        "importantArticles": [
            {
                "headline": "Shares of Tesla (NASDAQ: TSLA) are rebounding on Wednesday.  The recovery comes as the S&P 500 and Nasdaq Composite gained 0.5% and 0.9%, respectively.  A report suggesting CEO Elon Musk may soon leave his role in the Trump administration to refocus on his businesses has sparked investor optimism.",
                "publication_date": "2025-04-02T17:18:39.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8591",
                "source": "Motley Fool",
                "ticker": "TSLA",
                "title": "Why Tesla Stock Is Soaring Today",
                "url": "https://finance.yahoo.com/news/why-tesla-stock-soaring-today-171839461.html"
            },
            {
                "headline": "Shares of the electric carmaker Tesla (NASDAQ: TSLA) started this morning in the red only to reverse course and work their way firmly into positive territory, with shares trading 5% higher as of 2:15 p.m. ET today.  There was a lot of news about Tesla, including first-quarter deliveries and reports that CEO Elon Musk may soon end his involvement in government affairs.  Is Musk done with DOGE?",
                "publication_date": "2025-04-02T19:09:16.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7906",
                "source": "Motley Fool",
                "ticker": "TSLA",
                "title": "Why Shares of Tesla Bobbed and Weaved Today: Is the Stock Back on Track?",
                "url": "https://finance.yahoo.com/news/why-shares-tesla-bobbed-weaved-190916501.html"
            },
            {
                "headline": "Among the top 10 richest people in the world, only Bill Gates and Warren Buffett added to their fortunes in this period, according to the Bloomberg Billionaires Index.",
                "publication_date": "2025-04-02T17:10:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.6369",
                "source": "Barrons.com",
                "ticker": "TSLA",
                "title": "Here’s How Much Money Elon Musk and Jeff Bezos Lost in the First Quarter of 2025",
                "url": "https://finance.yahoo.com/m/0a4de33a-99e8-3e11-af63-6cb709e839f9/here%E2%80%99s-how-much-money-elon.html"
            },
            {
                "headline": "Bloomberg's Craig Trudell explains what's behind Tesla's worst sales slump since 2022. He joins Caroline Hyde on \"Bloomberg Technology.\"",
                "publication_date": "2025-04-02T18:47:51.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.6249",
                "source": "Bloomberg",
                "ticker": "TSLA",
                "title": "Tesla Sales Slump Amid Musk Backlash",
                "url": "https://finance.yahoo.com/video/tesla-sales-slump-amid-musk-184751495.html"
            },
            {
                "headline": "The EV maker’s first-quarter sales figures were grim, but stock is still up on news that Musk’s days as a controversial Trump advisor could be numbered.",
                "publication_date": "2025-04-02T18:30:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5499",
                "source": "FastCompany",
                "ticker": "TSLA",
                "title": "TSLA roller-coaster ride: Tesla sees largest-ever drop in vehicle deliveries, but report says Musk could leave DOGE",
                "url": "https://finance.yahoo.com/news/tsla-roller-coaster-ride-tesla-183000637.html"
            },
            {
                "headline": "In the face of escalating protests and boycotts, Errol Musk, father of Elon Musk, has come forward to defend his son’s cost-cutting initiatives for the U.S. government and his EV company Tesla Inc. (NASDAQ:TSLA). What Happened: Errol has responded to ...",
                "publication_date": "2025-04-02T21:30:14.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5106",
                "source": "Benzinga",
                "ticker": "TSLA",
                "title": "Elon Musk's Father Defends Tesla, Says Son Is 'Doing The Right Thing' And The Stock Would Recover To $600 By 2025 End: Here's What Analysts Think About TSLA",
                "url": "https://finance.yahoo.com/news/elon-musks-father-defends-tesla-213014666.html"
            }
        ],
        "avgScore": 0.005831999999999988
    },
    "coef": 0.719953510670278,
    "avgCoef": 0.1074398536423988
}