{
    "Important Articles": [
        {
            "headline": "Key Insights The projected fair value for Under Armour is US$12.18 based on 2 Stage Free Cash Flow to Equity Under...",
            "publication_date": "2025-04-02T12:36:44.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.7906",
            "source": "Simply Wall St.",
            "ticker": "UAA",
            "title": "Under Armour, Inc. (NYSE:UAA) Shares Could Be 48% Below Their Intrinsic Value Estimate",
            "url": "https://finance.yahoo.com/news/under-armour-inc-nyse-uaa-123644405.html"
        },
        {
            "headline": "Under Armour's focus on pricing and consumer engagement drives long-term potential. Its disciplined cost management strengthens its market position.",
            "publication_date": "2025-04-02T13:18:00.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.7184",
            "source": "Zacks",
            "ticker": "UAA",
            "title": "UAA Stock Plummets 24% in 3 Months: Should You Buy the Dip Now?",
            "url": "https://finance.yahoo.com/news/uaa-stock-plummets-24-3-131800791.html"
        },
        {
            "headline": "We recently published a list of the 10 Best US Stocks Under $10 to Buy Right Now. In this article, we are going to take a look at where Under Armour Inc. (NYSE:UA) stands against other US stocks under $10 to buy right now. On March 12, Stephanie Guild of Robinhood and Marci McGregor of […]",
            "publication_date": "2025-03-26T14:56:06.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.6369",
            "source": "Insider Monkey",
            "ticker": "UAA",
            "title": "Is Under Armour Inc. (NYSE:UA) the Best US Stock Under $10 to Buy Right Now?",
            "url": "https://finance.yahoo.com/news/under-armour-inc-nyse-ua-145606759.html"
        },
        {
            "headline": "At his \"Liberation Day\" spectacle at the White House Wednesday afternoon, Trump revealed a baseline tariff rate of 10% on countries that will go into effect on April 5.Additional tariffs will be added for some countries that the administration considers to be the worst offenders. Some of those alleged worst offenders are important sourcing and business regions for many large US companies such as Apple (AAPL), Nike (NKE), and Walmart (WMT). China, for example, will see an estimated reciprocal tariff of 34%. Vietnam at 32%. Japan is at 24%. The news has hit stocks, with Dow Jones Industrial Average futures down about 1,200 points, or nearly 3% (YM=F). S&P 500 futures are down 3.5% (ES=F), and Nasdaq futures are off by 3.8% (NQ=F). Japan’s Nikkei (^N225) and Hong Kong’s Hang Seng Index (^HSI) have also registered significant losses. Here’s the hot analysis investors need to know right now:First, retail stocks are getting battered. Walmart, Nike, and Under Armour (UAA, UA) are getting slammed as steep tariffs on China could hammer profits. Nike, for example, relies on China and Vietnam for 55% of its sourcing. Stifel analyst Jim Duffy estimates Nike could see $1.69 a share in earnings wiped out this year because of tariffs. Next up, Apple is going to have a rough day: Morgan Stanley estimates that the tariffs on iPhones and other devices from China will increase Apple’s annual costs by a whopping $8.5 billion. That could hit Apple’s profits by 52 cents next year. Brutal. And lastly, the technical takedown: Market technicians are locked in on the S&P 500’s March 13 closing low of 5,527.50. At this moment, the S&P 500 (^GSPC) is poised to test that low. A break through below the March lows intraday coupled with a new closing low could really damage sentiment further pros warn. RBC strategist Lori Calvasina says the S&P 500 has a clear shot to 4,900 if that low is breached. For more expert insight and the latest market action, click here.",
            "publication_date": "2025-04-03T12:22:17.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.9485",
            "source": "Yahoo Finance Video",
            "ticker": "UAA",
            "title": "Trump tariffs send stocks spiraling! 3 things investors need to know",
            "url": "https://finance.yahoo.com/video/trump-tariffs-send-stocks-spiraling-122217686.html"
        },
        {
            "headline": "We recently published a list of Friday’s 10 Worst Performing Stocks. In this article, we are going to take a look at where Under Armour Inc. (NYSE:UAA) stands against other Friday’s worst performing stocks. Wall Street’s main indices bounced back on Friday, erasing the entire week’s losses, as investor hopes were fueled by news that […]",
            "publication_date": "2025-03-15T07:01:17.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.8442",
            "source": "Insider Monkey",
            "ticker": "UAA",
            "title": "Why Under Armour Inc. (UAA) Went Down On Friday?",
            "url": "https://finance.yahoo.com/news/why-under-armour-inc-uaa-070117821.html"
        },
        {
            "headline": "CRI faces near-term pressures from U.S. Retail weakness, rising costs and macro pressures, which overshadow its Wholesale business growth.",
            "publication_date": "2025-03-07T17:11:00.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.5859",
            "source": "Zacks",
            "ticker": "UAA",
            "title": "Carter's Stock Dips 6.6% Post Q4 Earnings: Time to Buy or Stay Put?",
            "url": "https://finance.yahoo.com/news/carters-stock-dips-6-6-171100672.html"
        }
    ],
    "Avg Score": 0.02361111111111111
}