{
    "importantArticles": [
        {
            "headline": "Uber Technologies (NYSE:UBER) saw a 21% increase in its share price over the last quarter, supported by several strategic partnerships and expansions. The recent collaboration with Coco Robotics, launching in Miami, and the joint initiative with WeRide to enhance autonomous vehicle access in Dubai suggests UBER's commitment to innovation and market expansion. These developments were likely favorably viewed by investors amid a generally positive tech stock environment, as reflected by gains in...",
            "publication_date": "2025-04-02T17:58:57.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.9559",
            "source": "Simply Wall St.",
            "ticker": "UBER",
            "title": "Uber Technologies (NYSE:UBER) Unveils Robot Delivery Expansion And Autonomous Ventures In Dubai",
            "url": "https://finance.yahoo.com/news/uber-technologies-nyse-uber-unveils-175857438.html"
        },
        {
            "headline": "A new partnership between Domino's and DoorDash means that uniformed Domino's drivers will deliver pizzas ordered through the DoorDash app, the pizza company said Wednesday.  Being listed on the DoorDash app means it will be easier for Domino's to reach new customers accustomed to ordering through the DoorDash app, and Chief Executive Officer Joe Jordan said in a prepared statement the company expects to gain new customers particularly in rural and suburban areas.  Jordan said third-party delivery platforms are a \"$1 billion opportunity\" for the pizza company.",
            "publication_date": "2025-04-02T11:14:15.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.875",
            "source": "Reuters",
            "ticker": "UBER",
            "title": "Domino's partners with DoorDash in US stores to lure customers",
            "url": "https://finance.yahoo.com/news/dominos-partners-doordash-us-stores-111415803.html"
        },
        {
            "headline": "It's difficult to see upside for stocks when pessimism is pervasive, but as investors were reminded in 2022, buying shares of growing companies amid fear on Wall Street can earn you monster returns later on.  Worries over tariffs are gripping Wall Street right now, but there are stocks ready to soar based on their business opportunities.  Uber Technologies (NYSE: UBER) and Chewy (NYSE: CHWY) are seeing strong momentum in their businesses.",
            "publication_date": "2025-04-06T08:10:00.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.6652",
            "source": "Motley Fool",
            "ticker": "UBER",
            "title": "2 Growth Stocks With Great Return Potential in 2025 and Beyond",
            "url": "https://finance.yahoo.com/news/2-growth-stocks-great-return-081000799.html"
        },
        {
            "headline": "BofA notes that President Trump’s newly announced tariffs were larger than anticipated and are “a direct negative” for discretionary retail sales and advertising. In addition, the potential for increasing recession fears fueled by the tariffs are “a relative negative for the entire Internet sector,” which the analyst notes underperformed in 2008 and 2022 as fears of a recession grew. The “only potential silver lining” is that proposed rates could be viewed as a negotiation tool that may not be f",
            "publication_date": "2025-04-04T13:16:20.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.9313",
            "source": "TipRanks",
            "ticker": "UBER",
            "title": "Tariff-fueled recession fears ‘relative negative’ for Internet sector, says BofA",
            "url": "https://finance.yahoo.com/news/tariff-fueled-recession-fears-relative-131620534.html"
        },
        {
            "headline": "Signs of Tesla's (NASDAQ: TSLA) brand crisis are almost everywhere you look.  Over the weekend, more than 200 \"Tesla Takedown\" protests were held across the country as Americans expressed their ire about CEO Elon Musk's project to downsize federal agencies -- which President Donald Trump refers to as the Department of Government Efficiency (DOGE) -- by targeting his company.  Sales in Europe appear to be plunging; registration data showed Tesla sales were down 42% across most of Europe in the first two months of the year.",
            "publication_date": "2025-04-03T14:36:00.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.5423",
            "source": "Motley Fool",
            "ticker": "UBER",
            "title": "Will Tesla's Pain Be This EV Stock's Gain?",
            "url": "https://finance.yahoo.com/news/teslas-pain-ev-stocks-gain-143600614.html"
        },
        {
            "headline": "Wall Street is wasting no time adjusting their views on certain stocks in the wake of bruising Trump tariffs.",
            "publication_date": "2025-04-04T13:54:45.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.4215",
            "source": "Yahoo Finance",
            "ticker": "UBER",
            "title": "Wall Street now hates these 10 stocks because of Trump tariffs",
            "url": "https://finance.yahoo.com/news/wall-street-now-hates-these-10-stocks-because-of-trump-tariffs-135445636.html"
        }
    ],
    "avgScore": 0.19903684210526312,
    "todayPctChange": -0.03998220110304174,
    "vScore": -0.7957931047966995
}