{
    "Important Articles": [
        {
            "headline": "SPB faces financial pressures, but strong e-commerce growth, cost savings and pricing strategies can help drive a turnaround in 2025.",
            "publication_date": "2025-03-26T14:29:00.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.8945",
            "source": "Zacks",
            "ticker": "VFC",
            "title": "Spectrum Brands Trades Near 52-Week Low: Buy, Hold or Sell Stock?",
            "url": "https://finance.yahoo.com/news/spectrum-brands-trades-near-52-142900344.html"
        },
        {
            "headline": "Madison Investments, an investment advisor, released its “Madison Small Cap Fund” fourth-quarter 2024 investor letter. A copy of the letter can be downloaded here. The Madison Small Cap Fund completed a great year in the fourth quarter. For the fourth quarter and the entire year, the fund generated strong absolute and relative returns. Growth continued […]",
            "publication_date": "2025-02-17T14:16:35.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.875",
            "source": "Insider Monkey",
            "ticker": "VFC",
            "title": "Should You Invest in VF Corporation (VFC)?",
            "url": "https://finance.yahoo.com/news/invest-vf-corporation-vfc-141635132.html"
        },
        {
            "headline": "We recently published a list of Michael Burry’s Top Holdings Were Gaining While NVDA Was Crashing. In this article, we are going to take a look at where V.F. Corporation (NYSE:VFC) stands against other Michael Burry’s top Holdings that were gaining while NVDA was crashing. Michael Burry’s name is synonymous with contrarian investing strategies, being […]",
            "publication_date": "2025-03-18T13:49:31.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.802",
            "source": "Insider Monkey",
            "ticker": "VFC",
            "title": "V.F. Corporation (VFC): Among Michael Burry’s Top Holdings",
            "url": "https://finance.yahoo.com/news/v-f-corporation-vfc-among-134931190.html"
        },
        {
            "headline": "We recently published a list of 10 Firms Take a Beating on Tariff Worries. In this article, we are going to take a look at where V.F. Corporation (NYSE:VFC) stands against other Thursday’s worst performers. Wall Street’s three major indices suffered a bloodbath on Thursday as investors continued to digest news of President Donald Trump’s […]",
            "publication_date": "2025-04-04T11:10:49.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.9201",
            "source": "Insider Monkey",
            "ticker": "VFC",
            "title": "Why V.F. Corporation (VFC) Went Down On Thursday?",
            "url": "https://finance.yahoo.com/news/why-v-f-corporation-vfc-111049824.html"
        },
        {
            "headline": "We recently compiled a list of the 10 Stocks Drop Double Digits as Investor Caution Lingers. In this article, we are going to take a look at where V.F. Corporation (NYSE:VFC) stands against the other stocks. The stock market fell into the negative territory on Thursday, as investor caution lingered over the ongoing trade tensions among […]",
            "publication_date": "2025-03-07T19:45:02.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.8176",
            "source": "Insider Monkey",
            "ticker": "VFC",
            "title": "Why V.F. Corporation (VFC) Crashed on Thursday",
            "url": "https://finance.yahoo.com/news/why-v-f-corporation-vfc-194502249.html"
        },
        {
            "headline": "We recently compiled a list of the 10 Stocks Bear the Brunt of Trade Threats. In this article, we are going to take a look at where V.F. Corporation (NYSE:VFC) stands against the other stocks. Wall Street’s main indices fell further on Tuesday as investors sold off positions to mitigate risks from the ongoing trade tensions […]",
            "publication_date": "2025-03-05T18:12:23.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.765",
            "source": "Insider Monkey",
            "ticker": "VFC",
            "title": "Why V.F. Corporation (VFC) Crashed on Tuesday",
            "url": "https://finance.yahoo.com/news/why-v-f-corporation-vfc-181223431.html"
        }
    ],
    "Avg Score": 0.21839743589743585
}