{
    "importantArticles": [
        {
            "headline": "This week on Yahoo Finance Sports Report, host Joe Pompliano takes a look at some of this week’s biggest headlines in the sports business world that you and your portfolio need to know. From Warner Bros. Discovery (WBD) scaling back its sports media rights to the MLB Players Association bracing for another lockout, the financial landscape of professional sports continues to shift. Plus, the Caitlin Clark effect continues as the Chicago Sky moves its matchups against the Indiana Fever to a larger venue to accommodate for an increase in fan attendance. Here's what you need to know: Warner Bros. Discovery cuts back on sports Following their fourth quarter earnings call, Warner Bros. Discovery CEO David Zaslav told investors WBD will be prioritizing intellectual property (IP) from film and TV properties that the company can own versus sports media rights. Zaslav said, “We don’t need any more sports anywhere in the world in order to support our business.” Though WBD will be losing the NBA after this season when their media rights deal ends, the company still owns the rights to the NHL, tennis French Open, NASCAR, Unrivaled women’s basketball league, and All Elite Wrestling. MLB Players Association expects lockout in next round of CBA negotiations The MLB is currently in the midst of collective bargaining negotiations for 2026 and the union is anticipating an offseason lockout. The last time the league faced a lockout was in 2021 and it delayed the 2022 season by a week. MLBPA Executive Director Tony Clark says 2026 CBA negotiations will start this coming spring and if a new CBA is not signed by December 1, the MLB will likely enter a lockout. Chicago Sky moves Caitlin Clark & Indiana Fever games to the United Center It’s the Caitlin Clark effect all over again. Chicago Sky announced they will be moving their two home games against the Indiana Fever from the Wintrust Arena to the United Center. This move will allow for 10,000 more tickets to be sold for each of these games, as the United Center has almost twice the capacity of Wintrust Arena. Plus, Carrick Rangers F.C. Owner Michael W. Smith stops by the show to talk about the Northern Ireland Football League club. He also discusses both the global growth of small-market teams as well as the unique ways the team raises funds and remains profitable. Yahoo Finance Sports Report with Joe Pompliano, a vodcast brought to you by Yahoo Finance and Yahoo Sports, looks beyond the latest sports business headlines, analyzes all the need-to-know news - the teams, trades, and billion dollar deals - so you and your portfolio will win BIG. Yahoo Finance Sports Report is developed and produced by Lauren Pokedoff.",
            "publication_date": "2025-03-06T16:00:47.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.9719",
            "source": "Yahoo Finance Video",
            "ticker": "WBD",
            "title": "WBD & sports media rights, MLB lockout looms: Sports Report",
            "url": "https://finance.yahoo.com/video/wbd-sports-media-rights-mlb-160047682.html"
        },
        {
            "headline": "Mattel, Inc. (MAT) and Warner Bros. Discovery (WBD) Global Consumer Products announced a global, multiyear licensing agreement utilizing DC’s entire library of characters and storytelling. Through the partnership, Mattel is awarded the global licensing rights to develop and market a full range of DC-themed action figures, playsets, accessories, role play products, and adult collectibles starting in the second half of 2026. The agreement spans all DC stories and characters including Batman, Super",
            "publication_date": "2025-02-28T17:05:21.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.9371",
            "source": "TipRanks",
            "ticker": "WBD",
            "title": "Mattel, Warner Bros. announce multiyear licensing deal for DC characters",
            "url": "https://finance.yahoo.com/news/mattel-warner-bros-announce-multiyear-170521003.html"
        },
        {
            "headline": "“Now Streaming” is The Fly’s weekly recap of the stories surrounding the biggest content streamers. PLAYING THIS WEEKEND: Among this week’s most notable new streaming content is season one of Marvel Comics series “Daredevil: Born Again,” whose first two episodes are available to watch on Disney+ (DIS). Meanwhile, Amazon Prime Video (AMZN) subscribers can watch British romantic comedy film “Picture This,” while Max (WBD) users can watch the first episode of the new season of comedy series “The Ri",
            "publication_date": "2025-03-08T16:51:39.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.9141",
            "source": "TipRanks",
            "ticker": "WBD",
            "title": "Now Streaming: Judge may consider blocking Paramount-Skydance deal",
            "url": "https://finance.yahoo.com/news/now-streaming-judge-may-consider-165139613.html"
        },
        {
            "headline": "If you're not sure where to start when looking for the next multi-bagger, there are a few key trends you should keep an...",
            "publication_date": "2025-03-13T11:23:07.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.2411",
            "source": "Simply Wall St.",
            "ticker": "WBD",
            "title": "Warner Bros. Discovery's (NASDAQ:WBD) Returns On Capital Not Reflecting Well On The Business",
            "url": "https://finance.yahoo.com/news/warner-bros-discoverys-nasdaq-wbd-112307430.html"
        },
        {
            "headline": "Warner Bros. Discovery, Inc. (Nasdaq: WBD) today announced that its President and CEO David Zaslav will present at Morgan Stanley's 2025 Technology, Media & Telecom Conference on Tuesday, March 4, 2025 at 10:00 a.m. ET (7:00 a.m. PT).",
            "publication_date": "2025-02-25T21:15:00.000Z",
            "sentiment": "Neutral",
            "sentimentScore": "0.0",
            "source": "PR Newswire",
            "ticker": "WBD",
            "title": "Warner Bros. Discovery President and CEO David Zaslav to Present at the Morgan Stanley 2025 Technology, Media & Telecom Conference",
            "url": "https://finance.yahoo.com/news/warner-bros-discovery-president-ceo-211500220.html"
        },
        {
            "headline": "Disney reported quarterly results before the bell on Wednesday. Here's what to know.",
            "publication_date": "2025-02-05T14:41:31.000Z",
            "sentiment": "Neutral",
            "sentimentScore": "0.0",
            "source": "Yahoo Finance",
            "ticker": "WBD",
            "title": "Disney price hikes help fuel earnings growth as streaming business posts profit",
            "url": "https://finance.yahoo.com/news/disney-price-hikes-help-fuel-earnings-growth-as-streaming-business-posts-profit-144131406.html"
        }
    ],
    "avgScore": 0.5060705882352942,
    "todayPctChange": -0.08200448009704452,
    "vScore": -4.15000554806408
}