{
    "4 25 2025": {
        "importantArticles": [
            {
                "headline": "Retail stocks may be under pressure, but not all names are created equal. Gerald \"Jerry\" Storch, CEO of Storch Advisors and former CEO of Toys R Us, explains why companies like Walmart (WMT), Costco (COST), and TJX (TJX) could stay resilient. To watch more expert insights and analysis on the latest market action, check out more Market Domination&nbsp;here.",
                "publication_date": "2025-04-25T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.631",
                "source": "Yahoo Finance Video",
                "ticker": "WMT",
                "title": "3 retailers that are 'heavily insulated' from tariff volatility",
                "url": "https://finance.yahoo.com/video/3-retailers-heavily-insulated-tariff-202728677.html"
            },
            {
                "headline": "Zacks.com users have recently been watching Walmart (WMT) quite a bit. Thus, it is worth knowing the facts that could determine the stock's prospects.",
                "publication_date": "2025-04-25T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.4767",
                "source": "Zacks",
                "ticker": "WMT",
                "title": "Here is What to Know Beyond Why Walmart Inc. (WMT) is a Trending Stock",
                "url": "https://finance.yahoo.com/news/know-beyond-why-walmart-inc-130015888.html"
            },
            {
                "headline": "The supercenter retailer’s growing gas station business can drive trips as well as tie in with its membership program and e-commerce services.",
                "publication_date": "2025-04-25T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.4215",
                "source": "Grocery Dive",
                "ticker": "WMT",
                "title": "The Friday Checkout: Walmart takes a page from Costco’s playbook",
                "url": "https://finance.yahoo.com/news/friday-checkout-walmart-takes-page-095214249.html"
            },
            {
                "headline": "President Donald Trump's trade war policies are bringing about changes in global shipping not seen since the coronavirus pandemic, with ocean carriers readying for significantly reduced demand, according to analysts and observers.  The uncertainty has led to a decrease in shipping volumes from China to North America, with cancellations currently at 50%, according to global logistics firm Flexport.  Flexport reports that the short-term outlook for shipment-volume growth from Southeast Asia to North America \"remains muted.\"",
                "publication_date": "2025-04-25T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.6369",
                "source": "Investor's Business Daily",
                "ticker": "WMT",
                "title": "Trump Trade War Update: Shipping Cancellations Could Rival 'Those Of The Pandemic'",
                "url": "https://finance.yahoo.com/m/9dfecec3-0c7d-3d82-ab6a-637448b51143/trump-trade-war-update-.html"
            },
            {
                "headline": "On Episode 830 of WHAT THE TRUCK?!?, Dooner is back from Chicago, where he got to see that state of freight on the world’s most powerful visibility platform: project44. With ocean booking cancellations up bigly on the East and West coasts, when will trucking feel the pain? Did you know that if you export or […] The post AI for duty drawback: Get back 99% of what you pay in tariffs; Walmart’s drones | WHAT THE TRUCK?!? appeared first on FreightWaves.",
                "publication_date": "2025-04-25T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.4855",
                "source": "FreightWaves",
                "ticker": "WMT",
                "title": "AI for duty drawback: Get back 99% of what you pay in tariffs; Walmart’s drones | WHAT THE TRUCK?!?",
                "url": "https://finance.yahoo.com/news/ai-duty-drawback-back-99-173749838.html"
            },
            {
                "headline": "Nintendo Switch 2 pre-orders went live Thursday. Many shoppers looking for one were met with outages, \"sold out\" messages, and site glitches.",
                "publication_date": "2025-04-25T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Investopedia",
                "ticker": "WMT",
                "title": "Nintendo Switch 2 Pre-Orders Are Hot Tickets After Tariff Delay",
                "url": "https://finance.yahoo.com/news/nintendo-switch-2-pre-orders-211949964.html"
            }
        ],
        "avgScore": 0.13272499999999995,
        "pctChange": -0.0074113433324589
    },
    "4 24 2025": {
        "importantArticles": [
            {
                "headline": "If you want to collect a lot of dividend income, it's important to focus on more than just a stock's current yield.  Stocks that consistently grow their payouts over the years can be far more valuable investments to hang on to because that can ensure your dividend income is rising, possibly at a higher rate than inflation.  Three stocks which have impressive track records for dividend growth are Walmart (NYSE: WMT), Johnson & Johnson (NYSE: JNJ), and Procter & Gamble (NYSE: PG).",
                "publication_date": "2025-04-24T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9184",
                "source": "Motley Fool",
                "ticker": "WMT",
                "title": "3 Dividend Kings That Have Raised Their Payouts in 2025",
                "url": "https://finance.yahoo.com/news/3-dividend-kings-raised-payouts-123400821.html"
            },
            {
                "headline": "Walmart (WMT) is stepping up its discount strategy to boost demand and gain market share amid curren",
                "publication_date": "2025-04-24T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7783",
                "source": "MT Newswires",
                "ticker": "WMT",
                "title": "Market Chatter: Walmart Ramps Up Discounts to Boost Sales",
                "url": "https://finance.yahoo.com/news/market-chatter-walmart-ramps-discounts-154252315.html"
            },
            {
                "headline": "(Bloomberg) -- Supply Lines is a daily newsletter that tracks global trade. Sign up here.Most Read from BloombergTrump Gives New York ‘One Last Chance’ to End Congestion FeeWhy Car YouTuber Matt Farah Is Fighting for Walkable CitiesBackyard Micro-Flats Aim to Ease South Africa’s Housing CrisisThe Racial Wealth Gap Is Not Just About MoneyTo Fuel Affordable Housing, This Innovation Fund Targets Predevelopment CostsConfronted with fresh warnings from financial markets, business leaders and top advi",
                "publication_date": "2025-04-24T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7717",
                "source": "Bloomberg",
                "ticker": "WMT",
                "title": "Trump’s U-Turns on Powell, China Follow Dire Economic Warnings",
                "url": "https://finance.yahoo.com/news/trump-u-turns-powell-china-073351990.html"
            },
            {
                "headline": "LONDON (Reuters) -Household goods and packaged food makers are easing U.S. price increases to avoid losing American shoppers to retailers' less expensive private-label brands as a global trade war tests the limits of their pricing power at grocery stores.  U.S. President Donald Trump has imposed broad tariffs on several countries around the world in recent months, sparking worries that the U.S. economy will be pushed into recession, with commodities and basic utilities becoming more expensive.  Trump met with major retailers, including Walmart and Target on Monday to discuss the tariffs' impact on their imports.",
                "publication_date": "2025-04-24T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.9118",
                "source": "Reuters",
                "ticker": "WMT",
                "title": "Analysis-Nestle, rivals ease US price hikes in bid for anxious American shopper",
                "url": "https://finance.yahoo.com/news/analysis-nestle-rivals-ease-us-083735636.html"
            },
            {
                "headline": "If supermarket and hardware store shelves are empty in the near future, President Donald Trump can’t say he wasn’t warned.",
                "publication_date": "2025-04-24T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.4404",
                "source": "Quartz",
                "ticker": "WMT",
                "title": "Walmart and Target CEOs warn Trump: Tariffs could mean empty shelves",
                "url": "https://finance.yahoo.com/news/walmart-target-ceos-warn-trump-135140284.html"
            },
            {
                "headline": "While the S&P 500 (^GSPC) includes industry leaders, not every stock in the index is a winner. Some companies are past their prime, weighed down by poor execution, weak financials, or structural headwinds.",
                "publication_date": "2025-04-24T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.296",
                "source": "StockStory",
                "ticker": "WMT",
                "title": "1 S&P 500 Stock to Target This Week and 2 to Keep Off Your Radar",
                "url": "https://finance.yahoo.com/news/1-p-500-stock-target-130200370.html"
            }
        ],
        "avgScore": 0.14970714285714287,
        "pctChange": -0.007825542869970722
    },
    "4 23 2025": {
        "importantArticles": [
            {
                "headline": "We recently published a list of the 12 Best Stocks Under $100 to Buy According to Hedge Funds. In this article, we are going to take a look at where Walmart Inc. (NYSE:WMT) stands against other stocks under $100 to buy according to hedge funds. On April 21, Chris Davis of Davis Advisors appeared on […]",
                "publication_date": "2025-04-23T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.6369",
                "source": "Insider Monkey",
                "ticker": "WMT",
                "title": "Is Walmart Inc. (NYSE:WMT) the Best Stock Under $100 to Buy According to Hedge Funds?",
                "url": "https://finance.yahoo.com/news/walmart-inc-nyse-wmt-best-152400131.html"
            },
            {
                "headline": "After quietly developing its gas station footprint over the past decade, the big box retailer has a refined strategy and is looking to expand quickly, its VP of fuel and convenience says.",
                "publication_date": "2025-04-23T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.3182",
                "source": "C-Store Dive",
                "ticker": "WMT",
                "title": "Inside Walmart’s aggressive c-store growth plans",
                "url": "https://finance.yahoo.com/news/inside-walmart-aggressive-c-store-100000176.html"
            },
            {
                "headline": "Only certain kinds of companies are built to last through whatever unknowns the future may hold.",
                "publication_date": "2025-04-23T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.2732",
                "source": "Motley Fool",
                "ticker": "WMT",
                "title": "3 Stocks That Could Create Lasting Generational Wealth",
                "url": "https://finance.yahoo.com/news/3-stocks-could-create-lasting-093000526.html"
            },
            {
                "headline": "All three retailers just took a major step in addressing a growing problem.",
                "publication_date": "2025-04-23T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.25",
                "source": "TheStreet",
                "ticker": "WMT",
                "title": "Walmart, Home Depot, Target tackle a major customer concern",
                "url": "https://finance.yahoo.com/news/walmart-home-depot-target-tackle-141700561.html"
            },
            {
                "headline": "President told reporters that new tariff rate “won’t be anywhere near” 145%",
                "publication_date": "2025-04-23T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Supermarket News",
                "ticker": "WMT",
                "title": "Trump backs down on China tariffs day after meeting with Walmart, Target CEOs",
                "url": "https://finance.yahoo.com/news/trump-backs-down-china-tariffs-162936757.html"
            },
            {
                "headline": "If tariffs on China fall \"substantially,\" one of these three consumer goods stocks is a lot cheaper than the others. And one is still really, really expensive.",
                "publication_date": "2025-04-23T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Motley Fool",
                "ticker": "WMT",
                "title": "Why Hasbro, Mattel, and Walmart Stock Investors Love President Trump's Latest Tariffs Promise",
                "url": "https://finance.yahoo.com/news/why-hasbro-mattel-walmart-stock-164200121.html"
            }
        ],
        "avgScore": 0.16865714285714284,
        "pctChange": 0.009267030980435857
    },
    "4 22 2025": {
        "importantArticles": [
            {
                "headline": "Walmart (NYSE:WMT) experienced a 7% increase in its share price over the past month, reflecting a broader market upswing. Notably, the launch of Because's trusted absorbency products at Walmart stores may have added weight to this positive momentum. Meanwhile, the company's recent opening of a significant distribution center in Jacksonville aligns with its growth objectives. While market-wide factors like the Dow's surge significantly influenced stock movements, Walmart's efforts in expanding...",
                "publication_date": "2025-04-22T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9497",
                "source": "Simply Wall St.",
                "ticker": "WMT",
                "title": "Walmart (NYSE:WMT) Expands Incontinence Product Range With Because Collaboration",
                "url": "https://finance.yahoo.com/news/walmart-nyse-wmt-expands-incontinence-173447516.html"
            },
            {
                "headline": "KR offers an attractive investment opportunity, with stronger value, better recent performance and a more favorable earnings outlook.",
                "publication_date": "2025-04-22T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9432",
                "source": "Zacks",
                "ticker": "WMT",
                "title": "Walmart vs. Kroger: Which Retail Giant is the Smarter Buy Today?",
                "url": "https://finance.yahoo.com/news/walmart-vs-kroger-retail-giant-125700331.html"
            },
            {
                "headline": "The stocks of big-box retailers and large e-commerce companies rebounded today, as news reports hinted at progress on negotiations between the Trump administration and trade partners.  U.S. Treasury Secretary Scott Bessent also reportedly expressed more positive sentiment regarding the United States' frayed relationship with China.  Shares of Amazon (NASDAQ: AMZN) traded roughly 3.3% higher, as of 1:34 p.m. ET today.",
                "publication_date": "2025-04-22T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9216",
                "source": "Motley Fool",
                "ticker": "WMT",
                "title": "Why Shares of Amazon, Walmart, and Home Depot Are Rebounding Today",
                "url": "https://finance.yahoo.com/news/why-shares-amazon-walmart-home-175900863.html"
            },
            {
                "headline": "We recently published a list of 9 Stocks That Could 10X Over the Next 2 Years. In this article, we are going to take a look at where Walmart Inc. (NYSE:WMT) stands against other stocks that could 10X over the next 2 years. US Tariffs and the Stock Market Turmoil While tariffs from the US […]",
                "publication_date": "2025-04-22T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.3612",
                "source": "Insider Monkey",
                "ticker": "WMT",
                "title": "Walmart Inc. (WMT): Among Stocks That Could 10X Over the Next 2 Years",
                "url": "https://finance.yahoo.com/news/walmart-inc-wmt-among-stocks-021801772.html"
            },
            {
                "headline": "It was a simpler time in 2015: The internet was obsessed with figuring out the color of a dress, Pizza Rat was the most famous New Yorker, and Wall Street was sure that  Amazon  com was the only retailer Americans would ever need in the future.  Although Amazon had been making waves in retail long before, 2015 was the year when investors acted as if it would replace all its competition.  Walmart  was seen as one of biggest losers from Amazon’s ascent: The shares dropped nearly 30% that year as investors worried its stodgy model would get left behind in the internet age.",
                "publication_date": "2025-04-22T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.1027",
                "source": "Barrons.com",
                "ticker": "WMT",
                "title": "Retail Is Tough. Amazon and Walmart Stock Can Both Win in a Downturn.",
                "url": "https://finance.yahoo.com/m/bba8eb57-7856-31fa-a388-25d8901350b8/retail-is-tough-amazon-and.html"
            },
            {
                "headline": "Flipkart is making the move ahead of its listing in domestic markets.",
                "publication_date": "2025-04-22T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Investment Monitor",
                "ticker": "WMT",
                "title": "Flipkart to relocate headquarters from Singapore to India",
                "url": "https://finance.yahoo.com/news/flipkart-relocate-headquarters-singapore-india-080715791.html"
            }
        ],
        "avgScore": 0.4379733333333334,
        "pctChange": 0.0011597323365437385
    },
    "4 21 2025": {
        "importantArticles": [
            {
                "headline": "We recently published a list of 10 Best Low Volatility Stocks to Buy Now. In this article, we are going to take a look at where Walmart Inc. (NYSE:WMT) stands against other best low volatility stocks to buy now. The US stock market experienced a turbulent first quarter of 2025, marked by increased volatility and […]",
                "publication_date": "2025-04-21T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8074",
                "source": "Insider Monkey",
                "ticker": "WMT",
                "title": "Is Walmart Inc. (WMT) the Best Low Volatility Stock to Buy Now?",
                "url": "https://finance.yahoo.com/news/walmart-inc-wmt-best-low-142509600.html"
            },
            {
                "headline": "WASHINGTON (Reuters) -U.S. President Donald Trump met with major retailers, including Walmart, Home Depot, Lowe's and Target, on Monday to discuss broad-based tariffs likely to raise the cost of everyday goods that they import.  Big U.S. chains, like Walmart and Target, rely heavily on imported goods, and tariffs — including 145% levies on China — are expected to add strain on Americans already burdened by prolonged inflation.  \"We had a productive meeting with President Trump and his team and appreciated the opportunity to share our insights,\" a Walmart spokesperson said in a statement, without elaborating.",
                "publication_date": "2025-04-21T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7845",
                "source": "Reuters",
                "ticker": "WMT",
                "title": "Trump meets with US retailers to discuss tariffs",
                "url": "https://finance.yahoo.com/news/trump-meet-retailers-including-walmart-164424018.html"
            },
            {
                "headline": "(Bloomberg) -- Heavy selling lashed Wall Street anew Monday, with longer-dated Treasuries joining stocks and the dollar in a deepening slump, after President Donald Trump’s censure of Jerome Powell’s interest-rate policy sowed angst among investors already coping with a global trade war.Most Read from BloombergDOGE Visits National Gallery of Art to Discuss Museum’s Legal StatusTrump Gives New York ‘One Last Chance’ to End Congestion FeeTrump Administration Takes Over New York Penn Station Revamp",
                "publication_date": "2025-04-21T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.34",
                "source": "Bloomberg",
                "ticker": "WMT",
                "title": "Stocks, Bonds Sink in Broad Retreat From US Assets: Markets Wrap",
                "url": "https://finance.yahoo.com/news/dollar-stock-futures-decline-trump-063750351.html"
            },
            {
                "headline": "President Donald Trump is reportedly having a sit-down with some retailers regarding the tariffs he has imposed on goods imported from foreign countries.",
                "publication_date": "2025-04-21T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.0772",
                "source": "Fox Business",
                "ticker": "WMT",
                "title": "Trump meeting retailers including Walmart, Home Depot, Target regarding tariff concerns",
                "url": "https://finance.yahoo.com/news/trump-meeting-retailers-including-walmart-192417895.html"
            },
            {
                "headline": "The facility is tasked with handling and distributing products to 18 Sam’s Club outlets and seven clubs in Puerto Rico.",
                "publication_date": "2025-04-21T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Retail Insight Network",
                "ticker": "WMT",
                "title": "Walmart launches new distribution hub in Jacksonville, US",
                "url": "https://finance.yahoo.com/news/walmart-launches-distribution-hub-jacksonville-092808763.html"
            },
            {
                "headline": "The effort includes store openings under the Bodega Aurrera, Sam’s Club, Walmart Supercenters and Walmart Express banners.",
                "publication_date": "2025-04-21T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Retail Dive",
                "ticker": "WMT",
                "title": "Walmart to invest $6B in Mexico operations",
                "url": "https://finance.yahoo.com/news/walmart-invest-6b-mexico-operations-120000874.html"
            }
        ],
        "avgScore": 0.257125,
        "pctChange": 0.026404011636374205
    },
    "4 17 2025": {
        "importantArticles": [
            {
                "headline": "JACKSONVILLE, Fla., April 17, 2025--Today, associates, elected officials and community members celebrated the grand opening of a new 1-million-square-foot distribution center in Jacksonville. The facility located at 1511 Zoo Parkway, receives and processes items for delivery to 18 Sam’s Club locations across Florida, Georgia and South Carolina as well as seven clubs in Puerto Rico. Located just 10 minutes from the Port of Jacksonville, the facility also stores and sorts imported goods for delive",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8316",
                "source": "Business Wire",
                "ticker": "WMT",
                "title": "Walmart Opens New Distribution Center in Jacksonville, Florida",
                "url": "https://finance.yahoo.com/news/walmart-opens-distribution-center-jacksonville-140000225.html"
            },
            {
                "headline": "Walmart (NYSE:WMT) has seen dynamic developments recently, such as the opening of a 1-million-square-foot distribution center in Jacksonville, highlighting its efforts in business expansion and community engagement. Over the past month, the company’s stock price rose 4%, setting it apart from a recent broader market trend that saw a decline. The market's mixed response amid the sell-off in major indexes was influenced by external economic tensions, like chip export restrictions. Against this...",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.6597",
                "source": "Simply Wall St.",
                "ticker": "WMT",
                "title": "Walmart (NYSE:WMT) Expands Regional Reach With Large Jacksonville Distribution Center",
                "url": "https://finance.yahoo.com/news/walmart-nyse-wmt-expands-regional-173319507.html"
            },
            {
                "headline": "The data-science capability redefines the retailer’s delivery maps to expand the channel’s reach and accessibility.",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.34",
                "source": "Grocery Dive",
                "ticker": "WMT",
                "title": "Walmart will use geospatial tech to power delivery",
                "url": "https://finance.yahoo.com/news/walmart-geospatial-tech-power-delivery-090046344.html"
            },
            {
                "headline": "Companies from Tesla to Meta have left or are considering leaving Delaware after a series of controversial court decisions. WSJ looks at the impact of that exodus and talks with Gov. Matt Meyer about how the state is fighting back.",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5106",
                "source": "WSJ",
                "ticker": "WMT",
                "title": "Big Companies Are Leaving Delaware. Can Its Governor Stop the Exodus?",
                "url": "https://finance.yahoo.com/video/big-companies-leaving-delaware-governor-040100796.html"
            },
            {
                "headline": "The technology integrates dynamic data points, available time slots, travel duration, store capacity and consumer demand.",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.2732",
                "source": "Retail Insight Network",
                "ticker": "WMT",
                "title": "Walmart makes same-day delivery more accessible with geospatial tech",
                "url": "https://finance.yahoo.com/news/walmart-makes-same-day-delivery-111635855.html"
            },
            {
                "headline": "The data-science capability redefines the retailer’s delivery maps to expand the channel’s reach and accessibility.",
                "publication_date": "2025-04-17T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.34",
                "source": "Grocery Dive",
                "ticker": "WMT",
                "title": "Walmart will use geospatial tech to power delivery",
                "url": "https://finance.yahoo.com/news/walmart-geospatial-tech-power-delivery-090046344.html"
            }
        ],
        "avgScore": 0.31877999999999995,
        "pctChange": -0.00868909620239158
    },
    "4 16 2025": {
        "importantArticles": [
            {
                "headline": "Walmart has signed a deal for a second office space in the southern Indian city of Chennai, which is fast emerging as a major technology center after being known for years as a manufacturing hub.  Global companies are increasingly setting up local hubs in India to support their daily operations, research and development and cybersecurity, which has benefitted commercial real estate developers in cities such as Bengaluru, Hyderabad and Pune.  Chennai, traditionally known for being a manufacturing hub, is now seeing global corporate interest in setting up tech hubs, from major companies such as AstraZeneca, UPS and Pfizer.",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8126",
                "source": "Reuters",
                "ticker": "WMT",
                "title": "Walmart boosts tech presence in India with Chennai office deal, document shows",
                "url": "https://finance.yahoo.com/news/walmart-boosts-tech-presence-india-110035918.html"
            },
            {
                "headline": "We recently published a list of 15 Best Blue Chip Stocks to Buy According to Billionaires. In this article, we are going to take a look at where Walmart Inc. (NYSE:WMT) stands against other best blue chip stocks to buy according to billionaires. Is A Potential Trade War on the Horizon? The US stock market […]",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.6705",
                "source": "Insider Monkey",
                "ticker": "WMT",
                "title": "Is Walmart Inc. (WMT) the Best Blue Chip Stock to Buy According to Billionaires?",
                "url": "https://finance.yahoo.com/news/walmart-inc-wmt-best-blue-210953053.html"
            },
            {
                "headline": "On Wednesday, Walmart (NYSE: WMT) stock was guilty by association in the eyes of the market, a dynamic reflected in a share price drop of nearly 3%.  A top investment bank published a downbeat research note on a major peer in the retail world, and the bearishness spread to Walmart's stock.  Overall, however, few investors were enthusiastic about any stocks, as Walmart's decline was only slightly steeper than the S&P 500's (SNPINDEX: ^GSPC) 2.2% dip.",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.5994",
                "source": "Motley Fool",
                "ticker": "WMT",
                "title": "Why Walmart Stock Slumped by 3% on Wednesday",
                "url": "https://finance.yahoo.com/news/why-walmart-stock-slumped-3-211038020.html"
            },
            {
                "headline": "Motley Fool analyst Asit Sharma caught up with Martín de los Santos, the CFO of MercadoLibre, at The Motley Fool's Market Volatility Summit.  To catch full episodes of all The Motley Fool's free podcasts, check out our podcast center.  Should you invest $1,000 in MercadoLibre right now?",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.1027",
                "source": "Motley Fool",
                "ticker": "WMT",
                "title": "Tariffs, Trump, and Turmoil",
                "url": "https://finance.yahoo.com/news/tariffs-trump-turmoil-141900272.html"
            },
            {
                "headline": "On Wednesday, Walmart (NYSE: WMT) stock was guilty by association in the eyes of the market, a dynamic reflected in a share price drop of nearly 3%.  A top investment bank published a downbeat research note on a major peer in the retail world, and the bearishness spread to Walmart's stock.  Overall, however, few investors were enthusiastic about any stocks, as Walmart's decline was only slightly steeper than the S&P 500's (SNPINDEX: ^GSPC) 2.2% dip.",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.5994",
                "source": "Motley Fool",
                "ticker": "WMT",
                "title": "Why Walmart Stock Slumped by 3% on Wednesday",
                "url": "https://finance.yahoo.com/news/why-walmart-stock-slumped-3-211038020.html"
            },
            {
                "headline": "We recently published a list of 15 Best Blue Chip Stocks to Buy According to Billionaires. In this article, we are going to take a look at where Walmart Inc. (NYSE:WMT) stands against other best blue chip stocks to buy according to billionaires. Is A Potential Trade War on the Horizon? The US stock market […]",
                "publication_date": "2025-04-16T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.6705",
                "source": "Insider Monkey",
                "ticker": "WMT",
                "title": "Is Walmart Inc. (WMT) the Best Blue Chip Stock to Buy According to Billionaires?",
                "url": "https://finance.yahoo.com/news/walmart-inc-wmt-best-blue-210953053.html"
            }
        ],
        "avgScore": 0.5463,
        "pctChange": 0.022261198869922633
    },
    "4 15 2025": {
        "importantArticles": [
            {
                "headline": "As consumers become more aware and more discerning about what they buy, companies that embrace Conscious Capitalism will enjoy an ever-growing competitive edge over those that simply look to grow profits and any cost.  In this podcast, Motley Fool co-founder David Gardner hosts the founder and CEO of Fair Trade USA, Paul Rice, who explains how trade can be more effective than aid in improving the world's economic issues.  To catch full episodes of all The Motley Fool's free podcasts, check out our podcast center.",
                "publication_date": "2025-04-15T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9516",
                "source": "Motley Fool",
                "ticker": "WMT",
                "title": "Every Purchase Matters, With Fair Trade USA's Paul Rice",
                "url": "https://finance.yahoo.com/news/every-purchase-matters-fair-trade-142200960.html"
            },
            {
                "headline": "Walmart is rewriting the rules on retail leadership pay — and it's not subtle. In a sweeping compensation overhaul, the retail giant boosted total potential pay for its market managers to the neighborhood of $620,000 a year, The Wall Street Journal reported in January. That's nearly five times more than the role's former $130,000 base salary — and it's sending a clear message: Walmart wants its top people to think like owners, not just employees. Don't Miss: Deloitte's fastest-growing software c",
                "publication_date": "2025-04-15T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7932",
                "source": "Benzinga",
                "ticker": "WMT",
                "title": "Walmart Bumps Manager Pay to Upwards of $620K — 5X More Than Before. CEO Says It's Time They 'Feel Like Owners' and Run It Like They Built It",
                "url": "https://finance.yahoo.com/news/walmart-bumps-manager-pay-upwards-000006870.html"
            },
            {
                "headline": "We recently published a list of the 10 High Growth Forever Dividend Stocks to Invest In. In this article, we are going to take a look at where Walmart Inc. (NYSE:WMT) stands against other high growth forever dividend stocks. Dividend stocks have trailed the broader market over the past two years, largely due to investors favoring […]",
                "publication_date": "2025-04-15T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7906",
                "source": "Insider Monkey",
                "ticker": "WMT",
                "title": "Walmart Inc. (WMT): Among the High Growth Forever Dividend Stocks to Invest In",
                "url": "https://finance.yahoo.com/news/walmart-inc-wmt-among-high-140205652.html"
            },
            {
                "headline": "We recently published a list of Jim Cramer’s Game Plan: 15 Stocks to Watch. In this article, we are going to take a look at where Walmart Inc. (NYSE:WMT) stands against other stocks that Jim Cramer discusses. On Friday, Mad Money host Jim Cramer outlined what investors should focus on in the week, especially pointing […]",
                "publication_date": "2025-04-15T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.4939",
                "source": "Insider Monkey",
                "ticker": "WMT",
                "title": "Jim Cramer Sees Strength in Walmart Inc. (WMT) Despite Rate Worries – “Don’t Count Retail Out”",
                "url": "https://finance.yahoo.com/news/jim-cramer-sees-strength-walmart-173205422.html"
            },
            {
                "headline": "President Donald Trump announced a 90-day pause on some tariffs.  Meanwhile, the trade dispute with China is heating up.  To catch full episodes of all The Motley Fool's free podcasts, check out our podcast center.",
                "publication_date": "2025-04-15T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.1531",
                "source": "Motley Fool",
                "ticker": "WMT",
                "title": "An Investor's Take on the Latest Tariff News",
                "url": "https://finance.yahoo.com/news/investors-latest-tariff-news-134400797.html"
            },
            {
                "headline": "That comes at the expense of drugstores, department stores, mass merchandisers and even specialty beauty retailers, per TD Cowen.",
                "publication_date": "2025-04-15T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.5859",
                "source": "Retail Dive",
                "ticker": "WMT",
                "title": "As beauty continues to grow, TikTok Shop and Amazon will gain share",
                "url": "https://finance.yahoo.com/news/beauty-continues-grow-tiktok-shop-104800262.html"
            }
        ],
        "avgScore": 0.46341666666666664,
        "pctChange": -0.02958389638377908
    },
    "4 14 2025": {
        "importantArticles": [
            {
                "headline": "Turbulence unleashed by President Donald Trump's tariffs could rock global shipments of shrimp to the United States, with exporters in biggest supplier India saying they endanger 2,000 containers packed with the frozen delicacy.  But Ecuador, thousands of kilometres nearer to the United States faces a lower tariff rate and stands to benefit, the exporters say, as shrimp is its most important export after oil.  India's shrimp industry is staring at a tariff of 26% under Trump's July plan, which threatens a thriving $7-billion seafood export market heavily reliant on U.S. supermarket chains such as Walmart and Kroger as buyers look to renegotiate rates.",
                "publication_date": "2025-04-14T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7776",
                "source": "Reuters",
                "ticker": "WMT",
                "title": "Indian shrimp industry sails in troubled waters after Trump tariffs",
                "url": "https://finance.yahoo.com/news/indian-shrimp-industry-sails-troubled-013751971.html"
            },
            {
                "headline": "MAKSY vs. WMT: Which Stock Is the Better Value Option?",
                "publication_date": "2025-04-14T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.6486",
                "source": "Zacks",
                "ticker": "WMT",
                "title": "MAKSY or WMT: Which Is the Better Value Stock Right Now?",
                "url": "https://finance.yahoo.com/news/maksy-wmt-better-value-stock-154009925.html"
            },
            {
                "headline": "Walmart (WMT) has received quite a bit of attention from Zacks.com users lately. Therefore, it is wise to be aware of the facts that can impact the stock's prospects.",
                "publication_date": "2025-04-14T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.6486",
                "source": "Zacks",
                "ticker": "WMT",
                "title": "Walmart Inc. (WMT) is Attracting Investor Attention: Here is What You Should Know",
                "url": "https://finance.yahoo.com/news/walmart-inc-wmt-attracting-investor-130015736.html"
            },
            {
                "headline": "Walmart (WMT) is gaining traction with higher-income shoppers and expanding profit drivers like advertising, memberships, and its Sam's Club business. Mizuho Americas director and senior analyst David Bellinger joins Asking for a Trend to explain why he sees Walmart as the \"complete package\" and why downside risks appear limited. To watch more expert insights and analysis on the latest market action, check out more Asking for a Trend&nbsp;here.",
                "publication_date": "2025-04-14T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.4939",
                "source": "Yahoo Finance Video",
                "ticker": "WMT",
                "title": "Why this analyst says Walmart is the 'complete package'",
                "url": "https://finance.yahoo.com/video/why-analyst-says-walmart-complete-221712972.html"
            },
            {
                "headline": "The long-term outlooks of Walmart (WMT) and Amazon.com (AMZN) are positive, partly because both names have “pricing power,” Jason Brown, the founder of The Brown Report told Schwab Network recently. The network described Brown as “an expert on stocks.” WMT Has “Huge Pricing Power,” Brown Says In addition to having “huge pricing power,” WMT is […]",
                "publication_date": "2025-04-14T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.5574",
                "source": "Insider Monkey",
                "ticker": "WMT",
                "title": "Top Stock Picker Is Bullish on WMT, AMZN",
                "url": "https://finance.yahoo.com/news/top-stock-picker-bullish-wmt-161642297.html"
            },
            {
                "headline": "Walmart (WMT) has received quite a bit of attention from Zacks.com users lately. Therefore, it is wise to be aware of the facts that can impact the stock's prospects.",
                "publication_date": "2025-04-14T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.6486",
                "source": "Zacks",
                "ticker": "WMT",
                "title": "Walmart Inc. (WMT) is Attracting Investor Attention: Here is What You Should Know",
                "url": "https://finance.yahoo.com/news/walmart-inc-wmt-attracting-investor-130015736.html"
            }
        ],
        "avgScore": 0.6252199999999999,
        "pctChange": -0.008022823913209982
    },
    "4 11 2025": {
        "importantArticles": [
            {
                "headline": "We recently published a list of 10 Best Organic Food Stocks to Buy According to Billionaires. In this article, we are going to take a look at where Walmart Inc. (NYSE:WMT) stands against other best organic food stocks to buy according to billionaires. Overview of the Global Organic Food Industry According to a report by […]",
                "publication_date": "2025-04-11T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8555",
                "source": "Insider Monkey",
                "ticker": "WMT",
                "title": "Why Walmart Inc. (WMT) is Among the Best Organic Food Stocks to Buy According to Billionaires",
                "url": "https://finance.yahoo.com/news/why-walmart-inc-wmt-among-212051434.html"
            },
            {
                "headline": "Walmart (NYSE:WMT) recently saw the launch of Shapermint's Core collection at its stores, highlighting the company's ongoing efforts to diversify product offerings and appeal to a broader customer base. Last week, Walmart's stock price rose by 3.84%, a move that reflects well within the broader positive market trends, as the Dow Jones and other major indices also experienced gains amid volatility driven by trade discussions and economic data. While the Shapermint launch might have added some...",
                "publication_date": "2025-04-11T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7964",
                "source": "Simply Wall St.",
                "ticker": "WMT",
                "title": "Shapermint Expands Into Walmart (NYSE:WMT) Bringing Shaping Essentials To Wider Audience",
                "url": "https://finance.yahoo.com/news/shapermint-expands-walmart-nyse-wmt-172117729.html"
            },
            {
                "headline": "Is this massive stock plunge a buying opportunity? A household-name retail giant's dividend history and profit margins tell a compelling story.",
                "publication_date": "2025-04-11T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.765",
                "source": "Motley Fool",
                "ticker": "WMT",
                "title": "1 Magnificent S&P 500 Dividend Stock Down 49% to Buy and Hold Forever",
                "url": "https://finance.yahoo.com/news/1-magnificent-p-500-dividend-120900674.html"
            },
            {
                "headline": "Analyst sees Walmart's mix of essentials, e-commerce, and trade war resilience as reasons to stay bullish",
                "publication_date": "2025-04-11T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5994",
                "source": "GuruFocus.com",
                "ticker": "WMT",
                "title": "Walmart Gets Buy Signal from Mizuho as Safe Bet in Unsteady Market",
                "url": "https://finance.yahoo.com/news/walmart-gets-buy-signal-mizuho-191120201.html"
            },
            {
                "headline": "We recently published a list of Jim Cramer Questions Market Logic and Dissects These 7 Key Stocks. In this article, we are going to take a look at where Walmart Inc. (NYSE:WMT) stands against other stocks that Jim Cramer discusses. In his latest appearance on CNBC’s Squawk on the Street, Jim Cramer unpacked the deepening uncertainty gripping […]",
                "publication_date": "2025-04-11T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.34",
                "source": "Insider Monkey",
                "ticker": "WMT",
                "title": "Jim Cramer on Walmart (WMT): “They have Pricing Power… The Chinese Can’t Go Up Against Walmart!”",
                "url": "https://finance.yahoo.com/news/jim-cramer-walmart-wmt-pricing-180021282.html"
            },
            {
                "headline": "US retailer Walmart has revealed the use of a new AI tool that allows it to cut lead times on fashion items by as much as 18 weeks.",
                "publication_date": "2025-04-11T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.2732",
                "source": "Just Style",
                "ticker": "WMT",
                "title": "AI, Gen AI tool helps Walmart cut fashion lead time by 18 weeks",
                "url": "https://finance.yahoo.com/news/ai-gen-ai-tool-helps-115952597.html"
            }
        ],
        "avgScore": 0.2437357142857143,
        "pctChange": 0.020797416397705853
    },
    "4 10 2025": {
        "importantArticles": [
            {
                "headline": "After recently attending Walmart’s (WMT) presentations, UBS remains upbeat on WMT stock. According to the Swiss bank, the retailer is executing well and has a good management team. Other Reasons for UBS’ Bullishness on WMT WMT can deliver strong results and beat the Street’s average expectations in almost any macroeconomic scenario, according to UBS. What’s […]",
                "publication_date": "2025-04-10T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8074",
                "source": "Insider Monkey",
                "ticker": "WMT",
                "title": "UBS Remains Bullish on Walmart (WMT) Despite Tariffs",
                "url": "https://finance.yahoo.com/news/ubs-remains-bullish-walmart-wmt-173642248.html"
            },
            {
                "headline": "Small-scale boutiques, brands and factories don’t have the deep pockets, diverse supply chains or flexibility enjoyed by chains like Walmart.",
                "publication_date": "2025-04-10T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.802",
                "source": "Retail Dive",
                "ticker": "WMT",
                "title": "Small businesses may take the brunt of tariffs, even when they’re based in the US",
                "url": "https://finance.yahoo.com/news/small-businesses-may-brunt-tariffs-120700669.html"
            },
            {
                "headline": "The retail giant isn’t immune to tariff fallout but is maintaining its outlook, in part because it sees market share opportunity, executives said Wednesday.",
                "publication_date": "2025-04-10T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7964",
                "source": "Retail Dive",
                "ticker": "WMT",
                "title": "At brick-and-mortar powerhouse Walmart, e-commerce turns profitable",
                "url": "https://finance.yahoo.com/news/brick-mortar-powerhouse-walmart-e-120000622.html"
            },
            {
                "headline": "(Bloomberg) -- International Business Machines Corp. spent months revising its diversity initiatives as conservative attacks and souring attitudes toward DEI shifted into a full-blown assault from President Donald Trump.Most Read from BloombergMidtown Office Building Evacuated on Concerns of Wall CollapseIn Chicago, a Former Steel Mill Looks to Make a Quantum LeapThe Secret Formula for Faster TrainsHelicopter Crashes Into Hudson River With Multiple FatalitiesInside the Quiet, Extravagant Expansi",
                "publication_date": "2025-04-10T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.7717",
                "source": "Bloomberg",
                "ticker": "WMT",
                "title": "IBM Informs Staff of DEI Retreat as Trump-Era Scrutiny Grows",
                "url": "https://finance.yahoo.com/news/ibm-informs-staff-dei-retreat-233048287.html"
            },
            {
                "headline": "America's retail giant gives an unexpected major update shocking many.",
                "publication_date": "2025-04-10T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.4019",
                "source": "TheStreet",
                "ticker": "WMT",
                "title": "Walmart makes shocking decision about its future amid uncertainty",
                "url": "https://finance.yahoo.com/news/walmart-makes-shocking-decision-future-161300474.html"
            },
            {
                "headline": "Dow Jones retail giant Walmart and other discount retailers were among the best stocks to watch amid recession fears.",
                "publication_date": "2025-04-10T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.1027",
                "source": "Investor's Business Daily",
                "ticker": "WMT",
                "title": "Dow Jones Giant Walmart, Discount Retailers Hold Up In Market Sell-Off On Recession Fears",
                "url": "https://finance.yahoo.com/m/08b6f26b-dbfe-3579-8f2b-4c49141c36ce/dow-jones-giant-walmart-.html"
            }
        ],
        "avgScore": 0.24158947368421063,
        "pctChange": 0.024169544494584822
    },
    "4 9 2025": {
        "importantArticles": [
            {
                "headline": "BENTONVILLE, Ark., April 09, 2025--Walmart (NYSE: WMT) is hosting its Investment Community Meeting where leadership is sharing its focus on driving growth and creating shareholder value. The meeting will highlight Walmart’s people-led, tech-powered omnichannel strategy, and why it is uniquely positioned to sustain attractive growth and create shareholder returns.",
                "publication_date": "2025-04-09T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9517",
                "source": "Business Wire",
                "ticker": "WMT",
                "title": "Walmart Showcases Business Strategy Focused on Driving Growth and Shareholder Value",
                "url": "https://finance.yahoo.com/news/walmart-showcases-business-strategy-focused-110600175.html"
            },
            {
                "headline": "BENTONVILLE, Ark., April 09, 2025--Today, Walmart hosted its investment meeting where the company’s leadership team highlighted the consistency and strength of the company’s business operations and strategy. Walmart showcased its resiliency and its ability to innovate, change, and continue to deliver growth and shareholder value.",
                "publication_date": "2025-04-09T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9136",
                "source": "Business Wire",
                "ticker": "WMT",
                "title": "Walmart Reaffirms Strategy Fit for Today and the Future",
                "url": "https://finance.yahoo.com/news/walmart-reaffirms-strategy-fit-today-203000552.html"
            },
            {
                "headline": "Walmart Inc. (NYSE:WMT) stock traded higher on Wednesday after the company disclosed that it was hosting its Investment Community Meeting and reaffirmed first-quarter guidance. The retail giant continues to see first-quarter FY26 sales growth of 3% – 4% in the constant currencies. Walmart stated that its FY26 sales and operating income growth guidance remains unchanged. However, the range for first-quarter operating income growth has widened due to a less favorable category mix, and higher casua",
                "publication_date": "2025-04-09T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8627",
                "source": "Benzinga",
                "ticker": "WMT",
                "title": "Walmart Maintains Steady Growth Forecast Despite Tariffs",
                "url": "https://finance.yahoo.com/news/walmart-maintains-steady-growth-forecast-134221028.html"
            },
            {
                "headline": "Futures are again under pressure this morning as President Trump's reciprocal tariffs go into effect. China further escalated tensions this morning and retaliated by slapping an 84% tariff on US goods. Wall Street has been under intense pressure since the White House announced the tariff plan last week, with the S&P 500 sinking nearly 12%. Major companies are scrambling in the wake of the tariffs. Delta Air Lines (DAL) pulled its guidance, citing uncertainty. Walmart (WMT) also pulled its quarterly operating income forecast. Stay up to date on the latest market action, minute-by-minute, with Yahoo Finance's Market Minute.",
                "publication_date": "2025-04-09T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.802",
                "source": "Yahoo Finance Video",
                "ticker": "WMT",
                "title": "Trump tariffs take hold, Delta pulls guidance: Market Minute",
                "url": "https://finance.yahoo.com/video/trump-tariffs-hold-delta-pulls-120334975.html"
            },
            {
                "headline": "The trade war raises GOP’s stakes in its budget battle, Walmart and Costco will offer insight into consumer spending, and more news to start your day.",
                "publication_date": "2025-04-09T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.7579",
                "source": "Barrons.com",
                "ticker": "WMT",
                "title": "Trump Tariffs Rock Treasuries. Why Stock Markets Face More Pain Amid China Standoff and 4 Other Things to Know Today.",
                "url": "https://finance.yahoo.com/m/a0d94ff8-2beb-3dbd-8eb3-a2454e41d3cc/trump-tariffs-rock.html"
            },
            {
                "headline": "Dow Jones and other indexes rose amid intensifying trade wars between the U.S. and China. Nvidia and Tesla jumped.",
                "publication_date": "2025-04-09T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5574",
                "source": "Investor's Business Daily",
                "ticker": "WMT",
                "title": "Stock Market Today: Dow Jones Roars On Trump Tariff Pause; Nvidia, Tesla, Apple Charge Higher (Live Coverage)",
                "url": "https://finance.yahoo.com/m/7f6a5da2-39f1-311c-9a83-82fabf96c95e/stock-market-today-dow-jones.html"
            }
        ],
        "avgScore": 0.08683043478260873,
        "pctChange": 0.011272345462396237
    },
    "4 8 2025": {
        "importantArticles": [
            {
                "headline": "BENTONVILLE, Ark., April 08, 2025--As one of the most valuable memberships in retail, Walmart+ is celebrating its continued momentum by rolling out the blue carpet for the return of Walmart+ Week, taking place from April 28 through May 4. This year’s members-only, weeklong event celebrates both loyal and new members with an exciting array of exclusive rewards and offers that build upon existing benefits, including:",
                "publication_date": "2025-04-08T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9729",
                "source": "Business Wire",
                "ticker": "WMT",
                "title": "Walmart+ Goes All-In with Week of Exclusive Member Benefit Savings for Walmart+ Week",
                "url": "https://finance.yahoo.com/news/walmart-goes-week-exclusive-member-110000405.html"
            },
            {
                "headline": "In a 1997 speech, famed investor Peter Lynch imparted his investment wisdom, emphasizing the significance of comprehending the business behind the stock and the ineffectiveness of economic forecasting. What Happened: Lynch, celebrated for his ...",
                "publication_date": "2025-04-08T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7845",
                "source": "Benzinga",
                "ticker": "WMT",
                "title": "Peter Lynch's Advice: 'If You Can't Explain to an 11-Year-Old in Two Minutes or Less Why You Own the Stock, You Shouldn't Own It'",
                "url": "https://finance.yahoo.com/news/peter-lynchs-advice-cant-explain-003040470.html"
            },
            {
                "headline": "Expensive stocks typically earn their valuations through superior growth rates that other companies simply can’t match. The flip side though is that these lofty expectations make them particularly susceptible to drawdowns when market sentiment shifts.",
                "publication_date": "2025-04-08T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7269",
                "source": "StockStory",
                "ticker": "WMT",
                "title": "2 High-Flying Stocks on Our Buy List and 1 to Avoid",
                "url": "https://finance.yahoo.com/news/2-high-flying-stocks-buy-142430018.html"
            },
            {
                "headline": "Walmart could be walloped in a worst-case tariff scenario.",
                "publication_date": "2025-04-08T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Yahoo Finance",
                "ticker": "WMT",
                "title": "Trump tariffs pose significant profit risk to Walmart",
                "url": "https://finance.yahoo.com/news/trump-tariffs-pose-significant-profit-risk-to-walmart-123419619.html"
            },
            {
                "headline": "Investors and other retailers will be looking for clues on how to navigate the new tariff environment.",
                "publication_date": "2025-04-08T00:00:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Barrons.com",
                "ticker": "WMT",
                "title": "All of Retail Wants a Tariff Playbook. Walmart Could Deliver.",
                "url": "https://finance.yahoo.com/m/3e8fff95-980a-3b8e-947d-f95b65741dbf/all-of-retail-wants-a-tariff.html"
            },
            {
                "headline": "Today's Research Daily features new research reports on 16 major stocks, including Walmart Inc. (WMT), The Coca-Cola Company (KO) and HSBC Holdings plc (HSBC), as well a micro-cap stock Friedman Industries Inc. Common Stock (FRD).",
                "publication_date": "2025-04-08T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.2732",
                "source": "Zacks",
                "ticker": "WMT",
                "title": "Top Stock Reports for Walmart, Coca-Cola & HSBC",
                "url": "https://finance.yahoo.com/news/top-stock-reports-walmart-coca-203100481.html"
            }
        ],
        "avgScore": 0.4831307692307693,
        "pctChange": 0.0954884151017422
    },
    "4 7 2025": {
        "importantArticles": [
            {
                "headline": "Walmart's Financial Landscape: Challenges and Opportunities",
                "publication_date": "2025-04-07T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.4404",
                "source": "GuruFocus.com",
                "ticker": "WMT",
                "title": "What Growth Opportunities Does Walmart See for Fiscal 2025?",
                "url": "https://finance.yahoo.com/news/growth-opportunities-does-walmart-see-193514427.html"
            },
            {
                "headline": "Investing.com -- Citi upgraded Dollar General (NYSE:DG) to Neutral from Sell saying the discount retailer is better positioned than peers to weather the new tariff environment and a potential consumer slowdown.",
                "publication_date": "2025-04-07T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.4404",
                "source": "Investing.com",
                "ticker": "WMT",
                "title": "Citi upgrades Dollar General as it has limited tariff exposure",
                "url": "https://finance.yahoo.com/news/citi-upgrades-dollar-general-limited-133235825.html"
            },
            {
                "headline": "Walmart's (WMT) advertising business is likely to drive growth in the next five years, with the pote",
                "publication_date": "2025-04-07T00:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.3818",
                "source": "MT Newswires",
                "ticker": "WMT",
                "title": "Walmart's Advertising Business Expected to Drive Growth Over Next 5 Years, UBS Says",
                "url": "https://finance.yahoo.com/news/walmart-apos-advertising-business-expected-160452232.html"
            },
            {
                "headline": "The markets are undergoing one of the worst stretches in recent memory as Trump tariff fears take hold. Here is what is top of mind with the Yahoo Finance community.",
                "publication_date": "2025-04-07T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.7269",
                "source": "Yahoo Finance",
                "ticker": "WMT",
                "title": "'I find it impossible to catch my bearings': Yahoo Finance community reacts to Trump tariff stock market plunge",
                "url": "https://finance.yahoo.com/news/i-find-it-impossible-to-catch-my-bearings-yahoo-finance-community-reacts-to-trump-tariff-stock-market-plunge-125401044.html"
            },
            {
                "headline": "Oppenheimer cuts Walmart target due to anticipated impact of tariffs and the negative effect on discretionary spending later in the year.",
                "publication_date": "2025-04-07T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.7096",
                "source": "Investopedia",
                "ticker": "WMT",
                "title": "Oppenheimer Cuts Its Price Target on Walmart Stock",
                "url": "https://finance.yahoo.com/news/oppenheimer-cuts-price-target-walmart-160437974.html"
            },
            {
                "headline": "The White House denied reports on Monday of an alleged 90-day pause on reciprocal tariffs, which are still set to take effect Wednesday, April 9. Wedbush Securities managing director of equity research for retail hardlines Seth Basham joins Catalysts to discuss how retailers will absorb tariff-fueled price increases, noting that most retailers will be forced to pass on some of the cost to their consumers. Basham notes that retailers with more pricing power, such as auto parts retailers and mass merchants that sell consumer staples, will be more equipped to withstand the impact of these tariffs. To watch more expert insights and analysis on the latest market action, check out more Catalysts&nbsp;here.",
                "publication_date": "2025-04-07T00:00:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5719",
                "source": "Yahoo Finance Video",
                "ticker": "WMT",
                "title": "Trump tariffs: Which retailers will be most resilient",
                "url": "https://finance.yahoo.com/video/trump-tariffs-retailers-most-resilient-183000691.html"
            }
        ],
        "avgScore": -0.06334615384615386,
        "pctChange": -0.024334974006545097
    },
    "coef": 0.1384615384615385,
    "avgCoef": -0.015099337091009132,
    "similar": {
        "UAA": 0.7098901098901099,
        "ERIC": 0.6483516483516484,
        "ABEV": 0.6072610935391697,
        "HBAN": 0.5868131868131868
    }
}