{
    "4 14 2025": {
        "importantArticles": [
            {
                "headline": "Turbulence unleashed by President Donald Trump's tariffs could rock global shipments of shrimp to the United States, with exporters in biggest supplier India saying they endanger 2,000 containers packed with the frozen delicacy.  But Ecuador, thousands of kilometres nearer to the United States faces a lower tariff rate and stands to benefit, the exporters say, as shrimp is its most important export after oil.  India's shrimp industry is staring at a tariff of 26% under Trump's July plan, which threatens a thriving $7-billion seafood export market heavily reliant on U.S. supermarket chains such as Walmart and Kroger as buyers look to renegotiate rates.",
                "publication_date": "2025-04-14T01:37:51.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7776",
                "source": "Reuters",
                "ticker": "WMT",
                "title": "Indian shrimp industry sails in troubled waters after Trump tariffs",
                "url": "https://finance.yahoo.com/news/indian-shrimp-industry-sails-troubled-013751971.html"
            },
            {
                "headline": "Walmart (WMT) has received quite a bit of attention from Zacks.com users lately. Therefore, it is wise to be aware of the facts that can impact the stock's prospects.",
                "publication_date": "2025-04-14T13:00:15.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.6486",
                "source": "Zacks",
                "ticker": "WMT",
                "title": "Walmart Inc. (WMT) is Attracting Investor Attention: Here is What You Should Know",
                "url": "https://finance.yahoo.com/news/walmart-inc-wmt-attracting-investor-130015736.html"
            },
            {
                "headline": "MAKSY vs. WMT: Which Stock Is the Better Value Option?",
                "publication_date": "2025-04-14T15:40:09.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.6486",
                "source": "Zacks",
                "ticker": "WMT",
                "title": "MAKSY or WMT: Which Is the Better Value Stock Right Now?",
                "url": "https://finance.yahoo.com/news/maksy-wmt-better-value-stock-154009925.html"
            },
            {
                "headline": "Walmart (WMT) is gaining traction with higher-income shoppers and expanding profit drivers like advertising, memberships, and its Sam's Club business. Mizuho Americas director and senior analyst David Bellinger joins Asking for a Trend to explain why he sees Walmart as the \"complete package\" and why downside risks appear limited. To watch more expert insights and analysis on the latest market action, check out more Asking for a Trend&nbsp;here.",
                "publication_date": "2025-04-14T22:17:12.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.4939",
                "source": "Yahoo Finance Video",
                "ticker": "WMT",
                "title": "Why this analyst says Walmart is the 'complete package'",
                "url": "https://finance.yahoo.com/video/why-analyst-says-walmart-complete-221712972.html"
            },
            {
                "headline": "The long-term outlooks of Walmart (WMT) and Amazon.com (AMZN) are positive, partly because both names have “pricing power,” Jason Brown, the founder of The Brown Report told Schwab Network recently. The network described Brown as “an expert on stocks.” WMT Has “Huge Pricing Power,” Brown Says In addition to having “huge pricing power,” WMT is […]",
                "publication_date": "2025-04-14T16:16:42.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.5574",
                "source": "Insider Monkey",
                "ticker": "WMT",
                "title": "Top Stock Picker Is Bullish on WMT, AMZN",
                "url": "https://finance.yahoo.com/news/top-stock-picker-bullish-wmt-161642297.html"
            },
            {
                "headline": "MAKSY vs. WMT: Which Stock Is the Better Value Option?",
                "publication_date": "2025-04-14T15:40:09.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.6486",
                "source": "Zacks",
                "ticker": "WMT",
                "title": "MAKSY or WMT: Which Is the Better Value Stock Right Now?",
                "url": "https://finance.yahoo.com/news/maksy-wmt-better-value-stock-154009925.html"
            }
        ],
        "avgScore": 0.6252199999999999
    },
    "4 11 2025": {
        "importantArticles": [
            {
                "headline": "We recently published a list of 10 Best Organic Food Stocks to Buy According to Billionaires. In this article, we are going to take a look at where Walmart Inc. (NYSE:WMT) stands against other best organic food stocks to buy according to billionaires. Overview of the Global Organic Food Industry According to a report by […]",
                "publication_date": "2025-04-11T21:20:51.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8555",
                "source": "Insider Monkey",
                "ticker": "WMT",
                "title": "Why Walmart Inc. (WMT) is Among the Best Organic Food Stocks to Buy According to Billionaires",
                "url": "https://finance.yahoo.com/news/why-walmart-inc-wmt-among-212051434.html"
            },
            {
                "headline": "Walmart (NYSE:WMT) recently saw the launch of Shapermint's Core collection at its stores, highlighting the company's ongoing efforts to diversify product offerings and appeal to a broader customer base. Last week, Walmart's stock price rose by 3.84%, a move that reflects well within the broader positive market trends, as the Dow Jones and other major indices also experienced gains amid volatility driven by trade discussions and economic data. While the Shapermint launch might have added some...",
                "publication_date": "2025-04-11T17:21:17.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7964",
                "source": "Simply Wall St.",
                "ticker": "WMT",
                "title": "Shapermint Expands Into Walmart (NYSE:WMT) Bringing Shaping Essentials To Wider Audience",
                "url": "https://finance.yahoo.com/news/shapermint-expands-walmart-nyse-wmt-172117729.html"
            },
            {
                "headline": "Is this massive stock plunge a buying opportunity? A household-name retail giant's dividend history and profit margins tell a compelling story.",
                "publication_date": "2025-04-11T12:09:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.765",
                "source": "Motley Fool",
                "ticker": "WMT",
                "title": "1 Magnificent S&P 500 Dividend Stock Down 49% to Buy and Hold Forever",
                "url": "https://finance.yahoo.com/news/1-magnificent-p-500-dividend-120900674.html"
            },
            {
                "headline": "Analyst sees Walmart's mix of essentials, e-commerce, and trade war resilience as reasons to stay bullish",
                "publication_date": "2025-04-11T19:11:20.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5994",
                "source": "GuruFocus.com",
                "ticker": "WMT",
                "title": "Walmart Gets Buy Signal from Mizuho as Safe Bet in Unsteady Market",
                "url": "https://finance.yahoo.com/news/walmart-gets-buy-signal-mizuho-191120201.html"
            },
            {
                "headline": "We recently published a list of Jim Cramer Questions Market Logic and Dissects These 7 Key Stocks. In this article, we are going to take a look at where Walmart Inc. (NYSE:WMT) stands against other stocks that Jim Cramer discusses. In his latest appearance on CNBC’s Squawk on the Street, Jim Cramer unpacked the deepening uncertainty gripping […]",
                "publication_date": "2025-04-11T18:00:21.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.34",
                "source": "Insider Monkey",
                "ticker": "WMT",
                "title": "Jim Cramer on Walmart (WMT): “They have Pricing Power… The Chinese Can’t Go Up Against Walmart!”",
                "url": "https://finance.yahoo.com/news/jim-cramer-walmart-wmt-pricing-180021282.html"
            },
            {
                "headline": "US retailer Walmart has revealed the use of a new AI tool that allows it to cut lead times on fashion items by as much as 18 weeks.",
                "publication_date": "2025-04-11T11:59:52.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.2732",
                "source": "Just Style",
                "ticker": "WMT",
                "title": "AI, Gen AI tool helps Walmart cut fashion lead time by 18 weeks",
                "url": "https://finance.yahoo.com/news/ai-gen-ai-tool-helps-115952597.html"
            }
        ],
        "avgScore": 0.2437357142857143
    },
    "4 10 2025": {
        "importantArticles": [
            {
                "headline": "After recently attending Walmart’s (WMT) presentations, UBS remains upbeat on WMT stock. According to the Swiss bank, the retailer is executing well and has a good management team. Other Reasons for UBS’ Bullishness on WMT WMT can deliver strong results and beat the Street’s average expectations in almost any macroeconomic scenario, according to UBS. What’s […]",
                "publication_date": "2025-04-10T17:36:42.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8074",
                "source": "Insider Monkey",
                "ticker": "WMT",
                "title": "UBS Remains Bullish on Walmart (WMT) Despite Tariffs",
                "url": "https://finance.yahoo.com/news/ubs-remains-bullish-walmart-wmt-173642248.html"
            },
            {
                "headline": "Small-scale boutiques, brands and factories don’t have the deep pockets, diverse supply chains or flexibility enjoyed by chains like Walmart.",
                "publication_date": "2025-04-10T12:07:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.802",
                "source": "Retail Dive",
                "ticker": "WMT",
                "title": "Small businesses may take the brunt of tariffs, even when they’re based in the US",
                "url": "https://finance.yahoo.com/news/small-businesses-may-brunt-tariffs-120700669.html"
            },
            {
                "headline": "The retail giant isn’t immune to tariff fallout but is maintaining its outlook, in part because it sees market share opportunity, executives said Wednesday.",
                "publication_date": "2025-04-10T12:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7964",
                "source": "Retail Dive",
                "ticker": "WMT",
                "title": "At brick-and-mortar powerhouse Walmart, e-commerce turns profitable",
                "url": "https://finance.yahoo.com/news/brick-mortar-powerhouse-walmart-e-120000622.html"
            },
            {
                "headline": "(Bloomberg) -- International Business Machines Corp. spent months revising its diversity initiatives as conservative attacks and souring attitudes toward DEI shifted into a full-blown assault from President Donald Trump.Most Read from BloombergMidtown Office Building Evacuated on Concerns of Wall CollapseIn Chicago, a Former Steel Mill Looks to Make a Quantum LeapThe Secret Formula for Faster TrainsHelicopter Crashes Into Hudson River With Multiple FatalitiesInside the Quiet, Extravagant Expansi",
                "publication_date": "2025-04-10T23:30:48.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.7717",
                "source": "Bloomberg",
                "ticker": "WMT",
                "title": "IBM Informs Staff of DEI Retreat as Trump-Era Scrutiny Grows",
                "url": "https://finance.yahoo.com/news/ibm-informs-staff-dei-retreat-233048287.html"
            },
            {
                "headline": "America's retail giant gives an unexpected major update shocking many.",
                "publication_date": "2025-04-10T16:13:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.4019",
                "source": "TheStreet",
                "ticker": "WMT",
                "title": "Walmart makes shocking decision about its future amid uncertainty",
                "url": "https://finance.yahoo.com/news/walmart-makes-shocking-decision-future-161300474.html"
            },
            {
                "headline": "Dow Jones retail giant Walmart and other discount retailers were among the best stocks to watch amid recession fears.",
                "publication_date": "2025-04-10T12:00:54.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.1027",
                "source": "Investor's Business Daily",
                "ticker": "WMT",
                "title": "Dow Jones Giant Walmart, Discount Retailers Hold Up In Market Sell-Off On Recession Fears",
                "url": "https://finance.yahoo.com/m/08b6f26b-dbfe-3579-8f2b-4c49141c36ce/dow-jones-giant-walmart-.html"
            }
        ],
        "avgScore": 0.23054444444444455
    },
    "4 9 2025": {
        "importantArticles": [
            {
                "headline": "BENTONVILLE, Ark., April 09, 2025--Walmart (NYSE: WMT) is hosting its Investment Community Meeting where leadership is sharing its focus on driving growth and creating shareholder value. The meeting will highlight Walmart’s people-led, tech-powered omnichannel strategy, and why it is uniquely positioned to sustain attractive growth and create shareholder returns.",
                "publication_date": "2025-04-09T11:06:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9517",
                "source": "Business Wire",
                "ticker": "WMT",
                "title": "Walmart Showcases Business Strategy Focused on Driving Growth and Shareholder Value",
                "url": "https://finance.yahoo.com/news/walmart-showcases-business-strategy-focused-110600175.html"
            },
            {
                "headline": "BENTONVILLE, Ark., April 09, 2025--Today, Walmart hosted its investment meeting where the company’s leadership team highlighted the consistency and strength of the company’s business operations and strategy. Walmart showcased its resiliency and its ability to innovate, change, and continue to deliver growth and shareholder value.",
                "publication_date": "2025-04-09T20:30:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9136",
                "source": "Business Wire",
                "ticker": "WMT",
                "title": "Walmart Reaffirms Strategy Fit for Today and the Future",
                "url": "https://finance.yahoo.com/news/walmart-reaffirms-strategy-fit-today-203000552.html"
            },
            {
                "headline": "Walmart Inc. (NYSE:WMT) stock traded higher on Wednesday after the company disclosed that it was hosting its Investment Community Meeting and reaffirmed first-quarter guidance. The retail giant continues to see first-quarter FY26 sales growth of 3% – 4% in the constant currencies. Walmart stated that its FY26 sales and operating income growth guidance remains unchanged. However, the range for first-quarter operating income growth has widened due to a less favorable category mix, and higher casua",
                "publication_date": "2025-04-09T13:42:21.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.8627",
                "source": "Benzinga",
                "ticker": "WMT",
                "title": "Walmart Maintains Steady Growth Forecast Despite Tariffs",
                "url": "https://finance.yahoo.com/news/walmart-maintains-steady-growth-forecast-134221028.html"
            },
            {
                "headline": "Futures are again under pressure this morning as President Trump's reciprocal tariffs go into effect. China further escalated tensions this morning and retaliated by slapping an 84% tariff on US goods. Wall Street has been under intense pressure since the White House announced the tariff plan last week, with the S&P 500 sinking nearly 12%. Major companies are scrambling in the wake of the tariffs. Delta Air Lines (DAL) pulled its guidance, citing uncertainty. Walmart (WMT) also pulled its quarterly operating income forecast. Stay up to date on the latest market action, minute-by-minute, with Yahoo Finance's Market Minute.",
                "publication_date": "2025-04-09T12:03:34.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.802",
                "source": "Yahoo Finance Video",
                "ticker": "WMT",
                "title": "Trump tariffs take hold, Delta pulls guidance: Market Minute",
                "url": "https://finance.yahoo.com/video/trump-tariffs-hold-delta-pulls-120334975.html"
            },
            {
                "headline": "The trade war raises GOP’s stakes in its budget battle, Walmart and Costco will offer insight into consumer spending, and more news to start your day.",
                "publication_date": "2025-04-09T10:51:00.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.7579",
                "source": "Barrons.com",
                "ticker": "WMT",
                "title": "Trump Tariffs Rock Treasuries. Why Stock Markets Face More Pain Amid China Standoff and 4 Other Things to Know Today.",
                "url": "https://finance.yahoo.com/m/a0d94ff8-2beb-3dbd-8eb3-a2454e41d3cc/trump-tariffs-rock.html"
            },
            {
                "headline": "Dow Jones and other indexes rose amid intensifying trade wars between the U.S. and China. Nvidia and Tesla jumped.",
                "publication_date": "2025-04-09T14:59:08.000Z",
                "sentiment": "Negative",
                "sentimentScore": "-0.5574",
                "source": "Investor's Business Daily",
                "ticker": "WMT",
                "title": "Stock Market Today: Dow Jones Roars On Trump Tariff Pause; Nvidia, Tesla, Apple Charge Higher (Live Coverage)",
                "url": "https://finance.yahoo.com/m/7f6a5da2-39f1-311c-9a83-82fabf96c95e/stock-market-today-dow-jones.html"
            }
        ],
        "avgScore": 0.08876000000000003
    },
    "4 8 2025": {
        "importantArticles": [
            {
                "headline": "BENTONVILLE, Ark., April 08, 2025--As one of the most valuable memberships in retail, Walmart+ is celebrating its continued momentum by rolling out the blue carpet for the return of Walmart+ Week, taking place from April 28 through May 4. This year’s members-only, weeklong event celebrates both loyal and new members with an exciting array of exclusive rewards and offers that build upon existing benefits, including:",
                "publication_date": "2025-04-08T11:00:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.9729",
                "source": "Business Wire",
                "ticker": "WMT",
                "title": "Walmart+ Goes All-In with Week of Exclusive Member Benefit Savings for Walmart+ Week",
                "url": "https://finance.yahoo.com/news/walmart-goes-week-exclusive-member-110000405.html"
            },
            {
                "headline": "In a 1997 speech, famed investor Peter Lynch imparted his investment wisdom, emphasizing the significance of comprehending the business behind the stock and the ineffectiveness of economic forecasting. What Happened: Lynch, celebrated for his ...",
                "publication_date": "2025-04-08T00:30:40.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7845",
                "source": "Benzinga",
                "ticker": "WMT",
                "title": "Peter Lynch's Advice: 'If You Can't Explain to an 11-Year-Old in Two Minutes or Less Why You Own the Stock, You Shouldn't Own It'",
                "url": "https://finance.yahoo.com/news/peter-lynchs-advice-cant-explain-003040470.html"
            },
            {
                "headline": "Expensive stocks typically earn their valuations through superior growth rates that other companies simply can’t match. The flip side though is that these lofty expectations make them particularly susceptible to drawdowns when market sentiment shifts.",
                "publication_date": "2025-04-08T14:24:30.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.7269",
                "source": "StockStory",
                "ticker": "WMT",
                "title": "2 High-Flying Stocks on Our Buy List and 1 to Avoid",
                "url": "https://finance.yahoo.com/news/2-high-flying-stocks-buy-142430018.html"
            },
            {
                "headline": "Investors and other retailers will be looking for clues on how to navigate the new tariff environment.",
                "publication_date": "2025-04-08T16:33:00.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Barrons.com",
                "ticker": "WMT",
                "title": "All of Retail Wants a Tariff Playbook. Walmart Could Deliver.",
                "url": "https://finance.yahoo.com/m/3e8fff95-980a-3b8e-947d-f95b65741dbf/all-of-retail-wants-a-tariff.html"
            },
            {
                "headline": "Walmart could be walloped in a worst-case tariff scenario.",
                "publication_date": "2025-04-08T12:34:19.000Z",
                "sentiment": "Neutral",
                "sentimentScore": "0.0",
                "source": "Yahoo Finance",
                "ticker": "WMT",
                "title": "Trump tariffs pose significant profit risk to Walmart",
                "url": "https://finance.yahoo.com/news/trump-tariffs-pose-significant-profit-risk-to-walmart-123419619.html"
            },
            {
                "headline": "Today's Research Daily features new research reports on 16 major stocks, including Walmart Inc. (WMT), The Coca-Cola Company (KO) and HSBC Holdings plc (HSBC), as well a micro-cap stock Friedman Industries Inc. Common Stock (FRD).",
                "publication_date": "2025-04-08T20:31:00.000Z",
                "sentiment": "Positive",
                "sentimentScore": "0.2732",
                "source": "Zacks",
                "ticker": "WMT",
                "title": "Top Stock Reports for Walmart, Coca-Cola & HSBC",
                "url": "https://finance.yahoo.com/news/top-stock-reports-walmart-coca-203100481.html"
            }
        ],
        "avgScore": 0.4831307692307693
    },
    "coef": -0.49999999999999994,
    "avgCoef": 0.1872948561109244
}