{
    "Important Articles": [
        {
            "headline": "We recently published a list of the 12 Best Oil and Gas Dividend Stocks According to Billionaires. In this article, we are going to take a look at where Exxon Mobil Corporation (NYSE:XOM) stands against other best oil and gas dividend stocks to invest in according to billionaires. The United States of America is now […]",
            "publication_date": "2025-03-31T13:26:56.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.9042",
            "source": "Insider Monkey",
            "ticker": "XOM",
            "title": "Is Exxon Mobil Corporation (XOM) the Best Oil and Gas Dividend Stock According to Billionaires?",
            "url": "https://finance.yahoo.com/news/exxon-mobil-corporation-xom-best-132656976.html"
        },
        {
            "headline": "SPRING, Texas, April 02, 2025--ExxonMobil (NYSE: XOM) today announced Karen T. McKee, president of ExxonMobil Product Solutions Company and vice president Exxon Mobil Corporation, will retire effective May 1, 2025. The Board of Directors has appointed Matt Crocker president, ExxonMobil Product Solutions Company and vice president Exxon Mobil Corporation. He will succeed McKee effective May 1, 2025.",
            "publication_date": "2025-04-02T16:27:00.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.8957",
            "source": "Business Wire",
            "ticker": "XOM",
            "title": "ExxonMobil Announces Leadership Changes",
            "url": "https://finance.yahoo.com/news/exxonmobil-announces-leadership-changes-162700791.html"
        },
        {
            "headline": "We recently published a list of 12 Best Consistent Dividend Stocks to Buy. In this article, we are going to take a look at where Exxon Mobil Corporation (NYSE:XOM) stands against other best consistent dividend stocks to buy. Over the past two years, persistently high inflation has led to increased borrowing costs, creating a difficult […]",
            "publication_date": "2025-03-26T22:11:21.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.8807",
            "source": "Insider Monkey",
            "ticker": "XOM",
            "title": "Is Exxon Mobil Corporation (XOM) the Best Consistent Dividend Stock to Buy?",
            "url": "https://finance.yahoo.com/news/exxon-mobil-corporation-xom-best-221121489.html"
        },
        {
            "headline": "(Bloomberg) -- US Secretary of State Marco Rubio warned Venezuela that any attempt to invade Guyana or threaten Exxon Mobil Corp.’s operations in the country would be a “very bad move.” Most Read from BloombergWhy Did the Government Declare War on My Adorable Tiny Truck?Gold-Rush Fever Returns to Historic New Zealand Mining TownHow SUVs Are Making Traffic WorseTrump Slashed International Aid. Geneva Is Feeling the Impact.These US Bridges Face High Risk of Catastrophic Ship StrikesRubio spoke les",
            "publication_date": "2025-03-27T19:52:13.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.9274",
            "source": "Bloomberg",
            "ticker": "XOM",
            "title": "Rubio Warns Venezuela Against Attacking Guyana, Exxon",
            "url": "https://finance.yahoo.com/news/rubio-warns-venezuela-against-attacking-195213426.html"
        },
        {
            "headline": "The company is still pumping out vast quantities of fossil fuels, but global economic uncertainty could spell trouble for its business.",
            "publication_date": "2025-03-28T09:28:00.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.7684",
            "source": "Motley Fool",
            "ticker": "XOM",
            "title": "Is ExxonMobil Stock a Buy Now?",
            "url": "https://finance.yahoo.com/news/exxonmobil-stock-buy-now-092800268.html"
        },
        {
            "headline": "Crude oil prices have slumped about 15% over the past year.  ExxonMobil (NYSE: XOM), Plains All American Pipeline (NASDAQ: PAA), and Chevron (NYSE: CVX) stand out to these three Motley Fool contributors for their ability to thrive amid oil price volatility.",
            "publication_date": "2025-03-30T09:09:00.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.6486",
            "source": "Motley Fool",
            "ticker": "XOM",
            "title": "Even Though Oil Prices Are Down, These 3 Energy Stocks Have Plenty of Fuel to Continue Growing",
            "url": "https://finance.yahoo.com/news/even-though-oil-prices-down-090900536.html"
        }
    ],
    "Avg Score": 0.22059411764705883
}