{
    "importantArticles": [
        {
            "headline": "SPRING, Texas, April 02, 2025--ExxonMobil (NYSE: XOM) today announced Karen T. McKee, president of ExxonMobil Product Solutions Company and vice president Exxon Mobil Corporation, will retire effective May 1, 2025. The Board of Directors has appointed Matt Crocker president, ExxonMobil Product Solutions Company and vice president Exxon Mobil Corporation. He will succeed McKee effective May 1, 2025.",
            "publication_date": "2025-04-02T16:27:00.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.8957",
            "source": "Business Wire",
            "ticker": "XOM",
            "title": "ExxonMobil Announces Leadership Changes",
            "url": "https://finance.yahoo.com/news/exxonmobil-announces-leadership-changes-162700791.html"
        },
        {
            "headline": "The move may come as a surprise, given that the U.S. benchmark oil price, West Texas Intermediate, is $69.36 per barrel compared to an average of $76.63 in 2024.  Here's why ExxonMobil (NYSE: XOM), Chevron (NYSE: CVX), and ConocoPhillips (NYSE: COP) stand out as three balanced dividend stocks to buy now.  ExxonMobil, Chevron, and ConocoPhillips all have clear paths toward delivering strong free cash flow (FCF) even at current oil prices.",
            "publication_date": "2025-04-05T22:05:00.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.8834",
            "source": "Motley Fool",
            "ticker": "XOM",
            "title": "Energy Stocks Are Soaring. 3 High-Yield Oil Stocks to Buy Now.",
            "url": "https://finance.yahoo.com/news/energy-stocks-soaring-3-high-220500209.html"
        },
        {
            "headline": "XOM expects higher oil and natural gas, and stronger oil refining margins to boost first-quarter earnings by $900 million.",
            "publication_date": "2025-04-04T16:22:00.000Z",
            "sentiment": "Positive",
            "sentimentScore": "0.7783",
            "source": "Zacks",
            "ticker": "XOM",
            "title": "ExxonMobil Expects Earnings Boost in Q1 From Higher Commodity Prices",
            "url": "https://finance.yahoo.com/news/exxonmobil-expects-earnings-boost-q1-162200493.html"
        },
        {
            "headline": "In recent market turmoil, the Dow fell 2,200 points, the S&P 500 dropped 6%, and the Nasdaq entered a bear market, fueled by new tariffs and economic uncertainty. Amidst this backdrop, energy stocks faced declines, and Exxon Mobil (NYSE:XOM) experienced a flat price move for the month. The tariffs added pressure on oil prices, dragging down West Texas Intermediate futures and affecting the broader energy sector's outlook. Despite these challenges, Exxon's performance aligned with the market's...",
            "publication_date": "2025-04-05T18:05:01.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.4805",
            "source": "Simply Wall St.",
            "ticker": "XOM",
            "title": "Exxon Mobil (NYSE:XOM) Faces Pressure From New Tariffs As Energy Stocks See Turmoil",
            "url": "https://finance.yahoo.com/news/exxon-mobil-nyse-xom-faces-180501031.html"
        },
        {
            "headline": "Stocks may extend their post-tariff sell-off Friday after China retaliated with its own 34% duties on all U.S. goods, restrictions on rare earth exports, and other measures. Futures linked to the S&P 500, Nasdaq 100, and Dow Jones Industrial Average are all pointing to a lower open.",
            "publication_date": "2025-04-04T12:57:00.000Z",
            "sentiment": "Negative",
            "sentimentScore": "-0.128",
            "source": "Quartz",
            "ticker": "XOM",
            "title": "The Magnificent 7, Exxon, Nike, Lululemon: Stocks to watch today",
            "url": "https://finance.yahoo.com/news/mag-7-exxon-nike-lululemon-121000585.html"
        },
        {
            "headline": "Alibaba and KB Home are part of the Zacks Bull and Bear of the Day article.",
            "publication_date": "2025-04-04T12:37:00.000Z",
            "sentiment": "Neutral",
            "sentimentScore": "0.0",
            "source": "Zacks",
            "ticker": "XOM",
            "title": "Alibaba and KB Home have been highlighted as Zacks Bull and Bear of the Day",
            "url": "https://finance.yahoo.com/news/alibaba-kb-home-highlighted-zacks-123700738.html"
        }
    ],
    "avgScore": 0.3468529411764706,
    "todayPctChange": -0.05677604868134459,
    "vScore": -1.9692939473502846
}